[Killed] BlockStatement
src/legality.ts:141:97
  * and either end can be the pivot. Returns an empty list when a bond id does not
  * resolve, which callers must treat as "unknown", never as "no atoms".
  */
-export function sourceAtomIds(source: ElectronSource, state: MechanismState): readonly AtomId[] {
-  switch (source.kind) {
-    case "lonePair":
-    case "singleElectron":
-      return [source.atomId];
-    case "bond": {
-      const found = findBondInState(state, source.bondId);
-      return found === undefined ? [] : [found.bond.a, found.bond.b];
-    }
-  }
-}
+export function sourceAtomIds(source: ElectronSource, state: MechanismState): readonly AtomId[] {}
 
 /** The atoms an arrow's electrons land on or between. */
killedBy: sourceAtomIds and sinkAtomIds gives the one atom a lone pair or unpaired electron sits on
statusReason: expected undefined to deeply equal [ 'o1' ]

[Killed] ConditionalExpression
src/legality.ts:144:5
 export function sourceAtomIds(source: ElectronSource, state: MechanismState): readonly AtomId[] {
   switch (source.kind) {
     case "lonePair":
-    case "singleElectron":
-      return [source.atomId];
+    case "singleElectron":
     case "bond": {
       const found = findBondInState(state, source.bondId);
killedBy: sourceAtomIds and sinkAtomIds gives the one atom a lone pair or unpaired electron sits on
statusReason: expected [] to deeply equal [ 'o1' ]

[Killed] ArrayDeclaration
src/legality.ts:145:14
   switch (source.kind) {
     case "lonePair":
     case "singleElectron":
-      return [source.atomId];
+      return [];
     case "bond": {
       const found = findBondInState(state, source.bondId);
killedBy: sourceAtomIds and sinkAtomIds gives the one atom a lone pair or unpaired electron sits on
statusReason: expected [] to deeply equal [ 'o1' ]

[Killed] ConditionalExpression
src/legality.ts:146:5
     case "lonePair":
     case "singleElectron":
       return [source.atomId];
-    case "bond": {
-      const found = findBondInState(state, source.bondId);
-      return found === undefined ? [] : [found.bond.a, found.bond.b];
-    }
+    case "bond":
   }
 }
killedBy: an adjacency message lists both atoms of a bond source separates the two source atoms so the pivot that is missing is readable
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/legality.ts:146:18
     case "lonePair":
     case "singleElectron":
       return [source.atomId];
-    case "bond": {
-      const found = findBondInState(state, source.bondId);
-      return found === undefined ? [] : [found.bond.a, found.bond.b];
-    }
+    case "bond": {}
   }
 }
killedBy: sourceAtomIds and sinkAtomIds gives BOTH ends of a bond source, because either end can be the pivot
statusReason: expected undefined to deeply equal [ 'c1', 'cl1' ]

[Killed] EqualityOperator
src/legality.ts:148:14
       return [source.atomId];
     case "bond": {
       const found = findBondInState(state, source.bondId);
-      return found === undefined ? [] : [found.bond.a, found.bond.b];
+      return found !== undefined ? [] : [found.bond.a, found.bond.b];
     }
   }
killedBy: sourceAtomIds and sinkAtomIds gives BOTH ends of a bond source, because either end can be the pivot
statusReason: expected [] to deeply equal [ 'c1', 'cl1' ]

[Killed] ConditionalExpression
src/legality.ts:148:14
       return [source.atomId];
     case "bond": {
       const found = findBondInState(state, source.bondId);
-      return found === undefined ? [] : [found.bond.a, found.bond.b];
+      return true ? [] : [found.bond.a, found.bond.b];
     }
   }
killedBy: sourceAtomIds and sinkAtomIds gives BOTH ends of a bond source, because either end can be the pivot
statusReason: expected [] to deeply equal [ 'c1', 'cl1' ]

[Killed] BlockStatement
src/legality.ts:154:68
 }
 
 /** The atoms an arrow's electrons land on or between. */
-export function sinkAtomIds(sink: ElectronSink): readonly AtomId[] {
-  return sink.kind === "atom" ? [sink.atomId] : [sink.atomIds[0], sink.atomIds[1]];
-}
+export function sinkAtomIds(sink: ElectronSink): readonly AtomId[] {}
 
 /**
killedBy: sourceAtomIds and sinkAtomIds gives one atom for an atom sink and two for a bond forming sink
statusReason: expected undefined to deeply equal [ 'cl1' ]

[Killed] ConditionalExpression
src/legality.ts:155:10
 
 /** The atoms an arrow's electrons land on or between. */
 export function sinkAtomIds(sink: ElectronSink): readonly AtomId[] {
-  return sink.kind === "atom" ? [sink.atomId] : [sink.atomIds[0], sink.atomIds[1]];
+  return false ? [sink.atomId] : [sink.atomIds[0], sink.atomIds[1]];
 }
 
killedBy: sourceAtomIds and sinkAtomIds gives one atom for an atom sink and two for a bond forming sink
statusReason: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/legality.ts:155:10
 
 /** The atoms an arrow's electrons land on or between. */
 export function sinkAtomIds(sink: ElectronSink): readonly AtomId[] {
-  return sink.kind === "atom" ? [sink.atomId] : [sink.atomIds[0], sink.atomIds[1]];
+  return sink.kind !== "atom" ? [sink.atomId] : [sink.atomIds[0], sink.atomIds[1]];
 }
 
killedBy: sourceAtomIds and sinkAtomIds gives one atom for an atom sink and two for a bond forming sink
statusReason: Cannot read properties of undefined (reading '0')

[Killed] BlockStatement
src/legality.ts:170:12
 export function arrowEndpointsShareAnAtom(
   arrow: ElectronFlowArrow,
   state: MechanismState,
-): boolean {
-  const sinks = new Set<AtomId>(sinkAtomIds(arrow.sink));
-  return sourceAtomIds(arrow.source, state).some((atomId) => sinks.has(atomId));
-}
+): boolean {}
 
 function describeSource(source: ElectronSource): string {
killedBy: arrowEndpointsShareAnAtom is true for a nucleophilic attack, pivoting on the nucleophile
statusReason: expected undefined to be true // Object.is equality

[Killed] ArrowFunction
src/legality.ts:172:50
   state: MechanismState,
 ): boolean {
   const sinks = new Set<AtomId>(sinkAtomIds(arrow.sink));
-  return sourceAtomIds(arrow.source, state).some((atomId) => sinks.has(atomId));
+  return sourceAtomIds(arrow.source, state).some(() => undefined);
 }
 
killedBy: arrowEndpointsShareAnAtom is true for a nucleophilic attack, pivoting on the nucleophile
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/legality.ts:172:10
   state: MechanismState,
 ): boolean {
   const sinks = new Set<AtomId>(sinkAtomIds(arrow.sink));
-  return sourceAtomIds(arrow.source, state).some((atomId) => sinks.has(atomId));
+  return sourceAtomIds(arrow.source, state).every(atomId => sinks.has(atomId));
 }
 
killedBy: arrowEndpointsShareAnAtom is true for a heterolysis, pivoting on the leaving atom
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/legality.ts:175:57
   return sourceAtomIds(arrow.source, state).some((atomId) => sinks.has(atomId));
 }
 
-function describeSource(source: ElectronSource): string {
-  switch (source.kind) {
-    case "lonePair":
-      return `a lone pair on ${source.atomId}`;
-    case "singleElectron":
-      return `the unpaired electron on ${source.atomId}`;
-    case "bond":
-      return `bond ${source.bondId}`;
-  }
-}
+function describeSource(source: ElectronSource): string {}
 
 function describeSink(sink: ElectronSink): string {
killedBy: NON DEGENERACY: an arrow has to claim something moved rejects a bond emptied out into the same bond
statusReason: expected 'it runs from undefined to between c1 …' to contain 'b1'

[Killed] ConditionalExpression
src/legality.ts:177:5
 
 function describeSource(source: ElectronSource): string {
   switch (source.kind) {
-    case "lonePair":
-      return `a lone pair on ${source.atomId}`;
+    case "lonePair":
     case "singleElectron":
       return `the unpaired electron on ${source.atomId}`;
killedBy: the wording of a finding, which is what a student is shown names a lone pair source and an atom sink in the message
statusReason: expected 'they share none, so the unpaired elec…' to be 'they share none, so a lone pair on o1…' // Object.is equality

[Killed] ConditionalExpression
src/legality.ts:179:5
   switch (source.kind) {
     case "lonePair":
       return `a lone pair on ${source.atomId}`;
-    case "singleElectron":
-      return `the unpaired electron on ${source.atomId}`;
+    case "singleElectron":
     case "bond":
       return `bond ${source.bondId}`;
killedBy: the wording of a finding, which is what a student is shown names a single electron source and a bond source by their own words
statusReason: expected 'it runs from bond undefined to atom b…' to be 'it runs from the unpaired electron on…' // Object.is equality

[Killed] StringLiteral
src/legality.ts:180:14
     case "lonePair":
       return `a lone pair on ${source.atomId}`;
     case "singleElectron":
-      return `the unpaired electron on ${source.atomId}`;
+      return ``;
     case "bond":
       return `bond ${source.bondId}`;
killedBy: the wording of a finding, which is what a student is shown names a single electron source and a bond source by their own words
statusReason: expected 'it runs from  to atom br1, which is t…' to be 'it runs from the unpaired electron on…' // Object.is equality

[Killed] ConditionalExpression
src/legality.ts:181:5
       return `a lone pair on ${source.atomId}`;
     case "singleElectron":
       return `the unpaired electron on ${source.atomId}`;
-    case "bond":
-      return `bond ${source.bondId}`;
+    case "bond":
   }
 }
killedBy: NON DEGENERACY: an arrow has to claim something moved rejects a bond emptied out into the same bond
statusReason: expected 'it runs from undefined to between c1 …' to contain 'b1'

[Killed] StringLiteral
src/legality.ts:181:10
       return `a lone pair on ${source.atomId}`;
     case "singleElectron":
       return `the unpaired electron on ${source.atomId}`;
-    case "bond":
+    case "":
       return `bond ${source.bondId}`;
   }
killedBy: NON DEGENERACY: an arrow has to claim something moved rejects a bond emptied out into the same bond
statusReason: expected 'it runs from undefined to between c1 …' to contain 'b1'

[Killed] BlockStatement
src/legality.ts:186:51
   }
 }
 
-function describeSink(sink: ElectronSink): string {
-  return sink.kind === "atom"
-    ? `atom ${sink.atomId}`
-    : `between ${sink.atomIds[0]} and ${sink.atomIds[1]}`;
-}
+function describeSink(sink: ElectronSink): string {}
 
 /**
killedBy: the wording of a finding, which is what a student is shown names a lone pair source and an atom sink in the message
statusReason: expected 'they share none, so a lone pair on o1…' to be 'they share none, so a lone pair on o1…' // Object.is equality

[Killed] ConditionalExpression
src/legality.ts:187:10
 }
 
 function describeSink(sink: ElectronSink): string {
-  return sink.kind === "atom"
+  return false
     ? `atom ${sink.atomId}`
     : `between ${sink.atomIds[0]} and ${sink.atomIds[1]}`;
killedBy: NON DEGENERACY: an arrow has to claim something moved rejects a lone pair taken off an atom and put back on the same atom
statusReason: Cannot read properties of undefined (reading '0')

[Killed] EqualityOperator
src/legality.ts:187:10
 }
 
 function describeSink(sink: ElectronSink): string {
-  return sink.kind === "atom"
+  return sink.kind !== "atom"
     ? `atom ${sink.atomId}`
     : `between ${sink.atomIds[0]} and ${sink.atomIds[1]}`;
killedBy: NON DEGENERACY: an arrow has to claim something moved rejects a lone pair taken off an atom and put back on the same atom
statusReason: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
src/legality.ts:188:7
 
 function describeSink(sink: ElectronSink): string {
   return sink.kind === "atom"
-    ? `atom ${sink.atomId}`
+    ? ``
     : `between ${sink.atomIds[0]} and ${sink.atomIds[1]}`;
 }
killedBy: the wording of a finding, which is what a student is shown names a lone pair source and an atom sink in the message
statusReason: expected 'they share none, so a lone pair on o1…' to be 'they share none, so a lone pair on o1…' // Object.is equality

[Killed] ArrayDeclaration
src/legality.ts:213:44
   arrows: readonly ElectronFlowArrow[],
   state: MechanismState,
 ): readonly ArrowLegalityFinding[] {
-  const findings: ArrowLegalityFinding[] = [];
+  const findings: ArrowLegalityFinding[] = ["Stryker was here"];
 
   // Running totals for the capacity rules. Filled on the first pass, judged after.
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/legality.ts:221:80
   const bondElectronsDrawn = new Map<string, number>();
   const bondOrderById = new Map<string, number>();
 
-  const add = (map: Map<string, number>, key: string, amount: number): void => {
-    map.set(key, (map.get(key) ?? 0) + amount);
-  };
+  const add = (map: Map<string, number>, key: string, amount: number): void => {};
 
   for (const arrow of arrows) {
killedBy: aggregate capacity findings name the right arrows, in a stable order gives the exact ceiling and draw on every aggregate capacity finding
statusReason: expected undefined to be 'arrow_source_has_no_electrons' // Object.is equality

[Killed] ArithmeticOperator
src/legality.ts:222:18
   const bondOrderById = new Map<string, number>();
 
   const add = (map: Map<string, number>, key: string, amount: number): void => {
-    map.set(key, (map.get(key) ?? 0) + amount);
+    map.set(key, (map.get(key) ?? 0) - amount);
   };
 
killedBy: a capacity finding names only the arrows that drew from THAT kind of source keeps a fishhook out of a lone pair overdraw at the same atom
statusReason: expected undefined to be 'a1 + a2' // Object.is equality

[Killed] LogicalOperator
src/legality.ts:222:19
   const bondOrderById = new Map<string, number>();
 
   const add = (map: Map<string, number>, key: string, amount: number): void => {
-    map.set(key, (map.get(key) ?? 0) + amount);
+    map.set(key, (map.get(key) && 0) + amount);
   };
 
killedBy: SOURCE DENSITY: an arrow starts on electrons that exist rejects a lone pair arrow off an atom with no lone pairs
statusReason: expected [ 'source_has_no_lone_pair' ] to include 'lone_pairs_overdrawn'

[Killed] BooleanLiteral
src/legality.ts:226:26
   };
 
   for (const arrow of arrows) {
-    let sourceResolves = true;
+    let sourceResolves = false;
     let sinkResolves = true;
 
killedBy: SOURCE DENSITY: an arrow starts on electrons that exist rejects a lone pair arrow off an atom with no lone pairs
statusReason: expected undefined to be 'arrow_source_has_no_electrons' // Object.is equality

[Killed] BooleanLiteral
src/legality.ts:227:24
 
   for (const arrow of arrows) {
     let sourceResolves = true;
-    let sinkResolves = true;
+    let sinkResolves = false;
 
     // RESOLUTION.
killedBy: NON DEGENERACY: an arrow has to claim something moved rejects a lone pair taken off an atom and put back on the same atom
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/legality.ts:230:9
     let sinkResolves = true;
 
     // RESOLUTION.
-    if (arrow.source.kind === "bond") {
+    if (true) {
       const found = findBondInState(state, arrow.source.bondId);
       if (found === undefined) {
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ { arrowId: 'a1', …(4) } ] to deeply equal []

[Killed] EqualityOperator
src/legality.ts:230:9
     let sinkResolves = true;
 
     // RESOLUTION.
-    if (arrow.source.kind === "bond") {
+    if (arrow.source.kind !== "bond") {
       const found = findBondInState(state, arrow.source.bondId);
       if (found === undefined) {
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ { arrowId: 'a1', …(4) }, …(1) ] to deeply equal []

[Killed] ConditionalExpression
src/legality.ts:232:11
     // RESOLUTION.
     if (arrow.source.kind === "bond") {
       const found = findBondInState(state, arrow.source.bondId);
-      if (found === undefined) {
+      if (false) {
         sourceResolves = false;
         findings.push({
killedBy: the wording of a finding, which is what a student is shown says an unresolvable bond source has no pair to move
statusReason: Cannot read properties of undefined (reading 'bond')

[Killed] ConditionalExpression
src/legality.ts:232:11
     // RESOLUTION.
     if (arrow.source.kind === "bond") {
       const found = findBondInState(state, arrow.source.bondId);
-      if (found === undefined) {
+      if (true) {
         sourceResolves = false;
         findings.push({
killedBy: the wording of a finding, which is what a student is shown names a single electron source and a bond source by their own words
statusReason: expected 'no species here has a bond with that …' to be 'it runs from bond b1 to between br1 a…' // Object.is equality

[Killed] BooleanLiteral
src/legality.ts:233:26
     if (arrow.source.kind === "bond") {
       const found = findBondInState(state, arrow.source.bondId);
       if (found === undefined) {
-        sourceResolves = false;
+        sourceResolves = true;
         findings.push({
           arrowId: arrow.id,
killedBy: the wording of a finding, which is what a student is shown says an unresolvable bond source has no pair to move
statusReason: expected [ { arrowId: 'a1', …(4) }, …(2) ] to have a length of 1 but got 3

[Killed] StringLiteral
src/legality.ts:238:21
           arrowId: arrow.id,
           rule: "source_bond_not_in_state",
           cause: "arrow_endpoint_not_in_state",
-          expected: `bond ${arrow.source.bondId} to be a bond in state ${state.id}`,
+          expected: ``,
           actual: "no species here has a bond with that id, so there is no pair to move",
         });
killedBy: the wording of a finding, which is what a student is shown says an unresolvable bond source has no pair to move
statusReason: expected '' to be 'bond b-absent to be a bond in state s…' // Object.is equality

[Killed] StringLiteral
src/legality.ts:239:19
           rule: "source_bond_not_in_state",
           cause: "arrow_endpoint_not_in_state",
           expected: `bond ${arrow.source.bondId} to be a bond in state ${state.id}`,
-          actual: "no species here has a bond with that id, so there is no pair to move",
+          actual: "",
         });
       } else {
killedBy: the finder as a whole maps every finding to a cause that exists in the registry and is blocking
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/legality.ts:241:14
           expected: `bond ${arrow.source.bondId} to be a bond in state ${state.id}`,
           actual: "no species here has a bond with that id, so there is no pair to move",
         });
-      } else {
-        bondOrderById.set(arrow.source.bondId, found.bond.order);
-        add(bondElectronsDrawn, arrow.source.bondId, arrow.electrons);
-      }
+      } else {}
     } else {
       const located = findAtomInState(state, arrow.source.atomId);
killedBy: the wording of a finding, which is what a student is shown names a single electron source and a bond source by their own words
statusReason: expected 'this arrow alone moves 2' to be 'it runs from bond b1 to between br1 a…' // Object.is equality

[Killed] BlockStatement
src/legality.ts:245:12
         bondOrderById.set(arrow.source.bondId, found.bond.order);
         add(bondElectronsDrawn, arrow.source.bondId, arrow.electrons);
       }
-    } else {
-      const located = findAtomInState(state, arrow.source.atomId);
-      if (located === undefined) {
-        sourceResolves = false;
-        findings.push({
-          arrowId: arrow.id,
-          rule: "source_atom_not_in_state",
-          cause: "arrow_endpoint_not_in_state",
-          expected: `atom ${arrow.source.atomId} to be present in state ${state.id}`,
-          actual: "it is not in any species here, so the arrow starts on nothing",
-        });
-      }
-    }
+    } else {}
 
     for (const atomId of sinkAtomIds(arrow.sink)) {
killedBy: RESOLUTION: every endpoint is in the from state names a source atom that is not there
statusReason: expected [ { arrowId: 'a1', …(4) }, …(2) ] to have a length of 1 but got 3

[Killed] BlockStatement
src/legality.ts:247:34
       }
     } else {
       const located = findAtomInState(state, arrow.source.atomId);
-      if (located === undefined) {
-        sourceResolves = false;
-        findings.push({
-          arrowId: arrow.id,
-          rule: "source_atom_not_in_state",
-          cause: "arrow_endpoint_not_in_state",
-          expected: `atom ${arrow.source.atomId} to be present in state ${state.id}`,
-          actual: "it is not in any species here, so the arrow starts on nothing",
-        });
-      }
+      if (located === undefined) {}
     }
 
killedBy: RESOLUTION: every endpoint is in the from state names a source atom that is not there
statusReason: expected [ { arrowId: 'a1', …(4) }, …(2) ] to have a length of 1 but got 3

[Killed] EqualityOperator
src/legality.ts:247:11
       }
     } else {
       const located = findAtomInState(state, arrow.source.atomId);
-      if (located === undefined) {
+      if (located !== undefined) {
         sourceResolves = false;
         findings.push({
killedBy: the wording of a finding, which is what a student is shown names a lone pair source and an atom sink in the message
statusReason: expected undefined to be 'the source site {o1} and the sink sit…' // Object.is equality

[Killed] BooleanLiteral
src/legality.ts:248:26
     } else {
       const located = findAtomInState(state, arrow.source.atomId);
       if (located === undefined) {
-        sourceResolves = false;
+        sourceResolves = true;
         findings.push({
           arrowId: arrow.id,
killedBy: RESOLUTION: every endpoint is in the from state names a source atom that is not there
statusReason: expected [ { arrowId: 'a1', …(4) }, …(3) ] to have a length of 1 but got 4

[Killed] StringLiteral
src/legality.ts:253:21
           arrowId: arrow.id,
           rule: "source_atom_not_in_state",
           cause: "arrow_endpoint_not_in_state",
-          expected: `atom ${arrow.source.atomId} to be present in state ${state.id}`,
+          expected: ``,
           actual: "it is not in any species here, so the arrow starts on nothing",
         });
killedBy: RESOLUTION: every endpoint is in the from state names a source atom that is not there
statusReason: expected '' to contain 'ghost'

[Killed] BlockStatement
src/legality.ts:259:51
       }
     }
 
-    for (const atomId of sinkAtomIds(arrow.sink)) {
-      if (findAtomInState(state, atomId) === undefined) {
-        sinkResolves = false;
-        findings.push({
-          arrowId: arrow.id,
-          rule: "sink_atom_not_in_state",
-          cause: "arrow_endpoint_not_in_state",
-          expected: `atom ${atomId} to be present in state ${state.id}`,
-          actual: "it is not in any species here, so the arrow points at nothing",
-        });
-      }
-    }
+    for (const atomId of sinkAtomIds(arrow.sink)) {}
 
     // SOURCE DENSITY.
killedBy: the wording of a finding, which is what a student is shown says an unresolvable sink points at nothing, with the endpoint cause
statusReason: expected 'arrow_endpoints_not_adjacent' to be 'arrow_endpoint_not_in_state' // Object.is equality

[Killed] ConditionalExpression
src/legality.ts:260:11
     }
 
     for (const atomId of sinkAtomIds(arrow.sink)) {
-      if (findAtomInState(state, atomId) === undefined) {
+      if (false) {
         sinkResolves = false;
         findings.push({
killedBy: the wording of a finding, which is what a student is shown says an unresolvable sink points at nothing, with the endpoint cause
statusReason: expected 'arrow_endpoints_not_adjacent' to be 'arrow_endpoint_not_in_state' // Object.is equality

[Killed] EqualityOperator
src/legality.ts:260:11
     }
 
     for (const atomId of sinkAtomIds(arrow.sink)) {
-      if (findAtomInState(state, atomId) === undefined) {
+      if (findAtomInState(state, atomId) !== undefined) {
         sinkResolves = false;
         findings.push({
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ { arrowId: 'a1', …(4) }, …(2) ] to deeply equal []

[Killed] BooleanLiteral
src/legality.ts:261:24
 
     for (const atomId of sinkAtomIds(arrow.sink)) {
       if (findAtomInState(state, atomId) === undefined) {
-        sinkResolves = false;
+        sinkResolves = true;
         findings.push({
           arrowId: arrow.id,
killedBy: the wording of a finding, which is what a student is shown says an unresolvable sink points at nothing, with the endpoint cause
statusReason: expected [ { arrowId: 'a1', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/legality.ts:273:9
     }
 
     // SOURCE DENSITY.
-    if (sourceResolves && arrow.source.kind === "lonePair") {
+    if (false) {
       const located = findAtomInState(state, arrow.source.atomId);
       const lonePairs = located?.atom.lonePairs ?? 0;
killedBy: the wording of a finding, which is what a student is shown gives the exact message on a missing lone pair
statusReason: expected undefined to be 'at least one lone pair on c1 for this…' // Object.is equality

[Killed] ConditionalExpression
src/legality.ts:273:9
     }
 
     // SOURCE DENSITY.
-    if (sourceResolves && arrow.source.kind === "lonePair") {
+    if (true) {
       const located = findAtomInState(state, arrow.source.atomId);
       const lonePairs = located?.atom.lonePairs ?? 0;
killedBy: the wording of a finding, which is what a student is shown names a single electron source and a bond source by their own words
statusReason: expected 'it carries 0' to be 'it runs from bond b1 to between br1 a…' // Object.is equality

[Killed] LogicalOperator
src/legality.ts:275:25
     // SOURCE DENSITY.
     if (sourceResolves && arrow.source.kind === "lonePair") {
       const located = findAtomInState(state, arrow.source.atomId);
-      const lonePairs = located?.atom.lonePairs ?? 0;
+      const lonePairs = located?.atom.lonePairs && 0;
       if (lonePairs < 1) {
         findings.push({
killedBy: the wording of a finding, which is what a student is shown says an unresolvable sink points at nothing, with the endpoint cause
statusReason: expected [ { arrowId: 'a1', …(4) }, …(1) ] to have a length of 1 but got 2

[Survived] OptionalChaining
src/legality.ts:275:25
     // SOURCE DENSITY.
     if (sourceResolves && arrow.source.kind === "lonePair") {
       const located = findAtomInState(state, arrow.source.atomId);
-      const lonePairs = located?.atom.lonePairs ?? 0;
+      const lonePairs = located.atom.lonePairs ?? 0;
       if (lonePairs < 1) {
         findings.push({

[Killed] ConditionalExpression
src/legality.ts:276:11
     if (sourceResolves && arrow.source.kind === "lonePair") {
       const located = findAtomInState(state, arrow.source.atomId);
       const lonePairs = located?.atom.lonePairs ?? 0;
-      if (lonePairs < 1) {
+      if (false) {
         findings.push({
           arrowId: arrow.id,
killedBy: SOURCE DENSITY: an arrow starts on electrons that exist rejects a lone pair arrow off an atom with no lone pairs
statusReason: expected undefined to be 'arrow_source_has_no_electrons' // Object.is equality

[Killed] ConditionalExpression
src/legality.ts:276:11
     if (sourceResolves && arrow.source.kind === "lonePair") {
       const located = findAtomInState(state, arrow.source.atomId);
       const lonePairs = located?.atom.lonePairs ?? 0;
-      if (lonePairs < 1) {
+      if (true) {
         findings.push({
           arrowId: arrow.id,
killedBy: the wording of a finding, which is what a student is shown says an unresolvable sink points at nothing, with the endpoint cause
statusReason: expected [ { arrowId: 'a1', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] StringLiteral
src/legality.ts:280:18
         findings.push({
           arrowId: arrow.id,
           rule: "source_has_no_lone_pair",
-          cause: "arrow_source_has_no_electrons",
+          cause: "",
           expected: `at least one lone pair on ${arrow.source.atomId} for this arrow to start from`,
           actual: `it carries ${lonePairs}`,
killedBy: SOURCE DENSITY: an arrow starts on electrons that exist rejects a lone pair arrow off an atom with no lone pairs
statusReason: expected '' to be 'arrow_source_has_no_electrons' // Object.is equality

[Killed] LogicalOperator
src/legality.ts:288:9
       add(lonePairElectronsDrawn, arrow.source.atomId, arrow.electrons);
     }
 
-    if (sourceResolves && arrow.source.kind === "singleElectron") {
+    if (sourceResolves || arrow.source.kind === "singleElectron") {
       const located = findAtomInState(state, arrow.source.atomId);
       const unpaired = located?.atom.unpairedElectrons ?? 0;
killedBy: the wording of a finding, which is what a student is shown names a single electron source and a bond source by their own words
statusReason: expected 'it carries 0' to be 'it runs from bond b1 to between br1 a…' // Object.is equality

[Killed] ConditionalExpression
src/legality.ts:288:9
       add(lonePairElectronsDrawn, arrow.source.atomId, arrow.electrons);
     }
 
-    if (sourceResolves && arrow.source.kind === "singleElectron") {
+    if (false) {
       const located = findAtomInState(state, arrow.source.atomId);
       const unpaired = located?.atom.unpairedElectrons ?? 0;
killedBy: the wording of a finding, which is what a student is shown gives the exact numbers on a radical source finding
statusReason: expected undefined to be 'at least one unpaired electron on o1' // Object.is equality
