[Killed] LogicalOperator
src/legality.ts:290:24
 
     if (sourceResolves && arrow.source.kind === "singleElectron") {
       const located = findAtomInState(state, arrow.source.atomId);
-      const unpaired = located?.atom.unpairedElectrons ?? 0;
+      const unpaired = located?.atom.unpairedElectrons && 0;
       if (unpaired < 1) {
         findings.push({
killedBy: SOURCE DENSITY: an arrow starts on electrons that exist accepts a fishhook that moves exactly one electron
statusReason: expected [ { arrowId: 'a1', …(4) } ] to deeply equal []

[Survived] OptionalChaining
src/legality.ts:290:24
 
     if (sourceResolves && arrow.source.kind === "singleElectron") {
       const located = findAtomInState(state, arrow.source.atomId);
-      const unpaired = located?.atom.unpairedElectrons ?? 0;
+      const unpaired = located.atom.unpairedElectrons ?? 0;
       if (unpaired < 1) {
         findings.push({

[Killed] BlockStatement
src/legality.ts:291:25
     if (sourceResolves && arrow.source.kind === "singleElectron") {
       const located = findAtomInState(state, arrow.source.atomId);
       const unpaired = located?.atom.unpairedElectrons ?? 0;
-      if (unpaired < 1) {
-        findings.push({
-          arrowId: arrow.id,
-          rule: "source_has_no_unpaired_electron",
-          cause: "arrow_source_has_no_electrons",
-          expected: `at least one unpaired electron on ${arrow.source.atomId}`,
-          actual: `it carries ${unpaired}`,
-        });
-      }
+      if (unpaired < 1) {}
       if (arrow.electrons !== 1) {
         findings.push({
killedBy: SOURCE DENSITY: an arrow starts on electrons that exist rejects a fishhook off an atom with no unpaired electron
statusReason: expected undefined to be 'arrow_source_has_no_electrons' // Object.is equality

[Killed] EqualityOperator
src/legality.ts:291:11
     if (sourceResolves && arrow.source.kind === "singleElectron") {
       const located = findAtomInState(state, arrow.source.atomId);
       const unpaired = located?.atom.unpairedElectrons ?? 0;
-      if (unpaired < 1) {
+      if (unpaired >= 1) {
         findings.push({
           arrowId: arrow.id,
killedBy: the wording of a finding, which is what a student is shown names a single electron source and a bond source by their own words
statusReason: expected 'it carries 1' to be 'it runs from the unpaired electron on…' // Object.is equality

[Killed] ConditionalExpression
src/legality.ts:300:11
           actual: `it carries ${unpaired}`,
         });
       }
-      if (arrow.electrons !== 1) {
+      if (true) {
         findings.push({
           arrowId: arrow.id,
killedBy: the wording of a finding, which is what a student is shown names a single electron source and a bond source by their own words
statusReason: expected 'this arrow moves 1, which is more tha…' to be 'it runs from the unpaired electron on…' // Object.is equality

[Killed] BlockStatement
src/legality.ts:300:34
           actual: `it carries ${unpaired}`,
         });
       }
-      if (arrow.electrons !== 1) {
-        findings.push({
-          arrowId: arrow.id,
-          rule: "single_electron_source_moved_a_pair",
-          cause: "electron_count_not_integral",
-          expected: "a singleElectron source moves exactly 1 electron",
-          actual: `this arrow moves ${arrow.electrons}, which is more than the source holds`,
-        });
-      }
+      if (arrow.electrons !== 1) {}
       add(unpairedElectronsDrawn, arrow.source.atomId, arrow.electrons);
     }
killedBy: the wording of a finding, which is what a student is shown gives the exact numbers on a radical source finding
statusReason: expected undefined to be 'a singleElectron source moves exactly…' // Object.is equality

[Killed] StringLiteral
src/legality.ts:304:18
         findings.push({
           arrowId: arrow.id,
           rule: "single_electron_source_moved_a_pair",
-          cause: "electron_count_not_integral",
+          cause: "",
           expected: "a singleElectron source moves exactly 1 electron",
           actual: `this arrow moves ${arrow.electrons}, which is more than the source holds`,
killedBy: SOURCE DENSITY: an arrow starts on electrons that exist rejects a single electron source that claims to move a pair
statusReason: expected '' to be 'electron_count_not_integral' // Object.is equality

[Killed] StringLiteral
src/legality.ts:305:21
           arrowId: arrow.id,
           rule: "single_electron_source_moved_a_pair",
           cause: "electron_count_not_integral",
-          expected: "a singleElectron source moves exactly 1 electron",
+          expected: "",
           actual: `this arrow moves ${arrow.electrons}, which is more than the source holds`,
         });
killedBy: the wording of a finding, which is what a student is shown gives the exact numbers on a radical source finding
statusReason: expected '' to be 'a singleElectron source moves exactly…' // Object.is equality

[Killed] StringLiteral
src/legality.ts:306:19
           rule: "single_electron_source_moved_a_pair",
           cause: "electron_count_not_integral",
           expected: "a singleElectron source moves exactly 1 electron",
-          actual: `this arrow moves ${arrow.electrons}, which is more than the source holds`,
+          actual: ``,
         });
       }
killedBy: SOURCE DENSITY: an arrow starts on electrons that exist rejects a single electron source that claims to move a pair
statusReason: expected '' to contain '2'

[Killed] EqualityOperator
src/legality.ts:312:27
       add(unpairedElectronsDrawn, arrow.source.atomId, arrow.electrons);
     }
 
-    if (sourceResolves && arrow.source.kind === "bond") {
+    if (sourceResolves && arrow.source.kind !== "bond") {
       const order = bondOrderById.get(arrow.source.bondId) ?? 0;
       if (arrow.electrons > order * 2) {
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ { arrowId: 'a1', …(4) } ] to deeply equal []

[Killed] ConditionalExpression
src/legality.ts:312:9
       add(unpairedElectronsDrawn, arrow.source.atomId, arrow.electrons);
     }
 
-    if (sourceResolves && arrow.source.kind === "bond") {
+    if (true) {
       const order = bondOrderById.get(arrow.source.bondId) ?? 0;
       if (arrow.electrons > order * 2) {
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ { arrowId: 'a1', …(4) } ] to deeply equal []

[Killed] LogicalOperator
src/legality.ts:313:21
     }
 
     if (sourceResolves && arrow.source.kind === "bond") {
-      const order = bondOrderById.get(arrow.source.bondId) ?? 0;
+      const order = bondOrderById.get(arrow.source.bondId) && 0;
       if (arrow.electrons > order * 2) {
         findings.push({
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ { arrowId: 'a2', …(4) } ] to deeply equal []

[Killed] ArithmeticOperator
src/legality.ts:314:29
 
     if (sourceResolves && arrow.source.kind === "bond") {
       const order = bondOrderById.get(arrow.source.bondId) ?? 0;
-      if (arrow.electrons > order * 2) {
+      if (arrow.electrons > order / 2) {
         findings.push({
           arrowId: arrow.id,
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ { arrowId: 'a2', …(4) } ] to deeply equal []

[Killed] ConditionalExpression
src/legality.ts:314:11
 
     if (sourceResolves && arrow.source.kind === "bond") {
       const order = bondOrderById.get(arrow.source.bondId) ?? 0;
-      if (arrow.electrons > order * 2) {
+      if (true) {
         findings.push({
           arrowId: arrow.id,
killedBy: the wording of a finding, which is what a student is shown names a single electron source and a bond source by their own words
statusReason: expected 'this arrow alone moves 2' to be 'it runs from bond b1 to between br1 a…' // Object.is equality

[NoCoverage] ObjectLiteral
src/legality.ts:315:23
     if (sourceResolves && arrow.source.kind === "bond") {
       const order = bondOrderById.get(arrow.source.bondId) ?? 0;
       if (arrow.electrons > order * 2) {
-        findings.push({
-          arrowId: arrow.id,
-          rule: "source_bond_overdrawn",
-          cause: "arrow_source_has_no_electrons",
-          expected: `at most ${order * 2} electrons out of bond ${arrow.source.bondId}, which is order ${order}`,
-          actual: `this arrow alone moves ${arrow.electrons}`,
-        });
+        findings.push({});
       }
     }

[NoCoverage] ArithmeticOperator
src/legality.ts:319:32
           arrowId: arrow.id,
           rule: "source_bond_overdrawn",
           cause: "arrow_source_has_no_electrons",
-          expected: `at most ${order * 2} electrons out of bond ${arrow.source.bondId}, which is order ${order}`,
+          expected: `at most ${order / 2} electrons out of bond ${arrow.source.bondId}, which is order ${order}`,
           actual: `this arrow alone moves ${arrow.electrons}`,
         });

[NoCoverage] StringLiteral
src/legality.ts:319:21
           arrowId: arrow.id,
           rule: "source_bond_overdrawn",
           cause: "arrow_source_has_no_electrons",
-          expected: `at most ${order * 2} electrons out of bond ${arrow.source.bondId}, which is order ${order}`,
+          expected: ``,
           actual: `this arrow alone moves ${arrow.electrons}`,
         });

[NoCoverage] StringLiteral
src/legality.ts:320:19
           rule: "source_bond_overdrawn",
           cause: "arrow_source_has_no_electrons",
           expected: `at most ${order * 2} electrons out of bond ${arrow.source.bondId}, which is order ${order}`,
-          actual: `this arrow alone moves ${arrow.electrons}`,
+          actual: ``,
         });
       }

[Killed] LogicalOperator
src/legality.ts:325:9
       }
     }
 
-    if (!sourceResolves || !sinkResolves) continue;
+    if (!sourceResolves && !sinkResolves) continue;
 
     // NON DEGENERACY, before adjacency, because a degenerate arrow always passes
killedBy: the wording of a finding, which is what a student is shown says an unresolvable sink points at nothing, with the endpoint cause
statusReason: expected [ { arrowId: 'a1', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] BooleanLiteral
src/legality.ts:325:9
       }
     }
 
-    if (!sourceResolves || !sinkResolves) continue;
+    if (sourceResolves || !sinkResolves) continue;
 
     // NON DEGENERACY, before adjacency, because a degenerate arrow always passes
killedBy: RESOLUTION: every endpoint is in the from state names a source atom that is not there
statusReason: expected [ { arrowId: 'a1', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/legality.ts:330:9
     // NON DEGENERACY, before adjacency, because a degenerate arrow always passes
     // adjacency and "it shares an atom" would be a confusing thing to be told.
     const sinks = sinkAtomIds(arrow.sink);
-    if (arrow.sink.kind === "betweenAtoms" && sinks[0] === sinks[1]) {
+    if (true) {
       findings.push({
         arrowId: arrow.id,
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ { arrowId: 'a1', …(4) }, …(1) ] to deeply equal []

[Killed] LogicalOperator
src/legality.ts:330:9
     // NON DEGENERACY, before adjacency, because a degenerate arrow always passes
     // adjacency and "it shares an atom" would be a confusing thing to be told.
     const sinks = sinkAtomIds(arrow.sink);
-    if (arrow.sink.kind === "betweenAtoms" && sinks[0] === sinks[1]) {
+    if (arrow.sink.kind === "betweenAtoms" || sinks[0] === sinks[1]) {
       findings.push({
         arrowId: arrow.id,
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ { arrowId: 'a1', …(4) } ] to deeply equal []

[Killed] ObjectLiteral
src/legality.ts:331:21
     // adjacency and "it shares an atom" would be a confusing thing to be told.
     const sinks = sinkAtomIds(arrow.sink);
     if (arrow.sink.kind === "betweenAtoms" && sinks[0] === sinks[1]) {
-      findings.push({
-        arrowId: arrow.id,
-        rule: "sink_bonds_an_atom_to_itself",
-        cause: "arrow_sink_cannot_accept_electrons",
-        expected: "a bond forming sink names two different atoms",
-        actual: `both ends are ${sinks[0]}, and an atom cannot bond to itself`,
-      });
+      findings.push({});
       continue;
     }
killedBy: NON DEGENERACY: an arrow has to claim something moved rejects a sink that bonds an atom to itself, before saying anything about adjacency
statusReason: expected undefined to be 'sink_bonds_an_atom_to_itself' // Object.is equality

[Killed] StringLiteral
src/legality.ts:334:16
       findings.push({
         arrowId: arrow.id,
         rule: "sink_bonds_an_atom_to_itself",
-        cause: "arrow_sink_cannot_accept_electrons",
+        cause: "",
         expected: "a bond forming sink names two different atoms",
         actual: `both ends are ${sinks[0]}, and an atom cannot bond to itself`,
killedBy: NON DEGENERACY: an arrow has to claim something moved rejects a sink that bonds an atom to itself, before saying anything about adjacency
statusReason: expected '' to be 'arrow_sink_cannot_accept_electrons' // Object.is equality

[Killed] EqualityOperator
src/legality.ts:343:7
 
     const sources = sourceAtomIds(arrow.source, state);
     const sameSite =
-      sources.length === sinks.length &&
+      sources.length !== sinks.length &&
       new Set<AtomId>([...sources, ...sinks]).size === sources.length;
     if (sameSite) {
killedBy: the wording of a finding, which is what a student is shown names a single electron source and a bond source by their own words
statusReason: expected undefined to be 'it runs from the unpaired electron on…' // Object.is equality

[Killed] ConditionalExpression
src/legality.ts:343:7
 
     const sources = sourceAtomIds(arrow.source, state);
     const sameSite =
-      sources.length === sinks.length &&
-      new Set<AtomId>([...sources, ...sinks]).size === sources.length;
+      false;
     if (sameSite) {
       findings.push({
killedBy: NON DEGENERACY: an arrow has to claim something moved rejects a lone pair taken off an atom and put back on the same atom
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/legality.ts:344:7
     const sources = sourceAtomIds(arrow.source, state);
     const sameSite =
       sources.length === sinks.length &&
-      new Set<AtomId>([...sources, ...sinks]).size === sources.length;
+      true;
     if (sameSite) {
       findings.push({
killedBy: a correctly drawn step produces no findings accepts a pi bond attacking an electrophile, pivoting on the shared carbon
statusReason: expected [ { arrowId: 'a1', …(4) } ] to deeply equal []

[Killed] EqualityOperator
src/legality.ts:344:7
     const sources = sourceAtomIds(arrow.source, state);
     const sameSite =
       sources.length === sinks.length &&
-      new Set<AtomId>([...sources, ...sinks]).size === sources.length;
+      new Set<AtomId>([...sources, ...sinks]).size !== sources.length;
     if (sameSite) {
       findings.push({
killedBy: the wording of a finding, which is what a student is shown names a lone pair source and an atom sink in the message
statusReason: expected undefined to be 'the source site {o1} and the sink sit…' // Object.is equality

[Killed] ConditionalExpression
src/legality.ts:345:9
     const sameSite =
       sources.length === sinks.length &&
       new Set<AtomId>([...sources, ...sinks]).size === sources.length;
-    if (sameSite) {
+    if (false) {
       findings.push({
         arrowId: arrow.id,
killedBy: the wording of a finding, which is what a student is shown names a single electron source and a bond source by their own words
statusReason: expected undefined to be 'it runs from the unpaired electron on…' // Object.is equality

[Killed] BlockStatement
src/legality.ts:345:19
     const sameSite =
       sources.length === sinks.length &&
       new Set<AtomId>([...sources, ...sinks]).size === sources.length;
-    if (sameSite) {
-      findings.push({
-        arrowId: arrow.id,
-        rule: "arrow_declares_no_change",
-        cause: "arrow_declares_no_change",
-        expected: "an arrow moves electrons from one place to a different place",
-        actual:
-          `it runs from ${describeSource(arrow.source)} to ${describeSink(arrow.sink)}, which is ` +
-          `the same site, so it declares a change of zero everywhere`,
-      });
-      continue;
-    }
+    if (sameSite) {}
 
     // ADJACENCY. THE HEADLINE.
killedBy: NON DEGENERACY: an arrow has to claim something moved rejects a lone pair taken off an atom and put back on the same atom
statusReason: expected [] to have a length of 1 but got +0

[Killed] StringLiteral
src/legality.ts:349:16
       findings.push({
         arrowId: arrow.id,
         rule: "arrow_declares_no_change",
-        cause: "arrow_declares_no_change",
+        cause: "",
         expected: "an arrow moves electrons from one place to a different place",
         actual:
killedBy: NON DEGENERACY: an arrow has to claim something moved rejects a lone pair taken off an atom and put back on the same atom
statusReason: expected '' to be 'arrow_declares_no_change' // Object.is equality

[Killed] StringLiteral
src/legality.ts:352:11
         cause: "arrow_declares_no_change",
         expected: "an arrow moves electrons from one place to a different place",
         actual:
-          `it runs from ${describeSource(arrow.source)} to ${describeSink(arrow.sink)}, which is ` +
+          `` +
           `the same site, so it declares a change of zero everywhere`,
       });
killedBy: NON DEGENERACY: an arrow has to claim something moved rejects a lone pair taken off an atom and put back on the same atom
statusReason: expected 'the same site, so it declares a chang…' to contain 'o1'

[Killed] ArrowFunction
src/legality.ts:360:35
 
     // ADJACENCY. THE HEADLINE.
     const sinkSet = new Set<AtomId>(sinks);
-    const pivots = sources.filter((atomId) => sinkSet.has(atomId));
+    const pivots = sources.filter(() => undefined);
     if (pivots.length === 0) {
       const bonded = sources.some((from) => sinks.some((to) => atomsAreBonded(state, from, to)));
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ { arrowId: 'a1', …(4) }, …(1) ] to deeply equal []

[Killed] MethodExpression
src/legality.ts:360:20
 
     // ADJACENCY. THE HEADLINE.
     const sinkSet = new Set<AtomId>(sinks);
-    const pivots = sources.filter((atomId) => sinkSet.has(atomId));
+    const pivots = sources;
     if (pivots.length === 0) {
       const bonded = sources.some((from) => sinks.some((to) => atomsAreBonded(state, from, to)));
killedBy: ADJACENCY: the headline rule rejects a lone pair teleporting onto a non adjacent atom
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/legality.ts:361:30
     // ADJACENCY. THE HEADLINE.
     const sinkSet = new Set<AtomId>(sinks);
     const pivots = sources.filter((atomId) => sinkSet.has(atomId));
-    if (pivots.length === 0) {
-      const bonded = sources.some((from) => sinks.some((to) => atomsAreBonded(state, from, to)));
-      findings.push({
-        arrowId: arrow.id,
-        rule: "endpoints_share_no_atom",
-        cause: "arrow_endpoints_not_adjacent",
-        expected:
-          `the source site {${sources.join(", ")}} and the sink site {${sinks.join(", ")}} to ` +
-          `share an atom, which is the pivot the electron pair swings around`,
-        actual:
-          `they share none, so ${describeSource(arrow.source)} reaches ${describeSink(arrow.sink)} ` +
-          `across empty space. ` +
-          (bonded
-            ? "The two sites are joined by an existing bond, which is still not enough: an " +
-              "arrow that runs the length of a bond it neither sources from nor forms is " +
-              "moving that bond's electrons without saying so"
-            : "There is not even a bond between them in this state"),
-      });
-    }
+    if (pivots.length === 0) {}
   }
 
killedBy: the wording of a finding, which is what a student is shown names a lone pair source and an atom sink in the message
statusReason: expected undefined to be 'the source site {o1} and the sink sit…' // Object.is equality

[Killed] EqualityOperator
src/legality.ts:361:9
     // ADJACENCY. THE HEADLINE.
     const sinkSet = new Set<AtomId>(sinks);
     const pivots = sources.filter((atomId) => sinkSet.has(atomId));
-    if (pivots.length === 0) {
+    if (pivots.length !== 0) {
       const bonded = sources.some((from) => sinks.some((to) => atomsAreBonded(state, from, to)));
       findings.push({
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ { arrowId: 'a1', …(4) }, …(1) ] to deeply equal []

[Killed] MethodExpression
src/legality.ts:362:22
     const sinkSet = new Set<AtomId>(sinks);
     const pivots = sources.filter((atomId) => sinkSet.has(atomId));
     if (pivots.length === 0) {
-      const bonded = sources.some((from) => sinks.some((to) => atomsAreBonded(state, from, to)));
+      const bonded = sources.every(from => sinks.some(to => atomsAreBonded(state, from, to)));
       findings.push({
         arrowId: arrow.id,
killedBy: boundaries the rules turn on notes a bond between the sites when only one end of a BOND SOURCE reaches the sink
statusReason: expected 'they share none, so bond b1 reaches a…' to contain 'joined by an existing bond'

[Killed] ArrowFunction
src/legality.ts:362:35
     const sinkSet = new Set<AtomId>(sinks);
     const pivots = sources.filter((atomId) => sinkSet.has(atomId));
     if (pivots.length === 0) {
-      const bonded = sources.some((from) => sinks.some((to) => atomsAreBonded(state, from, to)));
+      const bonded = sources.some(() => undefined);
       findings.push({
         arrowId: arrow.id,
killedBy: ADJACENCY: the headline rule says explicitly when the two sites happen to be bonded, and still rejects
statusReason: expected 'they share none, so a lone pair on o1…' to contain 'joined by an existing bond'

[Killed] ObjectLiteral
src/legality.ts:363:21
     const pivots = sources.filter((atomId) => sinkSet.has(atomId));
     if (pivots.length === 0) {
       const bonded = sources.some((from) => sinks.some((to) => atomsAreBonded(state, from, to)));
-      findings.push({
-        arrowId: arrow.id,
-        rule: "endpoints_share_no_atom",
-        cause: "arrow_endpoints_not_adjacent",
-        expected:
-          `the source site {${sources.join(", ")}} and the sink site {${sinks.join(", ")}} to ` +
-          `share an atom, which is the pivot the electron pair swings around`,
-        actual:
-          `they share none, so ${describeSource(arrow.source)} reaches ${describeSink(arrow.sink)} ` +
-          `across empty space. ` +
-          (bonded
-            ? "The two sites are joined by an existing bond, which is still not enough: an " +
-              "arrow that runs the length of a bond it neither sources from nor forms is " +
-              "moving that bond's electrons without saying so"
-            : "There is not even a bond between them in this state"),
-      });
+      findings.push({});
     }
   }
killedBy: ADJACENCY: the headline rule rejects a lone pair teleporting onto a non adjacent atom
statusReason: expected undefined to be 'endpoints_share_no_atom' // Object.is equality

[Killed] StringLiteral
src/legality.ts:368:44
         rule: "endpoints_share_no_atom",
         cause: "arrow_endpoints_not_adjacent",
         expected:
-          `the source site {${sources.join(", ")}} and the sink site {${sinks.join(", ")}} to ` +
+          `the source site {${sources.join("")}} and the sink site {${sinks.join(", ")}} to ` +
           `share an atom, which is the pivot the electron pair swings around`,
         actual:
killedBy: an adjacency message lists both atoms of a bond source separates the two source atoms so the pivot that is missing is readable
statusReason: expected 'the source site {c1c2} and the sink s…' to contain 'the source site {c1, c2}'

[Killed] StringLiteral
src/legality.ts:368:84
         rule: "endpoints_share_no_atom",
         cause: "arrow_endpoints_not_adjacent",
         expected:
-          `the source site {${sources.join(", ")}} and the sink site {${sinks.join(", ")}} to ` +
+          `the source site {${sources.join(", ")}} and the sink site {${sinks.join("")}} to ` +
           `share an atom, which is the pivot the electron pair swings around`,
         actual:
killedBy: the wording of a finding, which is what a student is shown names a bond forming sink by both of its atoms
statusReason: expected 'the source site {o1} and the sink sit…' to contain 'the sink site {c1, cl1}'

[Killed] StringLiteral
src/legality.ts:369:11
         cause: "arrow_endpoints_not_adjacent",
         expected:
           `the source site {${sources.join(", ")}} and the sink site {${sinks.join(", ")}} to ` +
-          `share an atom, which is the pivot the electron pair swings around`,
+          ``,
         actual:
           `they share none, so ${describeSource(arrow.source)} reaches ${describeSink(arrow.sink)} ` +
killedBy: the wording of a finding, which is what a student is shown names a lone pair source and an atom sink in the message
statusReason: expected 'the source site {o1} and the sink sit…' to be 'the source site {o1} and the sink sit…' // Object.is equality

[Killed] StringLiteral
src/legality.ts:374:15
           `they share none, so ${describeSource(arrow.source)} reaches ${describeSink(arrow.sink)} ` +
           `across empty space. ` +
           (bonded
-            ? "The two sites are joined by an existing bond, which is still not enough: an " +
+            ? "" +
               "arrow that runs the length of a bond it neither sources from nor forms is " +
               "moving that bond's electrons without saying so"
killedBy: boundaries the rules turn on notes a bond between the sites when only one end of a BOND SOURCE reaches the sink
statusReason: expected 'they share none, so bond b1 reaches a…' to contain 'joined by an existing bond'

[Killed] BlockStatement
src/legality.ts:383:73
   }
 
   // SOURCE CAPACITY, over the whole step.
-  for (const [atomId, electrons] of [...lonePairElectronsDrawn].sort()) {
-    const located = findAtomInState(state, atomId);
-    const available = (located?.atom.lonePairs ?? 0) * 2;
-    if (electrons > available) {
-      findings.push({
-        arrowId: arrowsTouchingLonePairsAt(arrows, atomId),
-        rule: "lone_pairs_overdrawn",
-        cause: "arrow_source_has_no_electrons",
-        expected: `at most ${available} electrons drawn from lone pairs on ${atomId}`,
-        actual: `the arrows in this step draw ${electrons} between them`,
-      });
-    }
-  }
+  for (const [atomId, electrons] of [...lonePairElectronsDrawn].sort()) {}
 
   for (const [atomId, electrons] of [...unpairedElectronsDrawn].sort()) {
killedBy: SOURCE DENSITY: an arrow starts on electrons that exist rejects a lone pair arrow off an atom with no lone pairs
statusReason: expected [ 'source_has_no_lone_pair' ] to include 'lone_pairs_overdrawn'

[Killed] MethodExpression
src/legality.ts:383:37
   }
 
   // SOURCE CAPACITY, over the whole step.
-  for (const [atomId, electrons] of [...lonePairElectronsDrawn].sort()) {
+  for (const [atomId, electrons] of [...lonePairElectronsDrawn]) {
     const located = findAtomInState(state, atomId);
     const available = (located?.atom.lonePairs ?? 0) * 2;
killedBy: aggregate capacity findings name the right arrows, in a stable order sorts lone pair capacity findings by atom, not by which arrow came first
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] LogicalOperator
src/legality.ts:385:24
   // SOURCE CAPACITY, over the whole step.
   for (const [atomId, electrons] of [...lonePairElectronsDrawn].sort()) {
     const located = findAtomInState(state, atomId);
-    const available = (located?.atom.lonePairs ?? 0) * 2;
+    const available = (located?.atom.lonePairs && 0) * 2;
     if (electrons > available) {
       findings.push({
killedBy: the wording of a finding, which is what a student is shown says an unresolvable sink points at nothing, with the endpoint cause
statusReason: expected [ { arrowId: 'a1', …(4) }, …(1) ] to have a length of 1 but got 2

[Killed] ArithmeticOperator
src/legality.ts:385:23
   // SOURCE CAPACITY, over the whole step.
   for (const [atomId, electrons] of [...lonePairElectronsDrawn].sort()) {
     const located = findAtomInState(state, atomId);
-    const available = (located?.atom.lonePairs ?? 0) * 2;
+    const available = (located?.atom.lonePairs ?? 0) / 2;
     if (electrons > available) {
       findings.push({
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ { arrowId: 'a1', …(4) } ] to deeply equal []

[Killed] EqualityOperator
src/legality.ts:386:9
   for (const [atomId, electrons] of [...lonePairElectronsDrawn].sort()) {
     const located = findAtomInState(state, atomId);
     const available = (located?.atom.lonePairs ?? 0) * 2;
-    if (electrons > available) {
+    if (electrons <= available) {
       findings.push({
         arrowId: arrowsTouchingLonePairsAt(arrows, atomId),
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ { arrowId: 'a1', …(4) } ] to deeply equal []
