[Killed] ConditionalExpression
src/legality.ts:386:9
   for (const [atomId, electrons] of [...lonePairElectronsDrawn].sort()) {
     const located = findAtomInState(state, atomId);
     const available = (located?.atom.lonePairs ?? 0) * 2;
-    if (electrons > available) {
+    if (true) {
       findings.push({
         arrowId: arrowsTouchingLonePairsAt(arrows, atomId),
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ { arrowId: 'a1', …(4) } ] to deeply equal []

[Killed] StringLiteral
src/legality.ts:390:16
       findings.push({
         arrowId: arrowsTouchingLonePairsAt(arrows, atomId),
         rule: "lone_pairs_overdrawn",
-        cause: "arrow_source_has_no_electrons",
+        cause: "",
         expected: `at most ${available} electrons drawn from lone pairs on ${atomId}`,
         actual: `the arrows in this step draw ${electrons} between them`,
killedBy: aggregate capacity findings name the right arrows, in a stable order gives the exact ceiling and draw on every aggregate capacity finding
statusReason: expected '' to be 'arrow_source_has_no_electrons' // Object.is equality

[Killed] MethodExpression
src/legality.ts:397:37
     }
   }
 
-  for (const [atomId, electrons] of [...unpairedElectronsDrawn].sort()) {
+  for (const [atomId, electrons] of [...unpairedElectronsDrawn]) {
     const located = findAtomInState(state, atomId);
     const available = located?.atom.unpairedElectrons ?? 0;
killedBy: aggregate capacity findings name the right arrows, in a stable order sorts unpaired electron capacity findings by atom
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/legality.ts:397:73
     }
   }
 
-  for (const [atomId, electrons] of [...unpairedElectronsDrawn].sort()) {
-    const located = findAtomInState(state, atomId);
-    const available = located?.atom.unpairedElectrons ?? 0;
-    if (electrons > available) {
-      findings.push({
-        arrowId: arrowsTouchingUnpairedAt(arrows, atomId),
-        rule: "unpaired_electrons_overdrawn",
-        cause: "arrow_source_has_no_electrons",
-        expected: `at most ${available} electrons drawn from unpaired electrons on ${atomId}`,
-        actual: `the arrows in this step draw ${electrons} between them`,
-      });
-    }
-  }
+  for (const [atomId, electrons] of [...unpairedElectronsDrawn].sort()) {}
 
   for (const [bondId, electrons] of [...bondElectronsDrawn].sort()) {
killedBy: aggregate capacity findings name the right arrows, in a stable order gives the exact ceiling and draw on every aggregate capacity finding
statusReason: expected undefined to be 'arrow_source_has_no_electrons' // Object.is equality

[Killed] LogicalOperator
src/legality.ts:399:23
 
   for (const [atomId, electrons] of [...unpairedElectronsDrawn].sort()) {
     const located = findAtomInState(state, atomId);
-    const available = located?.atom.unpairedElectrons ?? 0;
+    const available = located?.atom.unpairedElectrons && 0;
     if (electrons > available) {
       findings.push({
killedBy: aggregate capacity findings name the right arrows, in a stable order gives the exact ceiling and draw on every aggregate capacity finding
statusReason: expected 'at most 0 electrons drawn from unpair…' to be 'at most 1 electrons drawn from unpair…' // Object.is equality

[Survived] OptionalChaining
src/legality.ts:399:23
 
   for (const [atomId, electrons] of [...unpairedElectronsDrawn].sort()) {
     const located = findAtomInState(state, atomId);
-    const available = located?.atom.unpairedElectrons ?? 0;
+    const available = located.atom.unpairedElectrons ?? 0;
     if (electrons > available) {
       findings.push({

[Killed] ConditionalExpression
src/legality.ts:400:9
   for (const [atomId, electrons] of [...unpairedElectronsDrawn].sort()) {
     const located = findAtomInState(state, atomId);
     const available = located?.atom.unpairedElectrons ?? 0;
-    if (electrons > available) {
+    if (false) {
       findings.push({
         arrowId: arrowsTouchingUnpairedAt(arrows, atomId),
killedBy: SOURCE DENSITY: an arrow starts on electrons that exist rejects a fishhook off an atom with no unpaired electron
statusReason: expected [ 'source_has_no_unpaired_electron' ] to include 'unpaired_electrons_overdrawn'

[Killed] ConditionalExpression
src/legality.ts:400:9
   for (const [atomId, electrons] of [...unpairedElectronsDrawn].sort()) {
     const located = findAtomInState(state, atomId);
     const available = located?.atom.unpairedElectrons ?? 0;
-    if (electrons > available) {
+    if (true) {
       findings.push({
         arrowId: arrowsTouchingUnpairedAt(arrows, atomId),
killedBy: SOURCE DENSITY: an arrow starts on electrons that exist accepts a fishhook that moves exactly one electron
statusReason: expected [ { arrowId: 'a1', …(4) } ] to deeply equal []

[Killed] StringLiteral
src/legality.ts:405:19
         arrowId: arrowsTouchingUnpairedAt(arrows, atomId),
         rule: "unpaired_electrons_overdrawn",
         cause: "arrow_source_has_no_electrons",
-        expected: `at most ${available} electrons drawn from unpaired electrons on ${atomId}`,
+        expected: ``,
         actual: `the arrows in this step draw ${electrons} between them`,
       });
killedBy: aggregate capacity findings name the right arrows, in a stable order gives the exact ceiling and draw on every aggregate capacity finding
statusReason: expected '' to be 'at most 1 electrons drawn from unpair…' // Object.is equality

[Killed] BlockStatement
src/legality.ts:411:69
     }
   }
 
-  for (const [bondId, electrons] of [...bondElectronsDrawn].sort()) {
-    const order = bondOrderById.get(bondId) ?? 0;
-    if (electrons > order * 2) {
-      findings.push({
-        arrowId: arrowsSourcingBond(arrows, bondId),
-        rule: "source_bond_overdrawn",
-        cause: "arrow_source_has_no_electrons",
-        expected: `at most ${order * 2} electrons drawn from bond ${bondId}, which is order ${order}`,
-        actual: `the arrows in this step draw ${electrons} between them`,
-      });
-    }
-  }
+  for (const [bondId, electrons] of [...bondElectronsDrawn].sort()) {}
 
   return Object.freeze(findings);
killedBy: SOURCE CAPACITY: the sum across a step, not one arrow at a time rejects three fishhooks out of a single bond, which only holds two electrons
statusReason: expected undefined to be 'a1 + a2 + a3' // Object.is equality

[Killed] MethodExpression
src/legality.ts:411:37
     }
   }
 
-  for (const [bondId, electrons] of [...bondElectronsDrawn].sort()) {
+  for (const [bondId, electrons] of [...bondElectronsDrawn]) {
     const order = bondOrderById.get(bondId) ?? 0;
     if (electrons > order * 2) {
killedBy: aggregate capacity findings name the right arrows, in a stable order sorts bond capacity findings by bond id
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] LogicalOperator
src/legality.ts:412:19
   }
 
   for (const [bondId, electrons] of [...bondElectronsDrawn].sort()) {
-    const order = bondOrderById.get(bondId) ?? 0;
+    const order = bondOrderById.get(bondId) && 0;
     if (electrons > order * 2) {
       findings.push({
killedBy: aggregate capacity findings name the right arrows, in a stable order gives the exact ceiling and draw on every aggregate capacity finding
statusReason: expected 'at most 0 electrons drawn from bond b…' to be 'at most 2 electrons drawn from bond b…' // Object.is equality

[Killed] ConditionalExpression
src/legality.ts:413:9
 
   for (const [bondId, electrons] of [...bondElectronsDrawn].sort()) {
     const order = bondOrderById.get(bondId) ?? 0;
-    if (electrons > order * 2) {
+    if (true) {
       findings.push({
         arrowId: arrowsSourcingBond(arrows, bondId),
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ { arrowId: 'a2', …(4) } ] to deeply equal []

[Killed] BlockStatement
src/legality.ts:413:32
 
   for (const [bondId, electrons] of [...bondElectronsDrawn].sort()) {
     const order = bondOrderById.get(bondId) ?? 0;
-    if (electrons > order * 2) {
-      findings.push({
-        arrowId: arrowsSourcingBond(arrows, bondId),
-        rule: "source_bond_overdrawn",
-        cause: "arrow_source_has_no_electrons",
-        expected: `at most ${order * 2} electrons drawn from bond ${bondId}, which is order ${order}`,
-        actual: `the arrows in this step draw ${electrons} between them`,
-      });
-    }
+    if (electrons > order * 2) {}
   }
 
killedBy: SOURCE CAPACITY: the sum across a step, not one arrow at a time rejects three fishhooks out of a single bond, which only holds two electrons
statusReason: expected undefined to be 'a1 + a2 + a3' // Object.is equality

[Killed] ObjectLiteral
src/legality.ts:414:21
   for (const [bondId, electrons] of [...bondElectronsDrawn].sort()) {
     const order = bondOrderById.get(bondId) ?? 0;
     if (electrons > order * 2) {
-      findings.push({
-        arrowId: arrowsSourcingBond(arrows, bondId),
-        rule: "source_bond_overdrawn",
-        cause: "arrow_source_has_no_electrons",
-        expected: `at most ${order * 2} electrons drawn from bond ${bondId}, which is order ${order}`,
-        actual: `the arrows in this step draw ${electrons} between them`,
-      });
+      findings.push({});
     }
   }
killedBy: aggregate capacity findings name the right arrows, in a stable order gives the exact ceiling and draw on every aggregate capacity finding
statusReason: expected undefined to be 'arrow_source_has_no_electrons' // Object.is equality

[Killed] StringLiteral
src/legality.ts:417:16
       findings.push({
         arrowId: arrowsSourcingBond(arrows, bondId),
         rule: "source_bond_overdrawn",
-        cause: "arrow_source_has_no_electrons",
+        cause: "",
         expected: `at most ${order * 2} electrons drawn from bond ${bondId}, which is order ${order}`,
         actual: `the arrows in this step draw ${electrons} between them`,
killedBy: aggregate capacity findings name the right arrows, in a stable order gives the exact ceiling and draw on every aggregate capacity finding
statusReason: expected '' to be 'arrow_source_has_no_electrons' // Object.is equality

[Killed] ArithmeticOperator
src/legality.ts:418:30
         arrowId: arrowsSourcingBond(arrows, bondId),
         rule: "source_bond_overdrawn",
         cause: "arrow_source_has_no_electrons",
-        expected: `at most ${order * 2} electrons drawn from bond ${bondId}, which is order ${order}`,
+        expected: `at most ${order / 2} electrons drawn from bond ${bondId}, which is order ${order}`,
         actual: `the arrows in this step draw ${electrons} between them`,
       });
killedBy: aggregate capacity findings name the right arrows, in a stable order gives the exact ceiling and draw on every aggregate capacity finding
statusReason: expected 'at most 0.5 electrons drawn from bond…' to be 'at most 2 electrons drawn from bond b…' // Object.is equality

[Killed] BlockStatement
src/legality.ts:438:12
 function arrowsTouchingLonePairsAt(
   arrows: readonly ElectronFlowArrow[],
   atomId: AtomId,
-): ArrowId {
-  return arrows
-    .filter((arrow) => arrow.source.kind === "lonePair" && arrow.source.atomId === atomId)
-    .map((arrow) => arrow.id)
-    .join(" + ");
-}
+): ArrowId {}
 
 function arrowsTouchingUnpairedAt(arrows: readonly ElectronFlowArrow[], atomId: AtomId): ArrowId {
killedBy: aggregate capacity findings name the right arrows, in a stable order names only the arrows that actually drew from the overdrawn lone pair
statusReason: expected undefined to be 'a1 + a3' // Object.is equality

[Killed] MethodExpression
src/legality.ts:439:10
   arrows: readonly ElectronFlowArrow[],
   atomId: AtomId,
 ): ArrowId {
-  return arrows
-    .filter((arrow) => arrow.source.kind === "lonePair" && arrow.source.atomId === atomId)
+  return arrows
     .map((arrow) => arrow.id)
     .join(" + ");
killedBy: aggregate capacity findings name the right arrows, in a stable order names only the arrows that actually drew from the overdrawn lone pair
statusReason: expected 'a1 + a2 + a3' to be 'a1 + a3' // Object.is equality

[Killed] ArrowFunction
src/legality.ts:440:13
   atomId: AtomId,
 ): ArrowId {
   return arrows
-    .filter((arrow) => arrow.source.kind === "lonePair" && arrow.source.atomId === atomId)
+    .filter(() => undefined)
     .map((arrow) => arrow.id)
     .join(" + ");
killedBy: aggregate capacity findings name the right arrows, in a stable order names only the arrows that actually drew from the overdrawn lone pair
statusReason: expected '' to be 'a1 + a3' // Object.is equality

[Killed] ConditionalExpression
src/legality.ts:440:60
   atomId: AtomId,
 ): ArrowId {
   return arrows
-    .filter((arrow) => arrow.source.kind === "lonePair" && arrow.source.atomId === atomId)
+    .filter((arrow) => arrow.source.kind === "lonePair" && true)
     .map((arrow) => arrow.id)
     .join(" + ");
killedBy: aggregate capacity findings name the right arrows, in a stable order names only the arrows that actually drew from the overdrawn lone pair
statusReason: expected 'a1 + a2 + a3' to be 'a1 + a3' // Object.is equality

[Killed] ArrowFunction
src/legality.ts:441:10
 ): ArrowId {
   return arrows
     .filter((arrow) => arrow.source.kind === "lonePair" && arrow.source.atomId === atomId)
-    .map((arrow) => arrow.id)
+    .map(() => undefined)
     .join(" + ");
 }
killedBy: aggregate capacity findings name the right arrows, in a stable order names only the arrows that actually drew from the overdrawn lone pair
statusReason: expected ' + ' to be 'a1 + a3' // Object.is equality

[Killed] BlockStatement
src/legality.ts:445:98
     .join(" + ");
 }
 
-function arrowsTouchingUnpairedAt(arrows: readonly ElectronFlowArrow[], atomId: AtomId): ArrowId {
-  return arrows
-    .filter((arrow) => arrow.source.kind === "singleElectron" && arrow.source.atomId === atomId)
-    .map((arrow) => arrow.id)
-    .join(" + ");
-}
+function arrowsTouchingUnpairedAt(arrows: readonly ElectronFlowArrow[], atomId: AtomId): ArrowId {}
 
 function arrowsSourcingBond(arrows: readonly ElectronFlowArrow[], bondId: string): ArrowId {
killedBy: SOURCE CAPACITY: the sum across a step, not one arrow at a time rejects two fishhooks off one unpaired electron
statusReason: expected undefined to be 'a1 + a2' // Object.is equality

[Killed] MethodExpression
src/legality.ts:446:10
 }
 
 function arrowsTouchingUnpairedAt(arrows: readonly ElectronFlowArrow[], atomId: AtomId): ArrowId {
-  return arrows
-    .filter((arrow) => arrow.source.kind === "singleElectron" && arrow.source.atomId === atomId)
+  return arrows
     .map((arrow) => arrow.id)
     .join(" + ");
killedBy: aggregate capacity findings name the right arrows, in a stable order names only the fishhooks that drew from the overdrawn unpaired electron
statusReason: expected 'a1 + a2 + a3' to be 'a1 + a3' // Object.is equality

[Killed] EqualityOperator
src/legality.ts:447:66
 
 function arrowsTouchingUnpairedAt(arrows: readonly ElectronFlowArrow[], atomId: AtomId): ArrowId {
   return arrows
-    .filter((arrow) => arrow.source.kind === "singleElectron" && arrow.source.atomId === atomId)
+    .filter((arrow) => arrow.source.kind === "singleElectron" && arrow.source.atomId !== atomId)
     .map((arrow) => arrow.id)
     .join(" + ");
killedBy: aggregate capacity findings name the right arrows, in a stable order names only the fishhooks that drew from the overdrawn unpaired electron
statusReason: expected 'a2' to be 'a1 + a3' // Object.is equality

[Killed] ConditionalExpression
src/legality.ts:447:66
 
 function arrowsTouchingUnpairedAt(arrows: readonly ElectronFlowArrow[], atomId: AtomId): ArrowId {
   return arrows
-    .filter((arrow) => arrow.source.kind === "singleElectron" && arrow.source.atomId === atomId)
+    .filter((arrow) => arrow.source.kind === "singleElectron" && true)
     .map((arrow) => arrow.id)
     .join(" + ");
killedBy: aggregate capacity findings name the right arrows, in a stable order names only the fishhooks that drew from the overdrawn unpaired electron
statusReason: expected 'a1 + a2 + a3' to be 'a1 + a3' // Object.is equality

[Killed] ArrowFunction
src/legality.ts:448:10
 function arrowsTouchingUnpairedAt(arrows: readonly ElectronFlowArrow[], atomId: AtomId): ArrowId {
   return arrows
     .filter((arrow) => arrow.source.kind === "singleElectron" && arrow.source.atomId === atomId)
-    .map((arrow) => arrow.id)
+    .map(() => undefined)
     .join(" + ");
 }
killedBy: aggregate capacity findings name the right arrows, in a stable order names only the fishhooks that drew from the overdrawn unpaired electron
statusReason: expected ' + ' to be 'a1 + a3' // Object.is equality

[Killed] BlockStatement
src/legality.ts:452:92
     .join(" + ");
 }
 
-function arrowsSourcingBond(arrows: readonly ElectronFlowArrow[], bondId: string): ArrowId {
-  return arrows
-    .filter((arrow) => arrow.source.kind === "bond" && arrow.source.bondId === bondId)
-    .map((arrow) => arrow.id)
-    .join(" + ");
-}
+function arrowsSourcingBond(arrows: readonly ElectronFlowArrow[], bondId: string): ArrowId {}
 
killedBy: SOURCE CAPACITY: the sum across a step, not one arrow at a time rejects three fishhooks out of a single bond, which only holds two electrons
statusReason: expected undefined to be 'a1 + a2 + a3' // Object.is equality

[Killed] MethodExpression
src/legality.ts:453:10
 }
 
 function arrowsSourcingBond(arrows: readonly ElectronFlowArrow[], bondId: string): ArrowId {
-  return arrows
-    .filter((arrow) => arrow.source.kind === "bond" && arrow.source.bondId === bondId)
+  return arrows
     .map((arrow) => arrow.id)
     .join(" + ");
killedBy: aggregate capacity findings name the right arrows, in a stable order names only the arrows that drew from the overdrawn bond
statusReason: expected 'a1 + a2 + a3 + a4' to be 'a1 + a3 + a4' // Object.is equality

[Killed] EqualityOperator
src/legality.ts:454:56
 
 function arrowsSourcingBond(arrows: readonly ElectronFlowArrow[], bondId: string): ArrowId {
   return arrows
-    .filter((arrow) => arrow.source.kind === "bond" && arrow.source.bondId === bondId)
+    .filter((arrow) => arrow.source.kind === "bond" && arrow.source.bondId !== bondId)
     .map((arrow) => arrow.id)
     .join(" + ");
killedBy: aggregate capacity findings name the right arrows, in a stable order names only the arrows that drew from the overdrawn bond
statusReason: expected 'a2' to be 'a1 + a3 + a4' // Object.is equality

[Killed] ArrowFunction
src/legality.ts:454:13
 
 function arrowsSourcingBond(arrows: readonly ElectronFlowArrow[], bondId: string): ArrowId {
   return arrows
-    .filter((arrow) => arrow.source.kind === "bond" && arrow.source.bondId === bondId)
+    .filter(() => undefined)
     .map((arrow) => arrow.id)
     .join(" + ");
killedBy: aggregate capacity findings name the right arrows, in a stable order names only the arrows that drew from the overdrawn bond
statusReason: expected '' to be 'a1 + a3 + a4' // Object.is equality

[Killed] ArrowFunction
src/legality.ts:455:10
 function arrowsSourcingBond(arrows: readonly ElectronFlowArrow[], bondId: string): ArrowId {
   return arrows
     .filter((arrow) => arrow.source.kind === "bond" && arrow.source.bondId === bondId)
-    .map((arrow) => arrow.id)
+    .map(() => undefined)
     .join(" + ");
 }
killedBy: aggregate capacity findings name the right arrows, in a stable order names only the arrows that drew from the overdrawn bond
statusReason: expected ' +  + ' to be 'a1 + a3 + a4' // Object.is equality
