[Killed] BlockStatement
src/arrows.ts:65:79
   readonly electrons?: ElectronCount;
 }
 
-export function createArrow(input: ElectronFlowArrowInput): ElectronFlowArrow {
-  return Object.freeze({
-    id: input.id,
-    electrons: input.electrons ?? 2,
-    source: Object.freeze({ ...input.source }),
-    sink: Object.freeze({ ...input.sink }),
-  });
-}
+export function createArrow(input: ElectronFlowArrowInput): ElectronFlowArrow {}
 
 export function fromLonePair(atomId: AtomId): ElectronSource {
killedBy: createArrow defaults to two electrons, the ordinary double barbed arrow
statusReason: Cannot read properties of undefined (reading 'electrons')

[Killed] ObjectLiteral
src/arrows.ts:66:24
 }
 
 export function createArrow(input: ElectronFlowArrowInput): ElectronFlowArrow {
-  return Object.freeze({
-    id: input.id,
-    electrons: input.electrons ?? 2,
-    source: Object.freeze({ ...input.source }),
-    sink: Object.freeze({ ...input.sink }),
-  });
+  return Object.freeze({});
 }
 
killedBy: createArrow defaults to two electrons, the ordinary double barbed arrow
statusReason: expected undefined to be 2 // Object.is equality

[Killed] LogicalOperator
src/arrows.ts:68:16
 export function createArrow(input: ElectronFlowArrowInput): ElectronFlowArrow {
   return Object.freeze({
     id: input.id,
-    electrons: input.electrons ?? 2,
+    electrons: input.electrons && 2,
     source: Object.freeze({ ...input.source }),
     sink: Object.freeze({ ...input.sink }),
killedBy: createArrow defaults to two electrons, the ordinary double barbed arrow
statusReason: expected undefined to be 2 // Object.is equality

[Killed] ObjectLiteral
src/arrows.ts:69:27
   return Object.freeze({
     id: input.id,
     electrons: input.electrons ?? 2,
-    source: Object.freeze({ ...input.source }),
+    source: Object.freeze({}),
     sink: Object.freeze({ ...input.sink }),
   });
killedBy: createArrow keeps its id, source, and sink
statusReason: expected {} to deeply equal { kind: 'bond', bondId: 'b1' }

[Killed] BlockStatement
src/arrows.ts:74:62
   });
 }
 
-export function fromLonePair(atomId: AtomId): ElectronSource {
-  return { kind: "lonePair", atomId };
-}
+export function fromLonePair(atomId: AtomId): ElectronSource {}
 
 export function fromBond(bondId: BondId): ElectronSource {
killedBy: source and sink constructors tag each shape with the kind the union discriminates on
statusReason: expected undefined to deeply equal { kind: 'lonePair', atomId: 'o1' }

[Killed] StringLiteral
src/arrows.ts:75:18
 }
 
 export function fromLonePair(atomId: AtomId): ElectronSource {
-  return { kind: "lonePair", atomId };
+  return { kind: "", atomId };
 }
 
killedBy: source and sink constructors tag each shape with the kind the union discriminates on
statusReason: expected { kind: '', atomId: 'o1' } to deeply equal { kind: 'lonePair', atomId: 'o1' }

[Killed] BlockStatement
src/arrows.ts:78:58
   return { kind: "lonePair", atomId };
 }
 
-export function fromBond(bondId: BondId): ElectronSource {
-  return { kind: "bond", bondId };
-}
+export function fromBond(bondId: BondId): ElectronSource {}
 
 export function fromSingleElectron(atomId: AtomId): ElectronSource {
killedBy: source and sink constructors tag each shape with the kind the union discriminates on
statusReason: expected undefined to deeply equal { kind: 'bond', bondId: 'b1' }

[Killed] BlockStatement
src/arrows.ts:82:68
   return { kind: "bond", bondId };
 }
 
-export function fromSingleElectron(atomId: AtomId): ElectronSource {
-  return { kind: "singleElectron", atomId };
-}
+export function fromSingleElectron(atomId: AtomId): ElectronSource {}
 
 export function toAtom(atomId: AtomId): ElectronSink {
killedBy: source and sink constructors tag each shape with the kind the union discriminates on
statusReason: expected undefined to deeply equal { kind: 'singleElectron', …(1) }

[Killed] StringLiteral
src/arrows.ts:83:18
 }
 
 export function fromSingleElectron(atomId: AtomId): ElectronSource {
-  return { kind: "singleElectron", atomId };
+  return { kind: "", atomId };
 }
 
killedBy: source and sink constructors tag each shape with the kind the union discriminates on
statusReason: expected { kind: '', atomId: 'br1' } to deeply equal { kind: 'singleElectron', …(1) }

[Killed] ObjectLiteral
src/arrows.ts:83:10
 }
 
 export function fromSingleElectron(atomId: AtomId): ElectronSource {
-  return { kind: "singleElectron", atomId };
+  return {};
 }
 
killedBy: source and sink constructors tag each shape with the kind the union discriminates on
statusReason: expected {} to deeply equal { kind: 'singleElectron', …(1) }

[Killed] BlockStatement
src/arrows.ts:86:54
   return { kind: "singleElectron", atomId };
 }
 
-export function toAtom(atomId: AtomId): ElectronSink {
-  return { kind: "atom", atomId };
-}
+export function toAtom(atomId: AtomId): ElectronSink {}
 
 export function toBondBetween(a: AtomId, b: AtomId): ElectronSink {
killedBy: source and sink constructors tag each shape with the kind the union discriminates on
statusReason: expected undefined to deeply equal { kind: 'atom', atomId: 'cl1' }

[Killed] BlockStatement
src/arrows.ts:90:67
   return { kind: "atom", atomId };
 }
 
-export function toBondBetween(a: AtomId, b: AtomId): ElectronSink {
-  return { kind: "betweenAtoms", atomIds: [a, b] };
-}
+export function toBondBetween(a: AtomId, b: AtomId): ElectronSink {}
 
 /**
killedBy: sourceAtomIds and sinkAtomIds gives one atom for an atom sink and two for a bond forming sink
statusReason: Cannot read properties of undefined (reading 'kind')

[Killed] ObjectLiteral
src/arrows.ts:91:10
 }
 
 export function toBondBetween(a: AtomId, b: AtomId): ElectronSink {
-  return { kind: "betweenAtoms", atomIds: [a, b] };
+  return {};
 }
 
killedBy: sourceAtomIds and sinkAtomIds gives one atom for an atom sink and two for a bond forming sink
statusReason: Cannot read properties of undefined (reading '0')

[Killed] StringLiteral
src/arrows.ts:91:18
 }
 
 export function toBondBetween(a: AtomId, b: AtomId): ElectronSink {
-  return { kind: "betweenAtoms", atomIds: [a, b] };
+  return { kind: "", atomIds: [a, b] };
 }
 
killedBy: NON DEGENERACY: an arrow has to claim something moved rejects a sink that bonds an atom to itself, before saying anything about adjacency
statusReason: expected 'endpoints_share_no_atom' to be 'sink_bonds_an_atom_to_itself' // Object.is equality

[Killed] BlockStatement
src/arrows.ts:101:80
  * ends needs the species it lives in, which this file does not have. deltas.ts
  * does that resolution.
  */
-export function referencedAtomIds(arrow: ElectronFlowArrow): readonly AtomId[] {
-  const ids: AtomId[] = [];
-  if (arrow.source.kind === "lonePair" || arrow.source.kind === "singleElectron") {
-    ids.push(arrow.source.atomId);
-  }
-  if (arrow.sink.kind === "atom") {
-    ids.push(arrow.sink.atomId);
-  } else {
-    ids.push(arrow.sink.atomIds[0], arrow.sink.atomIds[1]);
-  }
-  return ids;
-}
+export function referencedAtomIds(arrow: ElectronFlowArrow): readonly AtomId[] {}
 
 export function referencedBondIds(arrow: ElectronFlowArrow): readonly BondId[] {
killedBy: referencedAtomIds names the source atom and the sink atom for a lone pair to atom arrow
statusReason: expected undefined to deeply equal [ 'o1', 'c1' ]

[Killed] EqualityOperator
src/arrows.ts:103:43
  */
 export function referencedAtomIds(arrow: ElectronFlowArrow): readonly AtomId[] {
   const ids: AtomId[] = [];
-  if (arrow.source.kind === "lonePair" || arrow.source.kind === "singleElectron") {
+  if (arrow.source.kind === "lonePair" || arrow.source.kind !== "singleElectron") {
     ids.push(arrow.source.atomId);
   }
killedBy: referencedAtomIds names the atom a single electron source sits on
statusReason: expected [ 'c1' ] to include 'br1'

[Killed] BlockStatement
src/arrows.ts:103:83
  */
 export function referencedAtomIds(arrow: ElectronFlowArrow): readonly AtomId[] {
   const ids: AtomId[] = [];
-  if (arrow.source.kind === "lonePair" || arrow.source.kind === "singleElectron") {
-    ids.push(arrow.source.atomId);
-  }
+  if (arrow.source.kind === "lonePair" || arrow.source.kind === "singleElectron") {}
   if (arrow.sink.kind === "atom") {
     ids.push(arrow.sink.atomId);
killedBy: referencedAtomIds names the source atom and the sink atom for a lone pair to atom arrow
statusReason: expected [ 'c1' ] to deeply equal [ 'o1', 'c1' ]

[Killed] BlockStatement
src/arrows.ts:106:35
   if (arrow.source.kind === "lonePair" || arrow.source.kind === "singleElectron") {
     ids.push(arrow.source.atomId);
   }
-  if (arrow.sink.kind === "atom") {
-    ids.push(arrow.sink.atomId);
-  } else {
+  if (arrow.sink.kind === "atom") {} else {
     ids.push(arrow.sink.atomIds[0], arrow.sink.atomIds[1]);
   }
killedBy: referencedAtomIds names the source atom and the sink atom for a lone pair to atom arrow
statusReason: expected [ 'o1' ] to deeply equal [ 'o1', 'c1' ]

[Killed] ConditionalExpression
src/arrows.ts:106:7
   if (arrow.source.kind === "lonePair" || arrow.source.kind === "singleElectron") {
     ids.push(arrow.source.atomId);
   }
-  if (arrow.sink.kind === "atom") {
+  if (true) {
     ids.push(arrow.sink.atomId);
   } else {
killedBy: referencedAtomIds names both ends of a bond forming sink
statusReason: expected [ 'o1', undefined ] to deeply equal [ 'o1', 'o1', 'c1' ]

[Killed] BlockStatement
src/arrows.ts:108:10
   }
   if (arrow.sink.kind === "atom") {
     ids.push(arrow.sink.atomId);
-  } else {
-    ids.push(arrow.sink.atomIds[0], arrow.sink.atomIds[1]);
-  }
+  } else {}
   return ids;
 }
killedBy: referencedAtomIds names both ends of a bond forming sink
statusReason: expected [ 'o1' ] to deeply equal [ 'o1', 'o1', 'c1' ]

[Killed] BlockStatement
src/arrows.ts:114:80
   return ids;
 }
 
-export function referencedBondIds(arrow: ElectronFlowArrow): readonly BondId[] {
-  return arrow.source.kind === "bond" ? [arrow.source.bondId] : [];
-}
+export function referencedBondIds(arrow: ElectronFlowArrow): readonly BondId[] {}
 
killedBy: referencedBondIds names the bond a bond source reads from
statusReason: expected undefined to deeply equal [ 'b1' ]

[Killed] EqualityOperator
src/arrows.ts:115:10
 }
 
 export function referencedBondIds(arrow: ElectronFlowArrow): readonly BondId[] {
-  return arrow.source.kind === "bond" ? [arrow.source.bondId] : [];
+  return arrow.source.kind !== "bond" ? [arrow.source.bondId] : [];
 }
 
killedBy: referencedBondIds names the bond a bond source reads from
statusReason: expected [] to deeply equal [ 'b1' ]

[Killed] ConditionalExpression
src/arrows.ts:115:10
 }
 
 export function referencedBondIds(arrow: ElectronFlowArrow): readonly BondId[] {
-  return arrow.source.kind === "bond" ? [arrow.source.bondId] : [];
+  return false ? [arrow.source.bondId] : [];
 }
 
killedBy: referencedBondIds names the bond a bond source reads from
statusReason: expected [] to deeply equal [ 'b1' ]
