[Killed] BlockStatement
src/atom.ts:119:52
  * promise and disappears at runtime. The freeze is what actually stops a
  * renderer from writing to a shared atom at 1am.
  */
-export function createAtom(input: AtomInput): Atom {
-  return Object.freeze({
-    id: input.id,
-    element: input.element,
-    formalCharge: input.formalCharge ?? 0,
-    lonePairs: input.lonePairs ?? 0,
-    unpairedElectrons: input.unpairedElectrons ?? 0,
-    implicitHydrogens: input.implicitHydrogens ?? 0,
-    ...(input.isotope === undefined ? {} : { isotope: input.isotope }),
-    ...(input.stereo === undefined ? {} : { stereo: input.stereo }),
-    ...(input.geometry === undefined ? {} : { geometry: input.geometry }),
-  });
-}
+export function createAtom(input: AtomInput): Atom {}
 
 /** Nonbonding electrons on this atom. Lone pairs count double. */
killedBy: withAtomPatch changes only the fields the patch names
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
src/atom.ts:123:19
   return Object.freeze({
     id: input.id,
     element: input.element,
-    formalCharge: input.formalCharge ?? 0,
+    formalCharge: input.formalCharge && 0,
     lonePairs: input.lonePairs ?? 0,
     unpairedElectrons: input.unpairedElectrons ?? 0,
killedBy: observedDeltas reports the formal charge change, which it carries but never asserts
statusReason: expected NaN to be 1 // Object.is equality

[Killed] LogicalOperator
src/atom.ts:124:16
     id: input.id,
     element: input.element,
     formalCharge: input.formalCharge ?? 0,
-    lonePairs: input.lonePairs ?? 0,
+    lonePairs: input.lonePairs && 0,
     unpairedElectrons: input.unpairedElectrons ?? 0,
     implicitHydrogens: input.implicitHydrogens ?? 0,
killedBy: derivedFormalCharge is zero on a neutral carbon with four bonds
statusReason: expected NaN to be +0 // Object.is equality

[Killed] LogicalOperator
src/atom.ts:125:24
     element: input.element,
     formalCharge: input.formalCharge ?? 0,
     lonePairs: input.lonePairs ?? 0,
-    unpairedElectrons: input.unpairedElectrons ?? 0,
+    unpairedElectrons: input.unpairedElectrons && 0,
     implicitHydrogens: input.implicitHydrogens ?? 0,
     ...(input.isotope === undefined ? {} : { isotope: input.isotope }),
killedBy: observedDeltas reports the nonbonding change on each atom
statusReason: expected NaN to be -2 // Object.is equality

[Killed] LogicalOperator
src/atom.ts:126:24
     formalCharge: input.formalCharge ?? 0,
     lonePairs: input.lonePairs ?? 0,
     unpairedElectrons: input.unpairedElectrons ?? 0,
-    implicitHydrogens: input.implicitHydrogens ?? 0,
+    implicitHydrogens: input.implicitHydrogens && 0,
     ...(input.isotope === undefined ? {} : { isotope: input.isotope }),
     ...(input.stereo === undefined ? {} : { stereo: input.stereo }),
killedBy: withAtomPatch changes only the fields the patch names
statusReason: expected undefined to be +0 // Object.is equality

[Killed] EqualityOperator
src/atom.ts:127:9
     lonePairs: input.lonePairs ?? 0,
     unpairedElectrons: input.unpairedElectrons ?? 0,
     implicitHydrogens: input.implicitHydrogens ?? 0,
-    ...(input.isotope === undefined ? {} : { isotope: input.isotope }),
+    ...(input.isotope !== undefined ? {} : { isotope: input.isotope }),
     ...(input.stereo === undefined ? {} : { stereo: input.stereo }),
     ...(input.geometry === undefined ? {} : { geometry: input.geometry }),
killedBy: nuclideCounts keys a labelled nuclide separately from its element
statusReason: expected { C: 2, H: 1 } to deeply equal { '[13C]': 1, C: 1, H: 1 }

[Killed] ConditionalExpression
src/atom.ts:127:9
     lonePairs: input.lonePairs ?? 0,
     unpairedElectrons: input.unpairedElectrons ?? 0,
     implicitHydrogens: input.implicitHydrogens ?? 0,
-    ...(input.isotope === undefined ? {} : { isotope: input.isotope }),
+    ...(true ? {} : { isotope: input.isotope }),
     ...(input.stereo === undefined ? {} : { stereo: input.stereo }),
     ...(input.geometry === undefined ? {} : { geometry: input.geometry }),
killedBy: withAtomPatch keeps an unpatched optional field rather than dropping it
statusReason: expected undefined to be 13 // Object.is equality

[Killed] ConditionalExpression
src/atom.ts:128:9
     unpairedElectrons: input.unpairedElectrons ?? 0,
     implicitHydrogens: input.implicitHydrogens ?? 0,
     ...(input.isotope === undefined ? {} : { isotope: input.isotope }),
-    ...(input.stereo === undefined ? {} : { stereo: input.stereo }),
+    ...(false ? {} : { stereo: input.stereo }),
     ...(input.geometry === undefined ? {} : { geometry: input.geometry }),
   });
killedBy: createAtom distinguishes an absent optional field from one set to undefined
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/atom.ts:128:9
     unpairedElectrons: input.unpairedElectrons ?? 0,
     implicitHydrogens: input.implicitHydrogens ?? 0,
     ...(input.isotope === undefined ? {} : { isotope: input.isotope }),
-    ...(input.stereo === undefined ? {} : { stereo: input.stereo }),
+    ...(true ? {} : { stereo: input.stereo }),
     ...(input.geometry === undefined ? {} : { geometry: input.geometry }),
   });
killedBy: withAtomPatch keeps an unpatched optional field rather than dropping it
statusReason: expected undefined to deeply equal { kind: 'tetrahedral', …(2) }

[Killed] ConditionalExpression
src/atom.ts:129:9
     implicitHydrogens: input.implicitHydrogens ?? 0,
     ...(input.isotope === undefined ? {} : { isotope: input.isotope }),
     ...(input.stereo === undefined ? {} : { stereo: input.stereo }),
-    ...(input.geometry === undefined ? {} : { geometry: input.geometry }),
+    ...(false ? {} : { geometry: input.geometry }),
   });
 }
killedBy: createAtom distinguishes an absent optional field from one set to undefined
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/atom.ts:129:9
     implicitHydrogens: input.implicitHydrogens ?? 0,
     ...(input.isotope === undefined ? {} : { isotope: input.isotope }),
     ...(input.stereo === undefined ? {} : { stereo: input.stereo }),
-    ...(input.geometry === undefined ? {} : { geometry: input.geometry }),
+    ...(true ? {} : { geometry: input.geometry }),
   });
 }
killedBy: withAtomPatch keeps an unpatched optional field rather than dropping it
statusReason: expected undefined to deeply equal { x: +0, y: +0, z: +0 }

[Killed] BlockStatement
src/atom.ts:134:57
 }
 
 /** Nonbonding electrons on this atom. Lone pairs count double. */
-export function nonbondingElectrons(atom: Atom): number {
-  return atom.lonePairs * 2 + atom.unpairedElectrons;
-}
+export function nonbondingElectrons(atom: Atom): number {}
 
 /**
killedBy: observedDeltas reports the nonbonding change on each atom
statusReason: expected NaN to be -2 // Object.is equality

[Killed] ArithmeticOperator
src/atom.ts:135:10
 
 /** Nonbonding electrons on this atom. Lone pairs count double. */
 export function nonbondingElectrons(atom: Atom): number {
-  return atom.lonePairs * 2 + atom.unpairedElectrons;
+  return atom.lonePairs * 2 - atom.unpairedElectrons;
 }
 
killedBy: nonbondingElectrons counts an unpaired electron as one
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/atom.ts:135:10
 
 /** Nonbonding electrons on this atom. Lone pairs count double. */
 export function nonbondingElectrons(atom: Atom): number {
-  return atom.lonePairs * 2 + atom.unpairedElectrons;
+  return atom.lonePairs / 2 + atom.unpairedElectrons;
 }
 
killedBy: observedDeltas reports the nonbonding change on each atom
statusReason: expected -0.5 to be -2 // Object.is equality

[Killed] BlockStatement
src/atom.ts:145:72
  * weights, because floating point sums of atomic weights do not compare equal
  * and a tolerance on that comparison is a tolerance somebody will later widen.
  */
-export function nuclideKey(element: Element, isotope?: number): string {
-  return isotope === undefined ? element : `[${isotope}${element}]`;
-}
+export function nuclideKey(element: Element, isotope?: number): string {}
 
 export function atomNuclideKey(atom: Atom): string {
killedBy: nuclideCounts counts implicit hydrogens as real atoms
statusReason: expected { undefined: 5 } to deeply equal { C: 1, H: 4 }

[Killed] EqualityOperator
src/atom.ts:146:10
  * and a tolerance on that comparison is a tolerance somebody will later widen.
  */
 export function nuclideKey(element: Element, isotope?: number): string {
-  return isotope === undefined ? element : `[${isotope}${element}]`;
+  return isotope !== undefined ? element : `[${isotope}${element}]`;
 }
 
killedBy: nuclideCounts counts implicit hydrogens as real atoms
statusReason: expected { Object ([undefinedC], [undefinedH]) } to deeply equal { C: 1, H: 4 }

[Killed] ConditionalExpression
src/atom.ts:146:10
  * and a tolerance on that comparison is a tolerance somebody will later widen.
  */
 export function nuclideKey(element: Element, isotope?: number): string {
-  return isotope === undefined ? element : `[${isotope}${element}]`;
+  return true ? element : `[${isotope}${element}]`;
 }
 
killedBy: nuclideCounts keys a labelled nuclide separately from its element
statusReason: expected { C: 2, H: 1 } to deeply equal { '[13C]': 1, C: 1, H: 1 }

[Killed] BlockStatement
src/atom.ts:149:52
   return isotope === undefined ? element : `[${isotope}${element}]`;
 }
 
-export function atomNuclideKey(atom: Atom): string {
-  return nuclideKey(atom.element, atom.isotope);
-}
+export function atomNuclideKey(atom: Atom): string {}
 
killedBy: nuclideCounts counts implicit hydrogens as real atoms
statusReason: expected { undefined: 1, H: 4 } to deeply equal { C: 1, H: 4 }
