[Killed] BlockStatement
src/bond.ts:66:52
   readonly stereo?: BondStereo;
 }
 
-export function createBond(input: BondInput): Bond {
-  if (input.a === input.b) {
-    throw new Error(`Bond ${input.id} joins atom ${input.a} to itself`);
-  }
-  return Object.freeze({
-    id: input.id,
-    a: input.a,
-    b: input.b,
-    order: input.order ?? 1,
-    ...(input.stereo === undefined ? {} : { stereo: input.stereo }),
-  });
-}
+export function createBond(input: BondInput): Bond {}
 
 /**
killedBy: declaredDeltas takes electrons off a lone pair source
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
src/bond.ts:67:7
 }
 
 export function createBond(input: BondInput): Bond {
-  if (input.a === input.b) {
+  if (input.a !== input.b) {
     throw new Error(`Bond ${input.id} joins atom ${input.a} to itself`);
   }
killedBy: createState copies both lists rather than aliasing them, and freezes the result
statusReason: Bond b1 joins atom c1 to itself

[Killed] ConditionalExpression
src/bond.ts:67:7
 }
 
 export function createBond(input: BondInput): Bond {
-  if (input.a === input.b) {
+  if (true) {
     throw new Error(`Bond ${input.id} joins atom ${input.a} to itself`);
   }
killedBy: createSpecies keeps a label and declared torsions when given
statusReason: Bond b1 joins atom c1 to itself

[Killed] LogicalOperator
src/bond.ts:74:12
     id: input.id,
     a: input.a,
     b: input.b,
-    order: input.order ?? 1,
+    order: input.order && 1,
     ...(input.stereo === undefined ? {} : { stereo: input.stereo }),
   });
killedBy: bondOrderSumAt counts a double bond as two
statusReason: expected 3 to be 4 // Object.is equality

[Killed] EqualityOperator
src/bond.ts:75:9
     a: input.a,
     b: input.b,
     order: input.order ?? 1,
-    ...(input.stereo === undefined ? {} : { stereo: input.stereo }),
+    ...(input.stereo !== undefined ? {} : { stereo: input.stereo }),
   });
 }
killedBy: createBond omits stereo rather than storing undefined
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/bond.ts:75:9
     a: input.a,
     b: input.b,
     order: input.order ?? 1,
-    ...(input.stereo === undefined ? {} : { stereo: input.stereo }),
+    ...(true ? {} : { stereo: input.stereo }),
   });
 }
killedBy: createBond carries double bond stereo through untouched
statusReason: expected undefined to deeply equal { kind: 'doubleBond', …(2) }

[Killed] BlockStatement
src/bond.ts:87:59
  * a bond that forms during a step never had an id in the previous state. See the
  * invariant note in ids.ts.
  */
-export function atomPairKey(a: AtomId, b: AtomId): string {
-  return a < b ? `${a}|${b}` : `${b}|${a}`;
-}
+export function atomPairKey(a: AtomId, b: AtomId): string {}
 
 export function bondPairKey(bond: Bond): string {
killedBy: declaredDeltas takes electrons off a lone pair source
statusReason: Cannot read properties of undefined (reading 'indexOf')

[Killed] ConditionalExpression
src/bond.ts:88:10
  * invariant note in ids.ts.
  */
 export function atomPairKey(a: AtomId, b: AtomId): string {
-  return a < b ? `${a}|${b}` : `${b}|${a}`;
+  return false ? `${a}|${b}` : `${b}|${a}`;
 }
 
killedBy: declaredDeltas takes electrons out of a bond source and lands them on the sink atom
statusReason: expected [ { atomIds: [ 'cl1', 'c1' ], …(1) } ] to deeply equal [ { atomIds: [ 'c1', 'cl1' ], …(1) } ]

[Killed] EqualityOperator
src/bond.ts:88:10
  * invariant note in ids.ts.
  */
 export function atomPairKey(a: AtomId, b: AtomId): string {
-  return a < b ? `${a}|${b}` : `${b}|${a}`;
+  return a >= b ? `${a}|${b}` : `${b}|${a}`;
 }
 
killedBy: declaredDeltas puts electrons into the bond a betweenAtoms sink names
statusReason: expected [ { atomIds: [ 'o1', 'c1' ], …(1) } ] to deeply equal [ { atomIds: [ 'c1', 'o1' ], …(1) } ]

[Killed] BlockStatement
src/bond.ts:91:49
   return a < b ? `${a}|${b}` : `${b}|${a}`;
 }
 
-export function bondPairKey(bond: Bond): string {
-  return atomPairKey(bond.a, bond.b);
-}
+export function bondPairKey(bond: Bond): string {}
 
 /** Split a key made by `atomPairKey` back into its two atom ids. */
killedBy: atomPairKey reads a bond's key off the bond
statusReason: expected undefined to be 'c1|cl1' // Object.is equality

[Killed] BlockStatement
src/bond.ts:96:74
 }
 
 /** Split a key made by `atomPairKey` back into its two atom ids. */
-export function parseAtomPairKey(key: string): readonly [AtomId, AtomId] {
-  const separator = key.indexOf("|");
-  if (separator < 0) {
-    throw new Error(`Not an atom pair key: ${key}`);
-  }
-  return [key.slice(0, separator), key.slice(separator + 1)];
-}
+export function parseAtomPairKey(key: string): readonly [AtomId, AtomId] {}
 
 /** The other end of a bond, given one end. Throws if the atom is not on it. */
killedBy: declaredDeltas puts electrons into the bond a betweenAtoms sink names
statusReason: expected [ Array(1) ] to deeply equal [ { atomIds: [ 'c1', 'o1' ], …(1) } ]

[Killed] ConditionalExpression
src/bond.ts:98:7
 /** Split a key made by `atomPairKey` back into its two atom ids. */
 export function parseAtomPairKey(key: string): readonly [AtomId, AtomId] {
   const separator = key.indexOf("|");
-  if (separator < 0) {
+  if (true) {
     throw new Error(`Not an atom pair key: ${key}`);
   }
killedBy: declaredDeltas takes electrons off a lone pair source
statusReason: Not an atom pair key: c1|o1

[Killed] EqualityOperator
src/bond.ts:98:7
 /** Split a key made by `atomPairKey` back into its two atom ids. */
 export function parseAtomPairKey(key: string): readonly [AtomId, AtomId] {
   const separator = key.indexOf("|");
-  if (separator < 0) {
+  if (separator >= 0) {
     throw new Error(`Not an atom pair key: ${key}`);
   }
killedBy: declaredDeltas takes electrons off a lone pair source
statusReason: Not an atom pair key: c1|o1

[Killed] MethodExpression
src/bond.ts:101:36
   if (separator < 0) {
     throw new Error(`Not an atom pair key: ${key}`);
   }
-  return [key.slice(0, separator), key.slice(separator + 1)];
+  return [key.slice(0, separator), key];
 }
 
killedBy: declaredDeltas puts electrons into the bond a betweenAtoms sink names
statusReason: expected [ Array(1) ] to deeply equal [ { atomIds: [ 'c1', 'o1' ], …(1) } ]

[Killed] ArithmeticOperator
src/bond.ts:101:46
   if (separator < 0) {
     throw new Error(`Not an atom pair key: ${key}`);
   }
-  return [key.slice(0, separator), key.slice(separator + 1)];
+  return [key.slice(0, separator), key.slice(separator - 1)];
 }
 
killedBy: parseAtomPairKey round trips a key back to its two ids in sorted order
statusReason: expected [ 'c1', '1|cl1' ] to deeply equal [ 'c1', 'cl1' ]

[Killed] BlockStatement
src/bond.ts:105:62
 }
 
 /** The other end of a bond, given one end. Throws if the atom is not on it. */
-export function otherEnd(bond: Bond, atomId: AtomId): AtomId {
-  if (bond.a === atomId) return bond.b;
-  if (bond.b === atomId) return bond.a;
-  throw new Error(`Atom ${atomId} is not an end of bond ${bond.id}`);
-}
+export function otherEnd(bond: Bond, atomId: AtomId): AtomId {}
 
 export function bondTouches(bond: Bond, atomId: AtomId): boolean {
killedBy: bondsAt and neighborIds names the far end of every bond, never the atom itself
statusReason: expected [ undefined, undefined ] to deeply equal [ 'c1', 'o1' ]

[Killed] ConditionalExpression
src/bond.ts:106:7
 
 /** The other end of a bond, given one end. Throws if the atom is not on it. */
 export function otherEnd(bond: Bond, atomId: AtomId): AtomId {
-  if (bond.a === atomId) return bond.b;
+  if (false) return bond.b;
   if (bond.b === atomId) return bond.a;
   throw new Error(`Atom ${atomId} is not an end of bond ${bond.id}`);
killedBy: otherEnd returns the far end from either side
statusReason: Atom c1 is not an end of bond b1

[Killed] ConditionalExpression
src/bond.ts:106:7
 
 /** The other end of a bond, given one end. Throws if the atom is not on it. */
 export function otherEnd(bond: Bond, atomId: AtomId): AtomId {
-  if (bond.a === atomId) return bond.b;
+  if (true) return bond.b;
   if (bond.b === atomId) return bond.a;
   throw new Error(`Atom ${atomId} is not an end of bond ${bond.id}`);
killedBy: bondsAt and neighborIds names the far end of every bond, never the atom itself
statusReason: expected [ 'c2', 'o1' ] to deeply equal [ 'c1', 'o1' ]

[Killed] ConditionalExpression
src/bond.ts:107:7
 /** The other end of a bond, given one end. Throws if the atom is not on it. */
 export function otherEnd(bond: Bond, atomId: AtomId): AtomId {
   if (bond.a === atomId) return bond.b;
-  if (bond.b === atomId) return bond.a;
+  if (false) return bond.a;
   throw new Error(`Atom ${atomId} is not an end of bond ${bond.id}`);
 }
killedBy: bondsAt and neighborIds names the far end of every bond, never the atom itself
statusReason: Atom c2 is not an end of bond b1

[Killed] ConditionalExpression
src/bond.ts:107:7
 /** The other end of a bond, given one end. Throws if the atom is not on it. */
 export function otherEnd(bond: Bond, atomId: AtomId): AtomId {
   if (bond.a === atomId) return bond.b;
-  if (bond.b === atomId) return bond.a;
+  if (true) return bond.a;
   throw new Error(`Atom ${atomId} is not an end of bond ${bond.id}`);
 }
killedBy: otherEnd throws when the atom is not on the bond
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/bond.ts:111:66
   throw new Error(`Atom ${atomId} is not an end of bond ${bond.id}`);
 }
 
-export function bondTouches(bond: Bond, atomId: AtomId): boolean {
-  return bond.a === atomId || bond.b === atomId;
-}
+export function bondTouches(bond: Bond, atomId: AtomId): boolean {}
 
killedBy: bondOrderSumAt counts a double bond as two
statusReason: expected +0 to be 4 // Object.is equality

[Killed] EqualityOperator
src/bond.ts:112:31
 }
 
 export function bondTouches(bond: Bond, atomId: AtomId): boolean {
-  return bond.a === atomId || bond.b === atomId;
+  return bond.a === atomId || bond.b !== atomId;
 }
 
killedBy: bondsAt and neighborIds returns every bond touching an atom
statusReason: expected [ 'b2' ] to deeply equal [ 'b1', 'b2' ]

[Killed] ConditionalExpression
src/bond.ts:112:10
 }
 
 export function bondTouches(bond: Bond, atomId: AtomId): boolean {
-  return bond.a === atomId || bond.b === atomId;
+  return false || bond.b === atomId;
 }
 
killedBy: bondTouches is true at both ends and false elsewhere
statusReason: expected false to be true // Object.is equality
