[Killed] StringLiteral
src/bookkeeping.ts:30:33
 /** A multiset of nuclei, keyed as in `nuclideKey`. */
 export type NuclideCounts = Readonly<Record<string, number>>;
 
-const HYDROGEN_KEY = nuclideKey("H");
+const HYDROGEN_KEY = nuclideKey("");
 
 function addTo(counts: Record<string, number>, key: string, amount: number): void {
killedBy: nuclideCounts counts implicit hydrogens as real atoms
statusReason: expected { C: 1, '': 4 } to deeply equal { C: 1, H: 4 }

[Killed] BlockStatement
src/bookkeeping.ts:32:83
 
 const HYDROGEN_KEY = nuclideKey("H");
 
-function addTo(counts: Record<string, number>, key: string, amount: number): void {
-  counts[key] = (counts[key] ?? 0) + amount;
-}
+function addTo(counts: Record<string, number>, key: string, amount: number): void {}
 
 /**
killedBy: nuclideCounts counts implicit hydrogens as real atoms
statusReason: expected {} to deeply equal { C: 1, H: 4 }

[Killed] ArithmeticOperator
src/bookkeeping.ts:33:17
 const HYDROGEN_KEY = nuclideKey("H");
 
 function addTo(counts: Record<string, number>, key: string, amount: number): void {
-  counts[key] = (counts[key] ?? 0) + amount;
+  counts[key] = (counts[key] ?? 0) - amount;
 }
 
killedBy: nuclideCounts counts implicit hydrogens as real atoms
statusReason: expected { C: -1, H: -4 } to deeply equal { C: 1, H: 4 }

[Killed] LogicalOperator
src/bookkeeping.ts:33:18
 const HYDROGEN_KEY = nuclideKey("H");
 
 function addTo(counts: Record<string, number>, key: string, amount: number): void {
-  counts[key] = (counts[key] ?? 0) + amount;
+  counts[key] = (counts[key] && 0) + amount;
 }
 
killedBy: nuclideCounts counts implicit hydrogens as real atoms
statusReason: expected { C: NaN, H: NaN } to deeply equal { C: 1, H: 4 }

[Killed] BlockStatement
src/bookkeeping.ts:45:64
  * explicit atom list reports conservation while a proton quietly appeared or
  * vanished.
  */
-export function nuclideCounts(species: Species): NuclideCounts {
-  const counts: Record<string, number> = {};
-  for (const atom of species.atoms) {
-    addTo(counts, atomNuclideKey(atom), 1);
-    if (atom.implicitHydrogens !== 0) {
-      addTo(counts, HYDROGEN_KEY, atom.implicitHydrogens);
-    }
-  }
-  return counts;
-}
+export function nuclideCounts(species: Species): NuclideCounts {}
 
 /** Nuclei across a set of species. */
killedBy: nuclideCounts counts implicit hydrogens as real atoms
statusReason: expected undefined to deeply equal { C: 1, H: 4 }

[Killed] BlockStatement
src/bookkeeping.ts:47:37
  */
 export function nuclideCounts(species: Species): NuclideCounts {
   const counts: Record<string, number> = {};
-  for (const atom of species.atoms) {
-    addTo(counts, atomNuclideKey(atom), 1);
-    if (atom.implicitHydrogens !== 0) {
-      addTo(counts, HYDROGEN_KEY, atom.implicitHydrogens);
-    }
-  }
+  for (const atom of species.atoms) {}
   return counts;
 }
killedBy: nuclideCounts counts implicit hydrogens as real atoms
statusReason: expected {} to deeply equal { C: 1, H: 4 }

[Killed] ConditionalExpression
src/bookkeeping.ts:49:9
   const counts: Record<string, number> = {};
   for (const atom of species.atoms) {
     addTo(counts, atomNuclideKey(atom), 1);
-    if (atom.implicitHydrogens !== 0) {
+    if (true) {
       addTo(counts, HYDROGEN_KEY, atom.implicitHydrogens);
     }
killedBy: nuclideCounts does not add a hydrogen entry when there are none
statusReason: expected { Cl: 1, H: +0 } to deeply equal { Cl: 1 }

[Killed] BlockStatement
src/bookkeeping.ts:49:39
   const counts: Record<string, number> = {};
   for (const atom of species.atoms) {
     addTo(counts, atomNuclideKey(atom), 1);
-    if (atom.implicitHydrogens !== 0) {
-      addTo(counts, HYDROGEN_KEY, atom.implicitHydrogens);
-    }
+    if (atom.implicitHydrogens !== 0) {}
   }
   return counts;
killedBy: nuclideCounts counts implicit hydrogens as real atoms
statusReason: expected { C: 1 } to deeply equal { C: 1, H: 4 }

[Killed] BlockStatement
src/bookkeeping.ts:57:85
 }
 
 /** Nuclei across a set of species. */
-export function nuclideCountsOfMany(speciesList: readonly Species[]): NuclideCounts {
-  const counts: Record<string, number> = {};
-  for (const species of speciesList) {
-    for (const [key, value] of Object.entries(nuclideCounts(species))) {
-      addTo(counts, key, value);
-    }
-  }
-  return counts;
-}
+export function nuclideCountsOfMany(speciesList: readonly Species[]): NuclideCounts {}
 
 /**
killedBy: nuclideCountsOfMany adds the counts of every species rather than replacing them
statusReason: expected undefined to deeply equal { C: 2, H: 8 }

[Killed] BlockStatement
src/bookkeeping.ts:59:38
 /** Nuclei across a set of species. */
 export function nuclideCountsOfMany(speciesList: readonly Species[]): NuclideCounts {
   const counts: Record<string, number> = {};
-  for (const species of speciesList) {
-    for (const [key, value] of Object.entries(nuclideCounts(species))) {
-      addTo(counts, key, value);
-    }
-  }
+  for (const species of speciesList) {}
   return counts;
 }
killedBy: nuclideCountsOfMany adds the counts of every species rather than replacing them
statusReason: expected {} to deeply equal { C: 2, H: 8 }

[Killed] BlockStatement
src/bookkeeping.ts:60:72
 export function nuclideCountsOfMany(speciesList: readonly Species[]): NuclideCounts {
   const counts: Record<string, number> = {};
   for (const species of speciesList) {
-    for (const [key, value] of Object.entries(nuclideCounts(species))) {
-      addTo(counts, key, value);
-    }
+    for (const [key, value] of Object.entries(nuclideCounts(species))) {}
   }
   return counts;
killedBy: nuclideCountsOfMany adds the counts of every species rather than replacing them
statusReason: expected {} to deeply equal { C: 2, H: 8 }

[Killed] BlockStatement
src/bookkeeping.ts:74:59
  * and so a wildly wrong structure is obvious at a glance. Isotopes are counted
  * at their mass number, which is an approximation and is fine for a label.
  */
-export function approximateMass(species: Species): number {
-  let total = 0;
-  for (const atom of species.atoms) {
-    total +=
-      atom.isotope === undefined ? elementProperties(atom.element).standardAtomicWeight : atom.isotope;
-    total += atom.implicitHydrogens * elementProperties("H").standardAtomicWeight;
-  }
-  return total;
-}
+export function approximateMass(species: Species): number {}
 
 /**
killedBy: display helpers, which conservation must never use gives an approximate mass that includes implicit hydrogens
statusReason: expected undefined to be close to 16.043, received difference is NaN, but expected 5e-7

[Killed] BlockStatement
src/bookkeeping.ts:76:37
  */
 export function approximateMass(species: Species): number {
   let total = 0;
-  for (const atom of species.atoms) {
-    total +=
-      atom.isotope === undefined ? elementProperties(atom.element).standardAtomicWeight : atom.isotope;
-    total += atom.implicitHydrogens * elementProperties("H").standardAtomicWeight;
-  }
+  for (const atom of species.atoms) {}
   return total;
 }
killedBy: display helpers, which conservation must never use gives an approximate mass that includes implicit hydrogens
statusReason: expected +0 to be close to 16.043, received difference is 16.043, but expected 5e-7

[Killed] AssignmentOperator
src/bookkeeping.ts:77:5
 export function approximateMass(species: Species): number {
   let total = 0;
   for (const atom of species.atoms) {
-    total +=
-      atom.isotope === undefined ? elementProperties(atom.element).standardAtomicWeight : atom.isotope;
+    total -= atom.isotope === undefined ? elementProperties(atom.element).standardAtomicWeight : atom.isotope;
     total += atom.implicitHydrogens * elementProperties("H").standardAtomicWeight;
   }
killedBy: display helpers, which conservation must never use gives an approximate mass that includes implicit hydrogens
statusReason: expected -7.978999999999999 to be close to 16.043, received difference is 24.022, but expected 5e-7

[Killed] EqualityOperator
src/bookkeeping.ts:78:7
   let total = 0;
   for (const atom of species.atoms) {
     total +=
-      atom.isotope === undefined ? elementProperties(atom.element).standardAtomicWeight : atom.isotope;
+      atom.isotope !== undefined ? elementProperties(atom.element).standardAtomicWeight : atom.isotope;
     total += atom.implicitHydrogens * elementProperties("H").standardAtomicWeight;
   }
killedBy: display helpers, which conservation must never use gives an approximate mass that includes implicit hydrogens
statusReason: expected NaN to be close to 16.043, received difference is NaN, but expected 5e-7

[Killed] ConditionalExpression
src/bookkeeping.ts:78:7
   let total = 0;
   for (const atom of species.atoms) {
     total +=
-      atom.isotope === undefined ? elementProperties(atom.element).standardAtomicWeight : atom.isotope;
+      false ? elementProperties(atom.element).standardAtomicWeight : atom.isotope;
     total += atom.implicitHydrogens * elementProperties("H").standardAtomicWeight;
   }
killedBy: display helpers, which conservation must never use gives an approximate mass that includes implicit hydrogens
statusReason: expected NaN to be close to 16.043, received difference is NaN, but expected 5e-7

[Killed] ArithmeticOperator
src/bookkeeping.ts:79:14
   for (const atom of species.atoms) {
     total +=
       atom.isotope === undefined ? elementProperties(atom.element).standardAtomicWeight : atom.isotope;
-    total += atom.implicitHydrogens * elementProperties("H").standardAtomicWeight;
+    total += atom.implicitHydrogens / elementProperties("H").standardAtomicWeight;
   }
   return total;
killedBy: display helpers, which conservation must never use gives an approximate mass that includes implicit hydrogens
statusReason: expected 15.979253968253968 to be close to 16.043, received difference is 0.06374603174603166, but expected 5e-7

[Killed] AssignmentOperator
src/bookkeeping.ts:79:5
   for (const atom of species.atoms) {
     total +=
       atom.isotope === undefined ? elementProperties(atom.element).standardAtomicWeight : atom.isotope;
-    total += atom.implicitHydrogens * elementProperties("H").standardAtomicWeight;
+    total -= atom.implicitHydrogens * elementProperties("H").standardAtomicWeight;
   }
   return total;
killedBy: display helpers, which conservation must never use gives an approximate mass that includes implicit hydrogens
statusReason: expected 7.978999999999999 to be close to 16.043, received difference is 8.064, but expected 5e-7

[Killed] BlockStatement
src/bookkeeping.ts:89:60
  * alphabetically. Debug and display only. Isotopes are folded into their element
  * here, so it is not an identity.
  */
-export function molecularFormula(species: Species): string {
-  const counts: Record<string, number> = {};
-  for (const atom of species.atoms) {
-    addTo(counts, atom.element, 1);
-    if (atom.implicitHydrogens !== 0) {
-      addTo(counts, "H", atom.implicitHydrogens);
-    }
-  }
-
-  const symbols = Object.keys(counts).sort();
-  const ordered: string[] = [];
-  if (counts["C"] !== undefined) ordered.push("C");
-  if (counts["H"] !== undefined) ordered.push("H");
-  for (const symbol of symbols) {
-    if (symbol !== "C" && symbol !== "H") ordered.push(symbol);
-  }
-
-  return ordered
-    .map((symbol) => {
-      const count = counts[symbol] ?? 0;
-      return count === 1 ? symbol : `${symbol}${count}`;
-    })
-    .join("");
-}
+export function molecularFormula(species: Species): string {}
 
 /**
killedBy: display helpers, which conservation must never use writes a formula in Hill order, carbon then hydrogen then the rest
statusReason: expected undefined to be 'C3H6O' // Object.is equality

[Killed] BlockStatement
src/bookkeeping.ts:91:37
  */
 export function molecularFormula(species: Species): string {
   const counts: Record<string, number> = {};
-  for (const atom of species.atoms) {
-    addTo(counts, atom.element, 1);
-    if (atom.implicitHydrogens !== 0) {
-      addTo(counts, "H", atom.implicitHydrogens);
-    }
-  }
+  for (const atom of species.atoms) {}
 
   const symbols = Object.keys(counts).sort();
killedBy: display helpers, which conservation must never use writes a formula in Hill order, carbon then hydrogen then the rest
statusReason: expected '' to be 'C3H6O' // Object.is equality

[Killed] ConditionalExpression
src/bookkeeping.ts:93:9
   const counts: Record<string, number> = {};
   for (const atom of species.atoms) {
     addTo(counts, atom.element, 1);
-    if (atom.implicitHydrogens !== 0) {
+    if (false) {
       addTo(counts, "H", atom.implicitHydrogens);
     }
killedBy: display helpers, which conservation must never use writes a formula in Hill order, carbon then hydrogen then the rest
statusReason: expected 'C3O' to be 'C3H6O' // Object.is equality

[Killed] BlockStatement
src/bookkeeping.ts:93:39
   const counts: Record<string, number> = {};
   for (const atom of species.atoms) {
     addTo(counts, atom.element, 1);
-    if (atom.implicitHydrogens !== 0) {
-      addTo(counts, "H", atom.implicitHydrogens);
-    }
+    if (atom.implicitHydrogens !== 0) {}
   }
 
killedBy: display helpers, which conservation must never use writes a formula in Hill order, carbon then hydrogen then the rest
statusReason: expected 'C3O' to be 'C3H6O' // Object.is equality

[Killed] MethodExpression
src/bookkeeping.ts:98:19
     }
   }
 
-  const symbols = Object.keys(counts).sort();
+  const symbols = Object.keys(counts);
   const ordered: string[] = [];
   if (counts["C"] !== undefined) ordered.push("C");
killedBy: display helpers, which conservation must never use sorts the non carbon non hydrogen elements alphabetically
statusReason: expected 'SBrN' to be 'BrNS' // Object.is equality

[Killed] ConditionalExpression
src/bookkeeping.ts:100:7
 
   const symbols = Object.keys(counts).sort();
   const ordered: string[] = [];
-  if (counts["C"] !== undefined) ordered.push("C");
+  if (false) ordered.push("C");
   if (counts["H"] !== undefined) ordered.push("H");
   for (const symbol of symbols) {
killedBy: display helpers, which conservation must never use writes a formula in Hill order, carbon then hydrogen then the rest
statusReason: expected 'H6O' to be 'C3H6O' // Object.is equality

[Killed] EqualityOperator
src/bookkeeping.ts:100:7
 
   const symbols = Object.keys(counts).sort();
   const ordered: string[] = [];
-  if (counts["C"] !== undefined) ordered.push("C");
+  if (counts["C"] === undefined) ordered.push("C");
   if (counts["H"] !== undefined) ordered.push("H");
   for (const symbol of symbols) {
killedBy: display helpers, which conservation must never use writes a formula in Hill order, carbon then hydrogen then the rest
statusReason: expected 'H6O' to be 'C3H6O' // Object.is equality

[Killed] EqualityOperator
src/bookkeeping.ts:101:7
   const symbols = Object.keys(counts).sort();
   const ordered: string[] = [];
   if (counts["C"] !== undefined) ordered.push("C");
-  if (counts["H"] !== undefined) ordered.push("H");
+  if (counts["H"] === undefined) ordered.push("H");
   for (const symbol of symbols) {
     if (symbol !== "C" && symbol !== "H") ordered.push(symbol);
killedBy: display helpers, which conservation must never use writes a formula in Hill order, carbon then hydrogen then the rest
statusReason: expected 'C3O' to be 'C3H6O' // Object.is equality

[Killed] ConditionalExpression
src/bookkeeping.ts:101:7
   const symbols = Object.keys(counts).sort();
   const ordered: string[] = [];
   if (counts["C"] !== undefined) ordered.push("C");
-  if (counts["H"] !== undefined) ordered.push("H");
+  if (true) ordered.push("H");
   for (const symbol of symbols) {
     if (symbol !== "C" && symbol !== "H") ordered.push(symbol);
killedBy: display helpers, which conservation must never use sorts the non carbon non hydrogen elements alphabetically
statusReason: expected 'H0BrNS' to be 'BrNS' // Object.is equality

[Killed] BlockStatement
src/bookkeeping.ts:102:33
   const ordered: string[] = [];
   if (counts["C"] !== undefined) ordered.push("C");
   if (counts["H"] !== undefined) ordered.push("H");
-  for (const symbol of symbols) {
-    if (symbol !== "C" && symbol !== "H") ordered.push(symbol);
-  }
+  for (const symbol of symbols) {}
 
   return ordered
killedBy: display helpers, which conservation must never use writes a formula in Hill order, carbon then hydrogen then the rest
statusReason: expected 'C3H6' to be 'C3H6O' // Object.is equality

[Killed] ConditionalExpression
src/bookkeeping.ts:103:9
   if (counts["C"] !== undefined) ordered.push("C");
   if (counts["H"] !== undefined) ordered.push("H");
   for (const symbol of symbols) {
-    if (symbol !== "C" && symbol !== "H") ordered.push(symbol);
+    if (false) ordered.push(symbol);
   }
 
killedBy: display helpers, which conservation must never use writes a formula in Hill order, carbon then hydrogen then the rest
statusReason: expected 'C3H6' to be 'C3H6O' // Object.is equality

[Killed] ConditionalExpression
src/bookkeeping.ts:103:27
   if (counts["C"] !== undefined) ordered.push("C");
   if (counts["H"] !== undefined) ordered.push("H");
   for (const symbol of symbols) {
-    if (symbol !== "C" && symbol !== "H") ordered.push(symbol);
+    if (symbol !== "C" && true) ordered.push(symbol);
   }
 
killedBy: display helpers, which conservation must never use writes a formula in Hill order, carbon then hydrogen then the rest
statusReason: expected 'C3H6H6O' to be 'C3H6O' // Object.is equality

[Killed] BlockStatement
src/bookkeeping.ts:107:22
   }
 
   return ordered
-    .map((symbol) => {
-      const count = counts[symbol] ?? 0;
-      return count === 1 ? symbol : `${symbol}${count}`;
-    })
+    .map((symbol) => {})
     .join("");
 }
killedBy: display helpers, which conservation must never use writes a formula in Hill order, carbon then hydrogen then the rest
statusReason: expected '' to be 'C3H6O' // Object.is equality

[Killed] LogicalOperator
src/bookkeeping.ts:108:21
 
   return ordered
     .map((symbol) => {
-      const count = counts[symbol] ?? 0;
+      const count = counts[symbol] && 0;
       return count === 1 ? symbol : `${symbol}${count}`;
     })
killedBy: display helpers, which conservation must never use writes a formula in Hill order, carbon then hydrogen then the rest
statusReason: expected 'C0H0O0' to be 'C3H6O' // Object.is equality

[Killed] ConditionalExpression
src/bookkeeping.ts:109:14
   return ordered
     .map((symbol) => {
       const count = counts[symbol] ?? 0;
-      return count === 1 ? symbol : `${symbol}${count}`;
+      return true ? symbol : `${symbol}${count}`;
     })
     .join("");
killedBy: display helpers, which conservation must never use writes a formula in Hill order, carbon then hydrogen then the rest
statusReason: expected 'CHO' to be 'C3H6O' // Object.is equality

[Killed] ConditionalExpression
src/bookkeeping.ts:109:14
   return ordered
     .map((symbol) => {
       const count = counts[symbol] ?? 0;
-      return count === 1 ? symbol : `${symbol}${count}`;
+      return false ? symbol : `${symbol}${count}`;
     })
     .join("");
killedBy: display helpers, which conservation must never use writes a formula in Hill order, carbon then hydrogen then the rest
statusReason: expected 'C3H6O1' to be 'C3H6O' // Object.is equality

[Killed] BlockStatement
src/bookkeeping.ts:120:74
  * Forgetting the implicit hydrogen term here makes every methyl group look like
  * a carbanion, so it is folded in rather than left to the caller.
  */
-export function bondOrderSumAt(species: Species, atomId: AtomId): number {
-  const atom = requireAtom(species, atomId);
-  let total = atom.implicitHydrogens;
-  for (const bond of bondsAt(species, atomId)) {
-    total += bond.order;
-  }
-  return total;
-}
+export function bondOrderSumAt(species: Species, atomId: AtomId): number {}
 
 /**
killedBy: bondOrderSumAt counts implicit hydrogens as order one bonds
statusReason: expected undefined to be 4 // Object.is equality

[Killed] BlockStatement
src/bookkeeping.ts:123:48
 export function bondOrderSumAt(species: Species, atomId: AtomId): number {
   const atom = requireAtom(species, atomId);
   let total = atom.implicitHydrogens;
-  for (const bond of bondsAt(species, atomId)) {
-    total += bond.order;
-  }
+  for (const bond of bondsAt(species, atomId)) {}
   return total;
 }
killedBy: bondOrderSumAt counts a double bond as two
statusReason: expected +0 to be 4 // Object.is equality

[Killed] AssignmentOperator
src/bookkeeping.ts:124:5
   const atom = requireAtom(species, atomId);
   let total = atom.implicitHydrogens;
   for (const bond of bondsAt(species, atomId)) {
-    total += bond.order;
+    total -= bond.order;
   }
   return total;
killedBy: bondOrderSumAt counts a double bond as two
statusReason: expected -4 to be 4 // Object.is equality

[Killed] BlockStatement
src/bookkeeping.ts:138:79
  * `formal_charge_disagrees_with_structure` is the named cause. This function
  * reports the number; it does not decide which is at fault.
  */
-export function derivedFormalCharge(species: Species, atomId: AtomId): number {
-  const atom = requireAtom(species, atomId);
-  const properties = elementProperties(atom.element);
-  return properties.valenceElectrons - nonbondingElectrons(atom) - bondOrderSumAt(species, atomId);
-}
+export function derivedFormalCharge(species: Species, atomId: AtomId): number {}
 
 /**
killedBy: derivedFormalCharge is zero on a neutral carbon with four bonds
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/bookkeeping.ts:141:10
 export function derivedFormalCharge(species: Species, atomId: AtomId): number {
   const atom = requireAtom(species, atomId);
   const properties = elementProperties(atom.element);
-  return properties.valenceElectrons - nonbondingElectrons(atom) - bondOrderSumAt(species, atomId);
+  return properties.valenceElectrons + nonbondingElectrons(atom) - bondOrderSumAt(species, atomId);
 }
 
killedBy: derivedFormalCharge is minus one on hydroxide oxygen
statusReason: expected 11 to be -1 // Object.is equality

[Killed] ArithmeticOperator
src/bookkeeping.ts:141:10
 export function derivedFormalCharge(species: Species, atomId: AtomId): number {
   const atom = requireAtom(species, atomId);
   const properties = elementProperties(atom.element);
-  return properties.valenceElectrons - nonbondingElectrons(atom) - bondOrderSumAt(species, atomId);
+  return properties.valenceElectrons - nonbondingElectrons(atom) + bondOrderSumAt(species, atomId);
 }
 
killedBy: derivedFormalCharge is zero on a neutral carbon with four bonds
statusReason: expected 8 to be +0 // Object.is equality

[Killed] BlockStatement
src/bookkeeping.ts:152:82
  * different questions and mixing them up is a classic source of a check that
  * fires on correct structures.
  */
-export function valenceElectronsAround(species: Species, atomId: AtomId): number {
-  const atom = requireAtom(species, atomId);
-  return nonbondingElectrons(atom) + bondOrderSumAt(species, atomId) * 2;
-}
+export function valenceElectronsAround(species: Species, atomId: AtomId): number {}
 
 /** Declared charge on a species: the sum of its atoms' declared formal charges. */
killedBy: valenceElectronsAround counts bonding electrons in full at both ends, the octet convention
statusReason: expected undefined to be 8 // Object.is equality

[Killed] ArithmeticOperator
src/bookkeeping.ts:154:10
  */
 export function valenceElectronsAround(species: Species, atomId: AtomId): number {
   const atom = requireAtom(species, atomId);
-  return nonbondingElectrons(atom) + bondOrderSumAt(species, atomId) * 2;
+  return nonbondingElectrons(atom) - bondOrderSumAt(species, atomId) * 2;
 }
 
killedBy: valenceElectronsAround counts bonding electrons in full at both ends, the octet convention
statusReason: expected -8 to be 8 // Object.is equality

[Killed] ArithmeticOperator
src/bookkeeping.ts:154:38
  */
 export function valenceElectronsAround(species: Species, atomId: AtomId): number {
   const atom = requireAtom(species, atomId);
-  return nonbondingElectrons(atom) + bondOrderSumAt(species, atomId) * 2;
+  return nonbondingElectrons(atom) + bondOrderSumAt(species, atomId) / 2;
 }
 
killedBy: valenceElectronsAround counts bonding electrons in full at both ends, the octet convention
statusReason: expected 2 to be 8 // Object.is equality

[Killed] BlockStatement
src/bookkeeping.ts:158:57
 }
 
 /** Declared charge on a species: the sum of its atoms' declared formal charges. */
-export function speciesCharge(species: Species): number {
-  return species.atoms.reduce((total, atom) => total + atom.formalCharge, 0);
-}
+export function speciesCharge(species: Species): number {}
 
 /**
killedBy: speciesCharge sums declared formal charges
statusReason: expected undefined to be -1 // Object.is equality

[Killed] ArithmeticOperator
src/bookkeeping.ts:159:48
 
 /** Declared charge on a species: the sum of its atoms' declared formal charges. */
 export function speciesCharge(species: Species): number {
-  return species.atoms.reduce((total, atom) => total + atom.formalCharge, 0);
+  return species.atoms.reduce((total, atom) => total - atom.formalCharge, 0);
 }
 
killedBy: speciesCharge sums declared formal charges
statusReason: expected 1 to be -1 // Object.is equality

[Killed] ArrowFunction
src/bookkeeping.ts:159:31
 
 /** Declared charge on a species: the sum of its atoms' declared formal charges. */
 export function speciesCharge(species: Species): number {
-  return species.atoms.reduce((total, atom) => total + atom.formalCharge, 0);
+  return species.atoms.reduce(() => undefined, 0);
 }
 
killedBy: speciesCharge sums declared formal charges
statusReason: expected undefined to be -1 // Object.is equality

[Killed] BlockStatement
src/bookkeeping.ts:169:64
  * A positive charge means one electron fewer than the neutral atoms would have
  * had, which is why charge is subtracted.
  */
-export function valenceElectronCount(species: Species): number {
-  let total = 0;
-  for (const atom of species.atoms) {
-    total += elementProperties(atom.element).valenceElectrons;
-    total += atom.implicitHydrogens * elementProperties("H").valenceElectrons;
-  }
-  return total - speciesCharge(species);
-}
+export function valenceElectronCount(species: Species): number {}
 
 /**
killedBy: valenceElectronCount counts an implicit hydrogen's electron
statusReason: expected undefined to be 8 // Object.is equality

[Killed] BlockStatement
src/bookkeeping.ts:171:37
  */
 export function valenceElectronCount(species: Species): number {
   let total = 0;
-  for (const atom of species.atoms) {
-    total += elementProperties(atom.element).valenceElectrons;
-    total += atom.implicitHydrogens * elementProperties("H").valenceElectrons;
-  }
+  for (const atom of species.atoms) {}
   return total - speciesCharge(species);
 }
killedBy: valenceElectronCount counts an implicit hydrogen's electron
statusReason: expected +0 to be 8 // Object.is equality

[Killed] AssignmentOperator
src/bookkeeping.ts:172:5
 export function valenceElectronCount(species: Species): number {
   let total = 0;
   for (const atom of species.atoms) {
-    total += elementProperties(atom.element).valenceElectrons;
+    total -= elementProperties(atom.element).valenceElectrons;
     total += atom.implicitHydrogens * elementProperties("H").valenceElectrons;
   }
killedBy: valenceElectronCount counts an implicit hydrogen's electron
statusReason: expected +0 to be 8 // Object.is equality

[Killed] AssignmentOperator
src/bookkeeping.ts:173:5
   let total = 0;
   for (const atom of species.atoms) {
     total += elementProperties(atom.element).valenceElectrons;
-    total += atom.implicitHydrogens * elementProperties("H").valenceElectrons;
+    total -= atom.implicitHydrogens * elementProperties("H").valenceElectrons;
   }
   return total - speciesCharge(species);
killedBy: valenceElectronCount counts an implicit hydrogen's electron
statusReason: expected +0 to be 8 // Object.is equality

[Survived] ArithmeticOperator
src/bookkeeping.ts:173:14
   let total = 0;
   for (const atom of species.atoms) {
     total += elementProperties(atom.element).valenceElectrons;
-    total += atom.implicitHydrogens * elementProperties("H").valenceElectrons;
+    total += atom.implicitHydrogens / elementProperties("H").valenceElectrons;
   }
   return total - speciesCharge(species);

[Killed] ArithmeticOperator
src/bookkeeping.ts:175:10
     total += elementProperties(atom.element).valenceElectrons;
     total += atom.implicitHydrogens * elementProperties("H").valenceElectrons;
   }
-  return total - speciesCharge(species);
+  return total + speciesCharge(species);
 }
 
killedBy: valenceElectronCount subtracts the charge, so a cation has one electron fewer
statusReason: expected 8 to be 6 // Object.is equality

[Killed] BlockStatement
src/bookkeeping.ts:202:20
 export function conservedTotals(
   state: MechanismState,
   options: ConservedTotalsOptions = {},
-): ConservedTotals {
-  const members = options.includeSpectators === true ? state.members : participatingMembers(state);
-  const speciesList = members.map((member) => member.species);
-
-  let charge = 0;
-  let electrons = 0;
-  for (const species of speciesList) {
-    charge += speciesCharge(species);
-    electrons += valenceElectronCount(species);
-  }
-
-  return Object.freeze({
-    nuclides: nuclideCountsOfMany(speciesList),
-    charge,
-    valenceElectrons: electrons,
-    countedSpeciesIds: Object.freeze(speciesList.map((species) => species.id)),
-  });
-}
+): ConservedTotals {}
 
 /**
killedBy: conservedTotals excludes spectators by default, which is what declaring one means
statusReason: Cannot read properties of undefined (reading 'countedSpeciesIds')
