[Killed] ConditionalExpression
src/bookkeeping.ts:203:19
   state: MechanismState,
   options: ConservedTotalsOptions = {},
 ): ConservedTotals {
-  const members = options.includeSpectators === true ? state.members : participatingMembers(state);
+  const members = true ? state.members : participatingMembers(state);
   const speciesList = members.map((member) => member.species);
 
killedBy: conservedTotals excludes spectators by default, which is what declaring one means
statusReason: expected [ 'sp-chloromethane', 'sp-sodium' ] to deeply equal [ 'sp-chloromethane' ]

[Killed] BooleanLiteral
src/bookkeeping.ts:203:49
   state: MechanismState,
   options: ConservedTotalsOptions = {},
 ): ConservedTotals {
-  const members = options.includeSpectators === true ? state.members : participatingMembers(state);
+  const members = options.includeSpectators === false ? state.members : participatingMembers(state);
   const speciesList = members.map((member) => member.species);
 
killedBy: conservedTotals includes spectators when asked, which is what an adversary wants
statusReason: expected [ 'sp-chloromethane' ] to deeply equal [ 'sp-chloromethane', 'sp-sodium' ]

[Killed] ArrowFunction
src/bookkeeping.ts:204:35
   options: ConservedTotalsOptions = {},
 ): ConservedTotals {
   const members = options.includeSpectators === true ? state.members : participatingMembers(state);
-  const speciesList = members.map((member) => member.species);
+  const speciesList = members.map(() => undefined);
 
   let charge = 0;
killedBy: conservedTotals excludes spectators by default, which is what declaring one means
statusReason: Cannot read properties of undefined (reading 'atoms')

[Killed] BlockStatement
src/bookkeeping.ts:208:38
 
   let charge = 0;
   let electrons = 0;
-  for (const species of speciesList) {
-    charge += speciesCharge(species);
-    electrons += valenceElectronCount(species);
-  }
+  for (const species of speciesList) {}
 
   return Object.freeze({
killedBy: conservedTotals includes spectators when asked, which is what an adversary wants
statusReason: expected +0 to be 1 // Object.is equality

[Killed] AssignmentOperator
src/bookkeeping.ts:209:5
   let charge = 0;
   let electrons = 0;
   for (const species of speciesList) {
-    charge += speciesCharge(species);
+    charge -= speciesCharge(species);
     electrons += valenceElectronCount(species);
   }
killedBy: conservedTotals includes spectators when asked, which is what an adversary wants
statusReason: expected -1 to be 1 // Object.is equality

[Killed] AssignmentOperator
src/bookkeeping.ts:210:5
   let electrons = 0;
   for (const species of speciesList) {
     charge += speciesCharge(species);
-    electrons += valenceElectronCount(species);
+    electrons -= valenceElectronCount(species);
   }
 
killedBy: conservedTotals sums charge and electrons across the whole multiset
statusReason: expected -22 to be 22 // Object.is equality

[Killed] ArrowFunction
src/bookkeeping.ts:217:54
     nuclides: nuclideCountsOfMany(speciesList),
     charge,
     valenceElectrons: electrons,
-    countedSpeciesIds: Object.freeze(speciesList.map((species) => species.id)),
+    countedSpeciesIds: Object.freeze(speciesList.map(() => undefined)),
   });
 }
killedBy: conservedTotals excludes spectators by default, which is what declaring one means
statusReason: expected [ undefined ] to deeply equal [ 'sp-chloromethane' ]

[Killed] BlockStatement
src/bookkeeping.ts:227:95
  * Returned as a difference rather than a boolean so a failure can say "one
  * hydrogen short" instead of "mass not conserved".
  */
-export function nuclideDifference(before: NuclideCounts, after: NuclideCounts): NuclideCounts {
-  const difference: Record<string, number> = {};
-  const keys = new Set<string>([...Object.keys(before), ...Object.keys(after)]);
-  for (const key of keys) {
-    const delta = (after[key] ?? 0) - (before[key] ?? 0);
-    if (delta !== 0) {
-      difference[key] = delta;
-    }
-  }
-  return difference;
-}
+export function nuclideDifference(before: NuclideCounts, after: NuclideCounts): NuclideCounts {}
 
 /** Convenience for reading an atom's nuclide key without a species lookup. */
killedBy: nuclideDifference is empty when the two multisets match exactly
statusReason: expected undefined to deeply equal {}

[Killed] ArrayDeclaration
src/bookkeeping.ts:229:32
  */
 export function nuclideDifference(before: NuclideCounts, after: NuclideCounts): NuclideCounts {
   const difference: Record<string, number> = {};
-  const keys = new Set<string>([...Object.keys(before), ...Object.keys(after)]);
+  const keys = new Set<string>([]);
   for (const key of keys) {
     const delta = (after[key] ?? 0) - (before[key] ?? 0);
killedBy: nuclideDifference reports the signed change, after minus before
statusReason: expected {} to deeply equal { H: -1 }

[Killed] BlockStatement
src/bookkeeping.ts:230:27
 export function nuclideDifference(before: NuclideCounts, after: NuclideCounts): NuclideCounts {
   const difference: Record<string, number> = {};
   const keys = new Set<string>([...Object.keys(before), ...Object.keys(after)]);
-  for (const key of keys) {
-    const delta = (after[key] ?? 0) - (before[key] ?? 0);
-    if (delta !== 0) {
-      difference[key] = delta;
-    }
-  }
+  for (const key of keys) {}
   return difference;
 }
killedBy: nuclideDifference reports the signed change, after minus before
statusReason: expected {} to deeply equal { H: -1 }

[Killed] LogicalOperator
src/bookkeeping.ts:231:40
   const difference: Record<string, number> = {};
   const keys = new Set<string>([...Object.keys(before), ...Object.keys(after)]);
   for (const key of keys) {
-    const delta = (after[key] ?? 0) - (before[key] ?? 0);
+    const delta = (after[key] ?? 0) - (before[key] && 0);
     if (delta !== 0) {
       difference[key] = delta;
killedBy: nuclideDifference is empty when the two multisets match exactly
statusReason: expected { C: 1, H: 4 } to deeply equal {}

[Killed] ArithmeticOperator
src/bookkeeping.ts:231:19
   const difference: Record<string, number> = {};
   const keys = new Set<string>([...Object.keys(before), ...Object.keys(after)]);
   for (const key of keys) {
-    const delta = (after[key] ?? 0) - (before[key] ?? 0);
+    const delta = (after[key] ?? 0) + (before[key] ?? 0);
     if (delta !== 0) {
       difference[key] = delta;
killedBy: nuclideDifference is empty when the two multisets match exactly
statusReason: expected { C: 2, H: 8 } to deeply equal {}

[Killed] EqualityOperator
src/bookkeeping.ts:232:9
   const keys = new Set<string>([...Object.keys(before), ...Object.keys(after)]);
   for (const key of keys) {
     const delta = (after[key] ?? 0) - (before[key] ?? 0);
-    if (delta !== 0) {
+    if (delta === 0) {
       difference[key] = delta;
     }
killedBy: nuclideDifference is empty when the two multisets match exactly
statusReason: expected { C: +0, H: +0 } to deeply equal {}

[Killed] BlockStatement
src/bookkeeping.ts:232:22
   const keys = new Set<string>([...Object.keys(before), ...Object.keys(after)]);
   for (const key of keys) {
     const delta = (after[key] ?? 0) - (before[key] ?? 0);
-    if (delta !== 0) {
-      difference[key] = delta;
-    }
+    if (delta !== 0) {}
   }
   return difference;
killedBy: nuclideDifference reports the signed change, after minus before
statusReason: expected {} to deeply equal { H: -1 }

[Killed] BlockStatement
src/bookkeeping.ts:240:45
 }
 
 /** Convenience for reading an atom's nuclide key without a species lookup. */
-export function atomKey(atom: Atom): string {
-  return atomNuclideKey(atom);
-}
+export function atomKey(atom: Atom): string {}
 
killedBy: atomKey is the atom's nuclide key
statusReason: expected undefined to be 'C' // Object.is equality
