[Killed] BlockStatement
src/causes.ts:144:20
   appliesTo: readonly ResolutionKind[],
   summary: string,
   teaches: string,
-): CauseDefinition {
-  return Object.freeze({ id, category, severity, appliesTo, summary, teaches });
-}
+): CauseDefinition {}
 
 const BLOCKING: readonly ResolutionKind[] = Object.freeze(["invalid"]);
killedBy: primaryCauseIsConsistent accepts each outcome's own success cause
statusReason: Unknown cause id: matches_requested_route

[Killed] ObjectLiteral
src/causes.ts:145:24
   summary: string,
   teaches: string,
 ): CauseDefinition {
-  return Object.freeze({ id, category, severity, appliesTo, summary, teaches });
+  return Object.freeze({});
 }
 
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected undefined to be 'matches_requested_route' // Object.is equality

[Killed] ArrayDeclaration
src/causes.ts:148:59
   return Object.freeze({ id, category, severity, appliesTo, summary, teaches });
 }
 
-const BLOCKING: readonly ResolutionKind[] = Object.freeze(["invalid"]);
+const BLOCKING: readonly ResolutionKind[] = Object.freeze([]);
 const ANY_VALID: readonly ResolutionKind[] = Object.freeze([
   "correct",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:148:60
   return Object.freeze({ id, category, severity, appliesTo, summary, teaches });
 }
 
-const BLOCKING: readonly ResolutionKind[] = Object.freeze(["invalid"]);
+const BLOCKING: readonly ResolutionKind[] = Object.freeze([""]);
 const ANY_VALID: readonly ResolutionKind[] = Object.freeze([
   "correct",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'correct', …(3) ] to include ''

[Killed] ArrayDeclaration
src/causes.ts:149:60
 }
 
 const BLOCKING: readonly ResolutionKind[] = Object.freeze(["invalid"]);
-const ANY_VALID: readonly ResolutionKind[] = Object.freeze([
-  "correct",
-  "correct_alternative_route",
-  "valid_not_requested",
-]);
+const ANY_VALID: readonly ResolutionKind[] = Object.freeze([]);
 const ANYWHERE: readonly ResolutionKind[] = Object.freeze([
   "correct",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:150:3
 
 const BLOCKING: readonly ResolutionKind[] = Object.freeze(["invalid"]);
 const ANY_VALID: readonly ResolutionKind[] = Object.freeze([
-  "correct",
+  "",
   "correct_alternative_route",
   "valid_not_requested",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'correct', …(3) ] to include ''

[Killed] StringLiteral
src/causes.ts:151:3
 const BLOCKING: readonly ResolutionKind[] = Object.freeze(["invalid"]);
 const ANY_VALID: readonly ResolutionKind[] = Object.freeze([
   "correct",
-  "correct_alternative_route",
+  "",
   "valid_not_requested",
 ]);
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'correct', …(3) ] to include ''

[Killed] ArrayDeclaration
src/causes.ts:154:59
   "correct_alternative_route",
   "valid_not_requested",
 ]);
-const ANYWHERE: readonly ResolutionKind[] = Object.freeze([
-  "correct",
-  "correct_alternative_route",
-  "valid_not_requested",
-  "invalid",
-]);
+const ANYWHERE: readonly ResolutionKind[] = Object.freeze([]);
 
 export const CAUSES: Readonly<Record<CauseId, CauseDefinition>> = Object.freeze({
killedBy: primaryCauseIsConsistent accepts an advisory cause as the primary cause where the registry allows it
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/causes.ts:166:6
     "matches_requested_route",
     "success",
     "informational",
-    ["correct"],
+    [""],
     "This is the requested mechanism, drawn correctly.",
     "Every arrow starts on electron density and ends where those electrons go, and mass, charge, and electron count all balance across the step.",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'correct', …(3) ] to include ''

[Killed] StringLiteral
src/causes.ts:167:5
     "success",
     "informational",
     ["correct"],
-    "This is the requested mechanism, drawn correctly.",
+    "",
     "Every arrow starts on electron density and ends where those electrons go, and mass, charge, and electron count all balance across the step.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:172:5
   ),
   alternative_route_same_product: define(
     "alternative_route_same_product",
-    "success",
+    "",
     "informational",
     ["correct_alternative_route"],
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:174:6
     "alternative_route_same_product",
     "success",
     "informational",
-    ["correct_alternative_route"],
+    [""],
     "This reaches the same product by a different valid route.",
     "More than one mechanism can give the same product. The route you drew is chemically sound; the question was aiming at a different one, and both are worth being able to draw.",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'correct', …(3) ] to include ''

[Killed] ArrayDeclaration
src/causes.ts:182:5
     "valid_transformation_not_requested",
     "success",
     "informational",
-    ["valid_not_requested"],
+    [],
     "This is sound chemistry, but it is a different transformation from the one asked for.",
     "Nothing here is impossible. The product you built is not the product the question wanted, which usually means a different site was attacked or a different competing pathway was followed.",
killedBy: primaryCauseIsConsistent accepts each outcome's own success cause
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/causes.ts:192:5
     "valence",
     "blocking",
     BLOCKING,
-    "An atom has more bonds than it can hold.",
+    "",
     "Bonding capacity follows from the number of valence orbitals. Carbon has four; a fifth bond has no orbital to live in.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:193:5
     "blocking",
     BLOCKING,
     "An atom has more bonds than it can hold.",
-    "Bonding capacity follows from the number of valence orbitals. Carbon has four; a fifth bond has no orbital to live in.",
+    "",
   ),
   octet_expanded_on_period_two: define(
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:197:5
   ),
   octet_expanded_on_period_two: define(
     "octet_expanded_on_period_two",
-    "valence",
+    "",
     "blocking",
     BLOCKING,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:200:5
     "valence",
     "blocking",
     BLOCKING,
-    "A period two atom has more than eight valence electrons around it.",
+    "",
     "Nitrogen and oxygen have no d orbitals available, so they cannot expand past an octet. Sulfur and phosphorus can, which is why the same drawing is fine one row down.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:205:5
   ),
   impossible_hydrogen_count: define(
     "impossible_hydrogen_count",
-    "valence",
+    "",
     "blocking",
     BLOCKING,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:208:5
     "valence",
     "blocking",
     BLOCKING,
-    "An atom has a negative or impossible number of hydrogens.",
+    "",
     "Implicit hydrogens are real atoms that simply are not drawn. Removing more than are there is not a shorthand, it is a missing atom.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:216:5
     "valence",
     "blocking",
     BLOCKING,
-    "The charge written on an atom does not match the electrons drawn around it.",
+    "",
     "Formal charge is valence electrons minus nonbonding electrons minus bonds. It is not a label chosen separately from the structure; it is read off it.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:217:5
     "blocking",
     BLOCKING,
     "The charge written on an atom does not match the electrons drawn around it.",
-    "Formal charge is valence electrons minus nonbonding electrons minus bonds. It is not a label chosen separately from the structure; it is read off it.",
+    "",
   ),
   electron_count_not_integral: define(
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:220:5
     "Formal charge is valence electrons minus nonbonding electrons minus bonds. It is not a label chosen separately from the structure; it is read off it.",
   ),
   electron_count_not_integral: define(
-    "electron_count_not_integral",
+    "",
     "valence",
     "blocking",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected '' to be 'electron_count_not_integral' // Object.is equality

[Killed] StringLiteral
src/causes.ts:224:5
     "valence",
     "blocking",
     BLOCKING,
-    "An atom ends up with a fractional number of electrons.",
+    "",
     "Half arrows come in pairs. A single fishhook that is not matched by another leaves half an electron somewhere, which means one of the two is missing.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:225:5
     "blocking",
     BLOCKING,
     "An atom ends up with a fractional number of electrons.",
-    "Half arrows come in pairs. A single fishhook that is not matched by another leaves half an electron somewhere, which means one of the two is missing.",
+    "",
   ),
 
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:229:5
   ),
 
   mass_not_conserved: define(
-    "mass_not_conserved",
+    "",
     "conservation",
     "blocking",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected '' to be 'mass_not_conserved' // Object.is equality

[Killed] StringLiteral
src/causes.ts:234:5
     "blocking",
     BLOCKING,
     "Atoms appear or disappear across this step.",
-    "Every atom on the left is on the right. If a proton left, something in the flask is holding it now, and that something has to be drawn.",
+    "",
   ),
   charge_not_conserved: define(
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:241:5
     "conservation",
     "blocking",
     BLOCKING,
-    "Total charge changes across this step.",
+    "",
     "Charge is conserved over everything present, not over one molecule. A protonation looks like it creates charge only when the acid that supplied the proton is left out of the picture.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:246:5
   ),
   electron_count_not_conserved: define(
     "electron_count_not_conserved",
-    "conservation",
+    "",
     "blocking",
     BLOCKING,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:247:5
   electron_count_not_conserved: define(
     "electron_count_not_conserved",
     "conservation",
-    "blocking",
+    "",
     BLOCKING,
     "Valence electrons are created or destroyed across this step.",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'blocking', 'advisory', …(1) ] to include ''

[Killed] StringLiteral
src/causes.ts:254:5
   ),
   proton_source_not_in_state: define(
     "proton_source_not_in_state",
-    "conservation",
+    "",
     "blocking",
     BLOCKING,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:261:5
     "A species that is not in the flask cannot donate anything. If the acid is implied by the conditions, it still has to be drawn as a participant before it can hand over a proton.",
   ),
   proton_sink_not_in_state: define(
-    "proton_sink_not_in_state",
+    "",
     "conservation",
     "blocking",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected '' to be 'proton_sink_not_in_state' // Object.is equality

[Killed] StringLiteral
src/causes.ts:262:5
   ),
   proton_sink_not_in_state: define(
     "proton_sink_not_in_state",
-    "conservation",
+    "",
     "blocking",
     BLOCKING,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:277:5
     "Every species in the product state either came through the step or was already present. New reagents mid mechanism are a new step, not a silent addition.",
   ),
   species_disappeared_without_sink: define(
-    "species_disappeared_without_sink",
+    "",
     "conservation",
     "blocking",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected '' to be 'species_disappeared_without_sink' // Object.is equality

[Killed] StringLiteral
src/causes.ts:278:5
   ),
   species_disappeared_without_sink: define(
     "species_disappeared_without_sink",
-    "conservation",
+    "",
     "blocking",
     BLOCKING,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:281:5
     "conservation",
     "blocking",
     BLOCKING,
-    "A molecule vanishes without reacting.",
+    "",
     "Leaving groups leave, they do not evaporate. If it is no longer part of anything, it is still a species in the flask.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:282:5
     "blocking",
     BLOCKING,
     "A molecule vanishes without reacting.",
-    "Leaving groups leave, they do not evaporate. If it is no longer part of anything, it is still a species in the flask.",
+    "",
   ),
   spectator_changed_during_step: define(
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:285:5
     "Leaving groups leave, they do not evaporate. If it is no longer part of anything, it is still a species in the flask.",
   ),
   spectator_changed_during_step: define(
-    "spectator_changed_during_step",
+    "",
     "conservation",
     "blocking",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected '' to be 'spectator_changed_during_step' // Object.is equality

[Killed] StringLiteral
src/causes.ts:289:5
     "conservation",
     "blocking",
     BLOCKING,
-    "A species declared a spectator took part in the step.",
+    "",
     "A spectator is excluded from conservation on the promise that it does not change. The moment it changes, that promise is what is wrong, not the arithmetic.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:297:5
     "conservation",
     "blocking",
     BLOCKING,
-    "A species is excluded from conservation with no recorded reason.",
+    "",
     "Excluding something from the books is a decision. It gets a named reason and an author, so it can be argued with later.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:305:5
     "conservation",
     "blocking",
     BLOCKING,
-    "An undrawn hydrogen count changed and no arrow accounts for it.",
+    "",
     "Implicit hydrogens are a drawing convenience, not an exemption. A proton that moves has to be moved by an arrow like every other atom.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:310:5
   ),
   duplicate_species_id_in_state: define(
     "duplicate_species_id_in_state",
-    "conservation",
+    "",
     "blocking",
     BLOCKING,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:313:5
     "conservation",
     "blocking",
     BLOCKING,
-    "Two different molecules in this state carry the same name.",
+    "",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:320:5
   arrow_source_has_no_electrons: define(
     "arrow_source_has_no_electrons",
     "electron_flow",
-    "blocking",
+    "",
     BLOCKING,
     "This arrow starts somewhere with no electrons to give.",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'blocking', 'advisory', …(1) ] to include ''

[Killed] StringLiteral
src/causes.ts:322:5
     "electron_flow",
     "blocking",
     BLOCKING,
-    "This arrow starts somewhere with no electrons to give.",
+    "",
     "Arrows begin at electron density: a lone pair, or a bond. An arrow starting at an empty orbital or at a positive charge has nothing to move.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:330:5
     "electron_flow",
     "blocking",
     BLOCKING,
-    "This arrow ends somewhere that cannot take more electrons.",
+    "",
     "An atom with a full octet and no leaving group takes nothing. Either something leaves at the same time, or the electrons have nowhere to go.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:331:5
     "blocking",
     BLOCKING,
     "This arrow ends somewhere that cannot take more electrons.",
-    "An atom with a full octet and no leaving group takes nothing. Either something leaves at the same time, or the electrons have nowhere to go.",
+    "",
   ),
   arrow_drawn_backwards: define(
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:335:5
   ),
   arrow_drawn_backwards: define(
     "arrow_drawn_backwards",
-    "electron_flow",
+    "",
     "blocking",
     BLOCKING,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:347:5
     "blocking",
     BLOCKING,
     "The arrows do not add up to the structural change they claim to explain.",
-    "The change from one structure to the next is fully determined by the arrows. When the two disagree, one of them is the record of what actually happened and the other is a guess.",
+    "",
   ),
   arrow_endpoint_not_in_state: define(
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:350:5
     "The change from one structure to the next is fully determined by the arrows. When the two disagree, one of them is the record of what actually happened and the other is a guess.",
   ),
   arrow_endpoint_not_in_state: define(
-    "arrow_endpoint_not_in_state",
+    "",
     "electron_flow",
     "blocking",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected '' to be 'arrow_endpoint_not_in_state' // Object.is equality

[Killed] StringLiteral
src/causes.ts:351:5
   ),
   arrow_endpoint_not_in_state: define(
     "arrow_endpoint_not_in_state",
-    "electron_flow",
+    "",
     "blocking",
     BLOCKING,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:354:5
     "electron_flow",
     "blocking",
     BLOCKING,
-    "An arrow points at an atom or bond that is not in this structure.",
+    "",
     "Arrows are anchored to specific atoms, not to positions on the page. An endpoint that names nothing usually means the structure was redrawn and the arrow was left behind.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:370:5
     "electron_flow",
     "blocking",
     BLOCKING,
-    "Too much is happening at one atom in a single step.",
+    "",
     "One elementary step passes through one transition state. When three or more independent changes pile onto one centre, it is really several steps drawn on top of each other.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:386:5
     "electron_flow",
     "blocking",
     BLOCKING,
-    "This arrow moves electrons between two places that never touch.",
+    "",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:399:5
   ),
 
   sn2_did_not_invert: define(
-    "sn2_did_not_invert",
+    "",
     "stereochemistry",
     "blocking",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected '' to be 'sn2_did_not_invert' // Object.is equality

[Killed] StringLiteral
src/causes.ts:401:5
   sn2_did_not_invert: define(
     "sn2_did_not_invert",
     "stereochemistry",
-    "blocking",
+    "",
     BLOCKING,
     "The SN2 centre kept its configuration.",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'blocking', 'advisory', …(1) ] to include ''

[Killed] StringLiteral
src/causes.ts:408:5
   ),
   addition_face_wrong: define(
     "addition_face_wrong",
-    "stereochemistry",
+    "",
     "blocking",
     BLOCKING,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:419:5
     "stereochemistry",
     "blocking",
     BLOCKING,
-    "The proton and the leaving group are not in the same plane.",
+    "",
     "E2 forms a pi bond as the two sigma bonds break, so those two bonds have to be aligned with the developing p orbitals. Near zero or near one hundred and eighty degrees, and nothing in between.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:420:5
     "blocking",
     BLOCKING,
     "The proton and the leaving group are not in the same plane.",
-    "E2 forms a pi bond as the two sigma bonds break, so those two bonds have to be aligned with the developing p orbitals. Near zero or near one hundred and eighty degrees, and nothing in between.",
+    "",
   ),
   e2_syn_periplanar_unjustified: define(
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:423:5
     "E2 forms a pi bond as the two sigma bonds break, so those two bonds have to be aligned with the developing p orbitals. Near zero or near one hundred and eighty degrees, and nothing in between.",
   ),
   e2_syn_periplanar_unjustified: define(
-    "e2_syn_periplanar_unjustified",
+    "",
     "stereochemistry",
     "advisory",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected '' to be 'e2_syn_periplanar_unjustified' // Object.is equality

[Killed] StringLiteral
src/causes.ts:428:5
     "advisory",
     ANYWHERE,
     "This is a syn periplanar E2, which needs a reason.",
-    "Syn elimination is real in rings and cages where anti geometry cannot be reached. It is not wrong, it is unusual, and the conformational reason it is forced should be stated.",
+    "",
   ),
   stereocenter_created_without_declared_geometry: define(
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:431:5
     "Syn elimination is real in rings and cages where anti geometry cannot be reached. It is not wrong, it is unusual, and the conformational reason it is forced should be stated.",
   ),
   stereocenter_created_without_declared_geometry: define(
-    "stereocenter_created_without_declared_geometry",
+    "",
     "stereochemistry",
     "blocking",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected '' to be 'stereocenter_created_without_declared…' // Object.is equality

[Killed] StringLiteral
src/causes.ts:439:5
     "Once a carbon carries four different groups, the two arrangements are different compounds. Leaving it flat on the page does not average them, it just does not say which one was made.",
   ),
   stereochemistry_asserted_as_single_product_at_sn1_center: define(
-    "stereochemistry_asserted_as_single_product_at_sn1_center",
+    "",
     "stereochemistry",
     "advisory",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected '' to be 'stereochemistry_asserted_as_single_pr…' // Object.is equality

[Killed] StringLiteral
src/causes.ts:440:5
   ),
   stereochemistry_asserted_as_single_product_at_sn1_center: define(
     "stereochemistry_asserted_as_single_product_at_sn1_center",
-    "stereochemistry",
+    "",
     "advisory",
     ANYWHERE,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:441:5
   stereochemistry_asserted_as_single_product_at_sn1_center: define(
     "stereochemistry_asserted_as_single_product_at_sn1_center",
     "stereochemistry",
-    "advisory",
+    "",
     ANYWHERE,
     "An SN1 centre is shown as a single configuration.",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'blocking', 'advisory', …(1) ] to include ''

[Killed] StringLiteral
src/causes.ts:443:5
     "stereochemistry",
     "advisory",
     ANYWHERE,
-    "An SN1 centre is shown as a single configuration.",
+    "",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:453:5
     "advisory",
     ANYWHERE,
     "Backside attack here is very slow, so something else usually wins.",
-    "A neopentyl centre reacts by SN2 roughly a hundred thousand times slower than ethyl. It is not forbidden, it is simply outrun, most often by a methyl shift to a tertiary cation.",
+    "",
   ),
   sn2_at_tertiary_center: define(
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:461:5
     "advisory",
     ANYWHERE,
     "This is a backside attack on a fully substituted carbon.",
-    "Three alkyl groups sit across the trajectory the nucleophile has to travel. Under these conditions the ionisation pathway is normally what happens instead.",
+    "",
   ),
   nucleophile_cannot_reach_backside: define(
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:465:5
   ),
   nucleophile_cannot_reach_backside: define(
     "nucleophile_cannot_reach_backside",
-    "sterics",
+    "",
     "blocking",
     BLOCKING,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''
