[Killed] StringLiteral
src/causes.ts:469:5
     "blocking",
     BLOCKING,
     "The backside of this carbon is not reachable at all.",
-    "At a bridgehead in a small bicycle, the geometry that inversion requires cannot be reached without breaking the cage. This is the one steric case that is a hard no rather than a slow yes.",
+    "",
   ),
 
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:474:5
 
   leaving_group_too_poor: define(
     "leaving_group_too_poor",
-    "reactivity",
+    "",
     "advisory",
     ANYWHERE,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:478:5
     "advisory",
     ANYWHERE,
     "This group does not leave on its own.",
-    "A leaving group has to be stable carrying the electron pair it takes with it. Hydroxide is not, which is why alcohols are protonated first and leave as water.",
+    "",
   ),
   nucleophile_not_present_in_state: define(
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:481:5
     "A leaving group has to be stable carrying the electron pair it takes with it. Hydroxide is not, which is why alcohols are protonated first and leave as water.",
   ),
   nucleophile_not_present_in_state: define(
-    "nucleophile_not_present_in_state",
+    "",
     "reactivity",
     "blocking",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected '' to be 'nucleophile_not_present_in_state' // Object.is equality

[Killed] StringLiteral
src/causes.ts:485:5
     "reactivity",
     "blocking",
     BLOCKING,
-    "The nucleophile that attacks here is not in the flask.",
+    "",
     "The system boundary is what is drawn. A reagent implied by the conditions still has to be a member before it can react.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:490:5
   ),
   acid_and_base_regime_mixed: define(
     "acid_and_base_regime_mixed",
-    "reactivity",
+    "",
     "blocking",
     BLOCKING,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:491:5
   acid_and_base_regime_mixed: define(
     "acid_and_base_regime_mixed",
     "reactivity",
-    "blocking",
+    "",
     BLOCKING,
     "This mechanism uses a strong acid and a strong base in the same pot.",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'blocking', 'advisory', …(1) ] to include ''

[Killed] StringLiteral
src/causes.ts:497:5
     "Under acidic conditions there is no free alkoxide, and under basic conditions there is no protonated carbonyl. Pick the regime the conditions describe and stay in it.",
   ),
   skipped_favourable_rearrangement: define(
-    "skipped_favourable_rearrangement",
+    "",
     "reactivity",
     "advisory",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected '' to be 'skipped_favourable_rearrangement' // Object.is equality

[Killed] StringLiteral
src/causes.ts:502:5
     "advisory",
     ANYWHERE,
     "A much more stable cation was available one shift away.",
-    "Hydride and alkyl shifts happen fast when they buy stability. A secondary cation next to a quaternary carbon rarely survives long enough to be captured.",
+    "",
   ),
   regiochemistry_contradicts_stability: define(
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:505:5
     "Hydride and alkyl shifts happen fast when they buy stability. A secondary cation next to a quaternary carbon rarely survives long enough to be captured.",
   ),
   regiochemistry_contradicts_stability: define(
-    "regiochemistry_contradicts_stability",
+    "",
     "reactivity",
     "advisory",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected '' to be 'regiochemistry_contradicts_stability' // Object.is equality

[Killed] StringLiteral
src/causes.ts:506:5
   ),
   regiochemistry_contradicts_stability: define(
     "regiochemistry_contradicts_stability",
-    "reactivity",
+    "",
     "advisory",
     ANYWHERE,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:507:5
   regiochemistry_contradicts_stability: define(
     "regiochemistry_contradicts_stability",
     "reactivity",
-    "advisory",
+    "",
     ANYWHERE,
     "The addition went to the less favourable position.",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'blocking', 'advisory', …(1) ] to include ''

[Killed] StringLiteral
src/causes.ts:510:5
     "advisory",
     ANYWHERE,
     "The addition went to the less favourable position.",
-    "The electrophile adds so as to leave the more stabilised cation behind. That is all Markovnikov's rule is, and it inverts under radical conditions for the same reason.",
+    "",
   ),
   attacked_wrong_electrophilic_site: define(
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:522:5
   ),
   carbocation_on_destabilised_center: define(
     "carbocation_on_destabilised_center",
-    "reactivity",
+    "",
     "advisory",
     ANYWHERE,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:526:5
     "advisory",
     ANYWHERE,
     "This cation sits on a carbon that cannot support it.",
-    "Vinyl, aryl, and primary cations are high enough in energy that a mechanism going through one is usually a sign that a different pathway is operating.",
+    "",
   ),
   antiaromatic_intermediate_proposed: define(
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:539:5
 
   step_out_of_order: define(
     "step_out_of_order",
-    "route",
+    "",
     "blocking",
     BLOCKING,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:540:5
   step_out_of_order: define(
     "step_out_of_order",
     "route",
-    "blocking",
+    "",
     BLOCKING,
     "This step cannot happen yet.",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'blocking', 'advisory', …(1) ] to include ''

[Killed] StringLiteral
src/causes.ts:543:5
     "blocking",
     BLOCKING,
     "This step cannot happen yet.",
-    "The species it needs is made by a later step. Mechanisms are a sequence, and each step starts from what the one before it actually produced.",
+    "",
   ),
   step_not_elementary: define(
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:550:5
     "route",
     "blocking",
     BLOCKING,
-    "Several separate steps are drawn as one.",
+    "",
     "One elementary step is one transition state. Bond formation and an unrelated proton transfer are two barriers, so they are two steps, even when both are inevitable.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:551:5
     "blocking",
     BLOCKING,
     "Several separate steps are drawn as one.",
-    "One elementary step is one transition state. Bond formation and an unrelated proton transfer are two barriers, so they are two steps, even when both are inevitable.",
+    "",
   ),
   step_kind_disagrees_with_arrows: define(
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:555:5
   ),
   step_kind_disagrees_with_arrows: define(
     "step_kind_disagrees_with_arrows",
-    "route",
+    "",
     "blocking",
     BLOCKING,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:558:5
     "route",
     "blocking",
     BLOCKING,
-    "The kind this step is declared to be is not the kind its arrows describe.",
+    "",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/causes.ts:563:5
   ),
   reaction_center_not_touched_by_any_arrow: define(
     "reaction_center_not_touched_by_any_arrow",
-    "route",
+    "",
     "blocking",
     BLOCKING,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:571:5
   ),
   route_requires_conditions_not_present: define(
     "route_requires_conditions_not_present",
-    "route",
+    "",
     "advisory",
     ANY_VALID,
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'success', 'valence', …(6) ] to include ''

[Killed] StringLiteral
src/causes.ts:572:5
   route_requires_conditions_not_present: define(
     "route_requires_conditions_not_present",
     "route",
-    "advisory",
+    "",
     ANY_VALID,
     "This route needs conditions the question did not give.",
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected [ 'blocking', 'advisory', …(1) ] to include ''

[Killed] StringLiteral
src/causes.ts:574:5
     "route",
     "advisory",
     ANY_VALID,
-    "This route needs conditions the question did not give.",
+    "",
     "Route choice is set by the reagents and the solvent as much as by the substrate. A mechanism that would need heat, or a different solvent, is describing a different experiment.",
   ),
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/causes.ts:614:64
   readonly relatedRoute?: MechanismRoute;
 }
 
-export function namedCause(input: NamedCauseInput): NamedCause {
-  return Object.freeze({
-    id: input.id,
-    subjects: Object.freeze([...(input.subjects ?? [])]),
-    ...(input.relatedRoute === undefined ? {} : { relatedRoute: input.relatedRoute }),
-  });
-}
+export function namedCause(input: NamedCauseInput): NamedCause {}
 
 export function causeDefinition(id: CauseId): CauseDefinition {
killedBy: namedCause defaults subjects to an empty frozen list
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
src/causes.ts:617:34
 export function namedCause(input: NamedCauseInput): NamedCause {
   return Object.freeze({
     id: input.id,
-    subjects: Object.freeze([...(input.subjects ?? [])]),
+    subjects: Object.freeze([...(input.subjects && [])]),
     ...(input.relatedRoute === undefined ? {} : { relatedRoute: input.relatedRoute }),
   });
killedBy: namedCause defaults subjects to an empty frozen list
statusReason: (intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ArrayDeclaration
src/causes.ts:617:52
 export function namedCause(input: NamedCauseInput): NamedCause {
   return Object.freeze({
     id: input.id,
-    subjects: Object.freeze([...(input.subjects ?? [])]),
+    subjects: Object.freeze([...(input.subjects ?? ["Stryker was here"])]),
     ...(input.relatedRoute === undefined ? {} : { relatedRoute: input.relatedRoute }),
   });
killedBy: namedCause defaults subjects to an empty frozen list
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] ConditionalExpression
src/causes.ts:618:9
   return Object.freeze({
     id: input.id,
     subjects: Object.freeze([...(input.subjects ?? [])]),
-    ...(input.relatedRoute === undefined ? {} : { relatedRoute: input.relatedRoute }),
+    ...(false ? {} : { relatedRoute: input.relatedRoute }),
   });
 }
killedBy: namedCause omits relatedRoute rather than setting it undefined
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/causes.ts:618:9
   return Object.freeze({
     id: input.id,
     subjects: Object.freeze([...(input.subjects ?? [])]),
-    ...(input.relatedRoute === undefined ? {} : { relatedRoute: input.relatedRoute }),
+    ...(true ? {} : { relatedRoute: input.relatedRoute }),
   });
 }
killedBy: namedCause carries the competing pathway when one is named
statusReason: expected undefined to be 'carbocation_rearrangement' // Object.is equality

[Killed] BlockStatement
src/causes.ts:622:63
   });
 }
 
-export function causeDefinition(id: CauseId): CauseDefinition {
-  const definition = CAUSES[id];
-  if (definition === undefined) {
-    throw new Error(`Unknown cause id: ${id}`);
-  }
-  return definition;
-}
+export function causeDefinition(id: CauseId): CauseDefinition {}
 
 /**
killedBy: the finder as a whole maps every finding to a cause that exists in the registry and is blocking
statusReason: Cannot read properties of undefined (reading 'severity')

[Killed] ConditionalExpression
src/causes.ts:624:7
 
 export function causeDefinition(id: CauseId): CauseDefinition {
   const definition = CAUSES[id];
-  if (definition === undefined) {
+  if (false) {
     throw new Error(`Unknown cause id: ${id}`);
   }
killedBy: every cause definition is complete throws on an id that is not in the registry
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/causes.ts:624:7
 
 export function causeDefinition(id: CauseId): CauseDefinition {
   const definition = CAUSES[id];
-  if (definition === undefined) {
+  if (true) {
     throw new Error(`Unknown cause id: ${id}`);
   }
killedBy: every cause definition is complete gives every cause a whole definition
statusReason: Unknown cause id: matches_requested_route

[Killed] StringLiteral
src/causes.ts:625:21
 export function causeDefinition(id: CauseId): CauseDefinition {
   const definition = CAUSES[id];
   if (definition === undefined) {
-    throw new Error(`Unknown cause id: ${id}`);
+    throw new Error(``);
   }
   return definition;
killedBy: every cause definition is complete throws on an id that is not in the registry
statusReason: expected [Function] to throw error matching /not_a_cause/ but got ''

[Killed] BlockStatement
src/causes.ts:636:51
  * The measured win condition on the feedback axis is a count over this. Read it
  * from here rather than counting by hand.
  */
-export function allCauseIds(): readonly CauseId[] {
-  return Object.freeze(Object.keys(CAUSES) as CauseId[]);
-}
+export function allCauseIds(): readonly CauseId[] {}
 
 /** How many distinct named causes exist. The number the feedback axis reports. */
killedBy: the cause registry is countable by construction counts exactly the keys of CAUSES
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/causes.ts:641:38
 }
 
 /** How many distinct named causes exist. The number the feedback axis reports. */
-export function causeCount(): number {
-  return allCauseIds().length;
-}
+export function causeCount(): number {}
 
 export function causeIdsByCategory(category: CauseCategory): readonly CauseId[] {
killedBy: the cause registry is countable by construction counts exactly the keys of CAUSES
statusReason: expected undefined to be 51 // Object.is equality

[Killed] BlockStatement
src/causes.ts:645:81
   return allCauseIds().length;
 }
 
-export function causeIdsByCategory(category: CauseCategory): readonly CauseId[] {
-  return allCauseIds().filter((id) => causeDefinition(id).category === category);
-}
+export function causeIdsByCategory(category: CauseCategory): readonly CauseId[] {}
 
 export function causeIdsBySeverity(severity: CauseSeverity): readonly CauseId[] {
killedBy: grouping helpers partition the registry assigns every cause to exactly one category, and the categories cover it
statusReason: expected [ undefined, undefined, …(6) ] to deeply equal [ 'acid_and_base_regime_mixed', …(50) ]

[Killed] EqualityOperator
src/causes.ts:646:39
 }
 
 export function causeIdsByCategory(category: CauseCategory): readonly CauseId[] {
-  return allCauseIds().filter((id) => causeDefinition(id).category === category);
+  return allCauseIds().filter((id) => causeDefinition(id).category !== category);
 }
 
killedBy: grouping helpers partition the registry assigns every cause to exactly one category, and the categories cover it
statusReason: expected [ Array(357) ] to deeply equal [ 'acid_and_base_regime_mixed', …(50) ]

[Killed] ConditionalExpression
src/causes.ts:646:39
 }
 
 export function causeIdsByCategory(category: CauseCategory): readonly CauseId[] {
-  return allCauseIds().filter((id) => causeDefinition(id).category === category);
+  return allCauseIds().filter((id) => true);
 }
 
killedBy: grouping helpers partition the registry assigns every cause to exactly one category, and the categories cover it
statusReason: expected [ Array(408) ] to deeply equal [ 'acid_and_base_regime_mixed', …(50) ]

[Killed] BlockStatement
src/causes.ts:649:81
   return allCauseIds().filter((id) => causeDefinition(id).category === category);
 }
 
-export function causeIdsBySeverity(severity: CauseSeverity): readonly CauseId[] {
-  return allCauseIds().filter((id) => causeDefinition(id).severity === severity);
-}
+export function causeIdsBySeverity(severity: CauseSeverity): readonly CauseId[] {}
 
 /** Whether a cause is allowed to be the primary cause of a given resolution. */
killedBy: severity and resolution kind are consistent only lets a blocking cause be the primary cause of an invalid attempt
statusReason: (0 , causeIdsBySeverity) is not a function or its return value is not iterable

[Killed] ConditionalExpression
src/causes.ts:650:39
 }
 
 export function causeIdsBySeverity(severity: CauseSeverity): readonly CauseId[] {
-  return allCauseIds().filter((id) => causeDefinition(id).severity === severity);
+  return allCauseIds().filter((id) => false);
 }
 
killedBy: severity and resolution kind are consistent lets advisory causes sit on a correct answer, which is graded chemistry
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/causes.ts:650:39
 }
 
 export function causeIdsBySeverity(severity: CauseSeverity): readonly CauseId[] {
-  return allCauseIds().filter((id) => causeDefinition(id).severity === severity);
+  return allCauseIds().filter((id) => true);
 }
 
killedBy: severity and resolution kind are consistent only lets a blocking cause be the primary cause of an invalid attempt
statusReason: expected [ 'correct' ] to deeply equal [ 'invalid' ]

[Killed] BlockStatement
src/causes.ts:654:76
 }
 
 /** Whether a cause is allowed to be the primary cause of a given resolution. */
-export function causeAppliesTo(id: CauseId, kind: ResolutionKind): boolean {
-  return causeDefinition(id).appliesTo.includes(kind);
-}
+export function causeAppliesTo(id: CauseId, kind: ResolutionKind): boolean {}
 
killedBy: severity and resolution kind are consistent lets advisory causes sit on a correct answer, which is graded chemistry
statusReason: expected undefined to be true // Object.is equality
