[Killed] BlockStatement
src/deltas.ts:67:45
   formalCharge: number;
 }
 
-function emptyAtomDelta(): MutableAtomDelta {
-  return { nonbondingElectrons: 0, implicitHydrogens: 0, formalCharge: 0 };
-}
+function emptyAtomDelta(): MutableAtomDelta {}
 
 function atomDeltaFor(map: Map<AtomId, MutableAtomDelta>, atomId: AtomId): MutableAtomDelta {
killedBy: declaredDeltas takes electrons off a lone pair source
statusReason: Cannot read properties of undefined (reading 'nonbondingElectrons')

[Killed] BlockStatement
src/deltas.ts:71:93
   return { nonbondingElectrons: 0, implicitHydrogens: 0, formalCharge: 0 };
 }
 
-function atomDeltaFor(map: Map<AtomId, MutableAtomDelta>, atomId: AtomId): MutableAtomDelta {
-  const existing = map.get(atomId);
-  if (existing !== undefined) return existing;
-  const created = emptyAtomDelta();
-  map.set(atomId, created);
-  return created;
-}
+function atomDeltaFor(map: Map<AtomId, MutableAtomDelta>, atomId: AtomId): MutableAtomDelta {}
 
 function bumpBond(map: Map<string, number>, key: string, electrons: number): void {
killedBy: declaredDeltas takes electrons off a lone pair source
statusReason: Cannot read properties of undefined (reading 'nonbondingElectrons')

[Killed] ConditionalExpression
src/deltas.ts:73:7
 
 function atomDeltaFor(map: Map<AtomId, MutableAtomDelta>, atomId: AtomId): MutableAtomDelta {
   const existing = map.get(atomId);
-  if (existing !== undefined) return existing;
+  if (true) return existing;
   const created = emptyAtomDelta();
   map.set(atomId, created);
killedBy: declaredDeltas takes electrons off a lone pair source
statusReason: Cannot read properties of undefined (reading 'nonbondingElectrons')

[Killed] ConditionalExpression
src/deltas.ts:73:7
 
 function atomDeltaFor(map: Map<AtomId, MutableAtomDelta>, atomId: AtomId): MutableAtomDelta {
   const existing = map.get(atomId);
-  if (existing !== undefined) return existing;
+  if (false) return existing;
   const created = emptyAtomDelta();
   map.set(atomId, created);
killedBy: declaredDeltas cancels an arrow pair that puts electrons back where they came from
statusReason: expected [ { atomId: 'cl1', …(3) }, …(1) ] to deeply equal []

[Killed] BlockStatement
src/deltas.ts:79:83
   return created;
 }
 
-function bumpBond(map: Map<string, number>, key: string, electrons: number): void {
-  map.set(key, (map.get(key) ?? 0) + electrons);
-}
+function bumpBond(map: Map<string, number>, key: string, electrons: number): void {}
 
 function collectAtoms(state: MechanismState): Map<AtomId, Atom> {
killedBy: declaredDeltas puts electrons into the bond a betweenAtoms sink names
statusReason: expected [] to deeply equal [ { atomIds: [ 'c1', 'o1' ], …(1) } ]

[Killed] LogicalOperator
src/deltas.ts:80:17
 }
 
 function bumpBond(map: Map<string, number>, key: string, electrons: number): void {
-  map.set(key, (map.get(key) ?? 0) + electrons);
+  map.set(key, (map.get(key) && 0) + electrons);
 }
 
killedBy: declaredDeltas puts electrons into the bond a betweenAtoms sink names
statusReason: expected [ { atomIds: [ 'c1', 'o1' ], …(1) } ] to deeply equal [ { atomIds: [ 'c1', 'o1' ], …(1) } ]

[Killed] ArithmeticOperator
src/deltas.ts:80:16
 }
 
 function bumpBond(map: Map<string, number>, key: string, electrons: number): void {
-  map.set(key, (map.get(key) ?? 0) + electrons);
+  map.set(key, (map.get(key) ?? 0) - electrons);
 }
 
killedBy: declaredDeltas puts electrons into the bond a betweenAtoms sink names
statusReason: expected [ { atomIds: [ 'c1', 'o1' ], …(1) } ] to deeply equal [ { atomIds: [ 'c1', 'o1' ], …(1) } ]

[Killed] BlockStatement
src/deltas.ts:83:65
   map.set(key, (map.get(key) ?? 0) + electrons);
 }
 
-function collectAtoms(state: MechanismState): Map<AtomId, Atom> {
-  const atoms = new Map<AtomId, Atom>();
-  for (const member of state.members) {
-    for (const atom of member.species.atoms) {
-      atoms.set(atom.id, atom);
-    }
-  }
-  return atoms;
-}
+function collectAtoms(state: MechanismState): Map<AtomId, Atom> {}
 
 function collectBondElectrons(state: MechanismState): Map<string, number> {
killedBy: observedDeltas reports the nonbonding change on each atom
statusReason: before is not iterable

[Killed] BlockStatement
src/deltas.ts:85:39
 
 function collectAtoms(state: MechanismState): Map<AtomId, Atom> {
   const atoms = new Map<AtomId, Atom>();
-  for (const member of state.members) {
-    for (const atom of member.species.atoms) {
-      atoms.set(atom.id, atom);
-    }
-  }
+  for (const member of state.members) {}
   return atoms;
 }
killedBy: observedDeltas reports the nonbonding change on each atom
statusReason: expected undefined to be -2 // Object.is equality

[Killed] BlockStatement
src/deltas.ts:86:46
 function collectAtoms(state: MechanismState): Map<AtomId, Atom> {
   const atoms = new Map<AtomId, Atom>();
   for (const member of state.members) {
-    for (const atom of member.species.atoms) {
-      atoms.set(atom.id, atom);
-    }
+    for (const atom of member.species.atoms) {}
   }
   return atoms;
killedBy: observedDeltas reports the nonbonding change on each atom
statusReason: expected undefined to be -2 // Object.is equality

[Killed] BlockStatement
src/deltas.ts:93:75
   return atoms;
 }
 
-function collectBondElectrons(state: MechanismState): Map<string, number> {
-  const bonds = new Map<string, number>();
-  for (const member of state.members) {
-    for (const bond of member.species.bonds) {
-      bumpBond(bonds, atomPairKey(bond.a, bond.b), bond.order * 2);
-    }
-  }
-  return bonds;
-}
+function collectBondElectrons(state: MechanismState): Map<string, number> {}
 
 function assemble(
killedBy: observedDeltas reports the nonbonding change on each atom
statusReason: Cannot read properties of undefined (reading 'keys')

[Killed] BlockStatement
src/deltas.ts:95:39
 
 function collectBondElectrons(state: MechanismState): Map<string, number> {
   const bonds = new Map<string, number>();
-  for (const member of state.members) {
-    for (const bond of member.species.bonds) {
-      bumpBond(bonds, atomPairKey(bond.a, bond.b), bond.order * 2);
-    }
-  }
+  for (const member of state.members) {}
   return bonds;
 }
killedBy: observedDeltas reports a bond broken as minus two electrons and a bond formed as plus two
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/deltas.ts:96:46
 function collectBondElectrons(state: MechanismState): Map<string, number> {
   const bonds = new Map<string, number>();
   for (const member of state.members) {
-    for (const bond of member.species.bonds) {
-      bumpBond(bonds, atomPairKey(bond.a, bond.b), bond.order * 2);
-    }
+    for (const bond of member.species.bonds) {}
   }
   return bonds;
killedBy: observedDeltas reports a bond broken as minus two electrons and a bond formed as plus two
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] ArithmeticOperator
src/deltas.ts:97:52
   const bonds = new Map<string, number>();
   for (const member of state.members) {
     for (const bond of member.species.bonds) {
-      bumpBond(bonds, atomPairKey(bond.a, bond.b), bond.order * 2);
+      bumpBond(bonds, atomPairKey(bond.a, bond.b), bond.order / 2);
     }
   }
killedBy: observedDeltas reports a bond broken as minus two electrons and a bond formed as plus two
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] BlockStatement
src/deltas.ts:110:45
   atomsAdded: readonly AtomId[],
 ): ElectronDeltaSet {
   const atoms: AtomElectronDelta[] = [];
-  for (const [atomId, delta] of atomDeltas) {
-    if (
-      delta.nonbondingElectrons === 0 &&
-      delta.implicitHydrogens === 0 &&
-      delta.formalCharge === 0
-    ) {
-      continue;
-    }
-    atoms.push(Object.freeze({ atomId, ...delta }));
-  }
+  for (const [atomId, delta] of atomDeltas) {}
 
   const bonds: BondElectronDelta[] = [];
killedBy: declaredDeltas takes electrons off a lone pair source
statusReason: expected [] to deeply equal [ { atomId: 'o1', …(3) } ]

[Killed] ConditionalExpression
src/deltas.ts:112:7
   const atoms: AtomElectronDelta[] = [];
   for (const [atomId, delta] of atomDeltas) {
     if (
-      delta.nonbondingElectrons === 0 &&
-      delta.implicitHydrogens === 0 &&
-      delta.formalCharge === 0
+      false
     ) {
       continue;
killedBy: declaredDeltas cancels an arrow pair that puts electrons back where they came from
statusReason: expected [ { atomId: 'cl1', …(3) }, …(1) ] to deeply equal []

[Killed] LogicalOperator
src/deltas.ts:112:7
   const atoms: AtomElectronDelta[] = [];
   for (const [atomId, delta] of atomDeltas) {
     if (
-      delta.nonbondingElectrons === 0 &&
-      delta.implicitHydrogens === 0 &&
+      delta.nonbondingElectrons === 0 || delta.implicitHydrogens === 0 &&
       delta.formalCharge === 0
     ) {
killedBy: declaredDeltas takes electrons off a lone pair source
statusReason: expected [] to deeply equal [ { atomId: 'o1', …(3) } ]

[Killed] EqualityOperator
src/deltas.ts:113:7
   for (const [atomId, delta] of atomDeltas) {
     if (
       delta.nonbondingElectrons === 0 &&
-      delta.implicitHydrogens === 0 &&
+      delta.implicitHydrogens !== 0 &&
       delta.formalCharge === 0
     ) {
killedBy: declaredDeltas cancels an arrow pair that puts electrons back where they came from
statusReason: expected [ { atomId: 'cl1', …(3) }, …(1) ] to deeply equal []

[Killed] ConditionalExpression
src/deltas.ts:113:7
   for (const [atomId, delta] of atomDeltas) {
     if (
       delta.nonbondingElectrons === 0 &&
-      delta.implicitHydrogens === 0 &&
+      true &&
       delta.formalCharge === 0
     ) {
killedBy: assemble keeps an atom that changed in exactly one way keeps an atom whose only change is an implicit hydrogen count
statusReason: expected [] to deeply equal [ { atomId: 'o1', …(3) } ]

[Killed] EqualityOperator
src/deltas.ts:114:7
     if (
       delta.nonbondingElectrons === 0 &&
       delta.implicitHydrogens === 0 &&
-      delta.formalCharge === 0
+      delta.formalCharge !== 0
     ) {
       continue;
killedBy: declaredDeltas cancels an arrow pair that puts electrons back where they came from
statusReason: expected [ { atomId: 'cl1', …(3) }, …(1) ] to deeply equal []

[Killed] ConditionalExpression
src/deltas.ts:114:7
     if (
       delta.nonbondingElectrons === 0 &&
       delta.implicitHydrogens === 0 &&
-      delta.formalCharge === 0
+      true
     ) {
       continue;
killedBy: assemble keeps an atom that changed in exactly one way keeps an atom whose only change is a declared formal charge
statusReason: expected [] to deeply equal [ { atomId: 'c1', …(3) } ]

[Killed] BlockStatement
src/deltas.ts:115:7
       delta.nonbondingElectrons === 0 &&
       delta.implicitHydrogens === 0 &&
       delta.formalCharge === 0
-    ) {
-      continue;
-    }
+    ) {}
     atoms.push(Object.freeze({ atomId, ...delta }));
   }
killedBy: declaredDeltas cancels an arrow pair that puts electrons back where they came from
statusReason: expected [ { atomId: 'cl1', …(3) }, …(1) ] to deeply equal []

[Killed] BlockStatement
src/deltas.ts:122:46
   }
 
   const bonds: BondElectronDelta[] = [];
-  for (const [key, electrons] of bondDeltas) {
-    if (electrons === 0) continue;
-    bonds.push(Object.freeze({ atomIds: parseAtomPairKey(key), electrons }));
-  }
+  for (const [key, electrons] of bondDeltas) {}
 
   atoms.sort((left, right) => left.atomId.localeCompare(right.atomId));
killedBy: declaredDeltas puts electrons into the bond a betweenAtoms sink names
statusReason: expected [] to deeply equal [ { atomIds: [ 'c1', 'o1' ], …(1) } ]

[Killed] EqualityOperator
src/deltas.ts:123:9
 
   const bonds: BondElectronDelta[] = [];
   for (const [key, electrons] of bondDeltas) {
-    if (electrons === 0) continue;
+    if (electrons !== 0) continue;
     bonds.push(Object.freeze({ atomIds: parseAtomPairKey(key), electrons }));
   }
killedBy: declaredDeltas puts electrons into the bond a betweenAtoms sink names
statusReason: expected [] to deeply equal [ { atomIds: [ 'c1', 'o1' ], …(1) } ]

[Killed] ConditionalExpression
src/deltas.ts:123:9
 
   const bonds: BondElectronDelta[] = [];
   for (const [key, electrons] of bondDeltas) {
-    if (electrons === 0) continue;
+    if (false) continue;
     bonds.push(Object.freeze({ atomIds: parseAtomPairKey(key), electrons }));
   }
killedBy: assemble keeps an atom that changed in exactly one way drops a bond whose electron count did not change
statusReason: expected [ { atomIds: [ 'c1', 'cl1' ], …(1) } ] to deeply equal []

[Killed] ObjectLiteral
src/deltas.ts:124:30
   const bonds: BondElectronDelta[] = [];
   for (const [key, electrons] of bondDeltas) {
     if (electrons === 0) continue;
-    bonds.push(Object.freeze({ atomIds: parseAtomPairKey(key), electrons }));
+    bonds.push(Object.freeze({}));
   }
 
killedBy: declaredDeltas puts electrons into the bond a betweenAtoms sink names
statusReason: expected [ {} ] to deeply equal [ { atomIds: [ 'c1', 'o1' ], …(1) } ]

[Killed] MethodExpression
src/deltas.ts:127:3
     bonds.push(Object.freeze({ atomIds: parseAtomPairKey(key), electrons }));
   }
 
-  atoms.sort((left, right) => left.atomId.localeCompare(right.atomId));
+  atoms;
   bonds.sort((left, right) =>
     atomPairKey(left.atomIds[0], left.atomIds[1]).localeCompare(
killedBy: declaredDeltas accumulates several arrows into one set
statusReason: expected [ 'o1', 'cl1' ] to deeply equal [ 'cl1', 'o1' ]

[Killed] ArrowFunction
src/deltas.ts:127:14
     bonds.push(Object.freeze({ atomIds: parseAtomPairKey(key), electrons }));
   }
 
-  atoms.sort((left, right) => left.atomId.localeCompare(right.atomId));
+  atoms.sort(() => undefined);
   bonds.sort((left, right) =>
     atomPairKey(left.atomIds[0], left.atomIds[1]).localeCompare(
killedBy: declaredDeltas accumulates several arrows into one set
statusReason: expected [ 'o1', 'cl1' ] to deeply equal [ 'cl1', 'o1' ]

[Killed] MethodExpression
src/deltas.ts:128:3
   }
 
   atoms.sort((left, right) => left.atomId.localeCompare(right.atomId));
-  bonds.sort((left, right) =>
-    atomPairKey(left.atomIds[0], left.atomIds[1]).localeCompare(
-      atomPairKey(right.atomIds[0], right.atomIds[1]),
-    ),
-  );
+  bonds;
 
   return Object.freeze({
killedBy: declaredDeltas accumulates several arrows into one set
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ArrowFunction
src/deltas.ts:128:14
   }
 
   atoms.sort((left, right) => left.atomId.localeCompare(right.atomId));
-  bonds.sort((left, right) =>
-    atomPairKey(left.atomIds[0], left.atomIds[1]).localeCompare(
-      atomPairKey(right.atomIds[0], right.atomIds[1]),
-    ),
+  bonds.sort(() => undefined,
   );
 
killedBy: declaredDeltas accumulates several arrows into one set
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ObjectLiteral
src/deltas.ts:134:24
     ),
   );
 
-  return Object.freeze({
-    atoms: Object.freeze(atoms),
-    bonds: Object.freeze(bonds),
-    atomsRemoved: Object.freeze([...atomsRemoved]),
-    atomsAdded: Object.freeze([...atomsAdded]),
-  });
+  return Object.freeze({});
 }
 
killedBy: declaredDeltas takes electrons off a lone pair source
statusReason: expected undefined to deeply equal [ { atomId: 'o1', …(3) } ]

[Killed] ArrayDeclaration
src/deltas.ts:138:31
     atoms: Object.freeze(atoms),
     bonds: Object.freeze(bonds),
     atomsRemoved: Object.freeze([...atomsRemoved]),
-    atomsAdded: Object.freeze([...atomsAdded]),
+    atomsAdded: Object.freeze([]),
   });
 }
killedBy: observedDeltas lists an atom present only in `to` as added
statusReason: expected [] to deeply equal [ 'n1' ]

[Killed] BlockStatement
src/deltas.ts:159:39
   state: MechanismState,
 ): ElectronDeltaSet {
   const bondEnds = new Map<string, readonly [AtomId, AtomId]>();
-  for (const member of state.members) {
-    for (const bond of member.species.bonds) {
-      bondEnds.set(bond.id, [bond.a, bond.b]);
-    }
-  }
+  for (const member of state.members) {}
 
   const atomDeltas = new Map<AtomId, MutableAtomDelta>();
killedBy: declaredDeltas takes electrons out of a bond source and lands them on the sink atom
statusReason: Arrow a2 sources bond b1, which is not in state st-0

[Killed] BlockStatement
src/deltas.ts:160:46
 ): ElectronDeltaSet {
   const bondEnds = new Map<string, readonly [AtomId, AtomId]>();
   for (const member of state.members) {
-    for (const bond of member.species.bonds) {
-      bondEnds.set(bond.id, [bond.a, bond.b]);
-    }
+    for (const bond of member.species.bonds) {}
   }
 
killedBy: declaredDeltas takes electrons out of a bond source and lands them on the sink atom
statusReason: Arrow a2 sources bond b1, which is not in state st-0

[Killed] StringLiteral
src/deltas.ts:172:12
     const electrons = arrow.electrons;
 
     switch (arrow.source.kind) {
-      case "lonePair":
+      case "":
       case "singleElectron": {
         atomDeltaFor(atomDeltas, arrow.source.atomId).nonbondingElectrons -= electrons;
killedBy: declaredDeltas takes electrons off a lone pair source
statusReason: expected [] to deeply equal [ { atomId: 'o1', …(3) } ]

[Killed] BlockStatement
src/deltas.ts:173:30
 
     switch (arrow.source.kind) {
       case "lonePair":
-      case "singleElectron": {
-        atomDeltaFor(atomDeltas, arrow.source.atomId).nonbondingElectrons -= electrons;
-        break;
-      }
+      case "singleElectron": {}
       case "bond": {
         const ends = bondEnds.get(arrow.source.bondId);
killedBy: declaredDeltas takes electrons off a lone pair source
statusReason: Arrow a1 sources bond undefined, which is not in state st-0

[Killed] ConditionalExpression
src/deltas.ts:173:7
 
     switch (arrow.source.kind) {
       case "lonePair":
-      case "singleElectron": {
-        atomDeltaFor(atomDeltas, arrow.source.atomId).nonbondingElectrons -= electrons;
-        break;
-      }
+      case "singleElectron":
       case "bond": {
         const ends = bondEnds.get(arrow.source.bondId);
killedBy: declaredDeltas takes electrons off a lone pair source
statusReason: Arrow a1 sources bond undefined, which is not in state st-0

[Killed] AssignmentOperator
src/deltas.ts:174:9
     switch (arrow.source.kind) {
       case "lonePair":
       case "singleElectron": {
-        atomDeltaFor(atomDeltas, arrow.source.atomId).nonbondingElectrons -= electrons;
+        atomDeltaFor(atomDeltas, arrow.source.atomId).nonbondingElectrons += electrons;
         break;
       }
killedBy: declaredDeltas takes electrons off a lone pair source
statusReason: expected [ { atomId: 'o1', …(3) } ] to deeply equal [ { atomId: 'o1', …(3) } ]

[Killed] BlockStatement
src/deltas.ts:177:20
         atomDeltaFor(atomDeltas, arrow.source.atomId).nonbondingElectrons -= electrons;
         break;
       }
-      case "bond": {
-        const ends = bondEnds.get(arrow.source.bondId);
-        if (ends === undefined) {
-          throw new Error(
-            `Arrow ${arrow.id} sources bond ${arrow.source.bondId}, which is not in state ${state.id}`,
-          );
-        }
-        bumpBond(bondDeltas, atomPairKey(ends[0], ends[1]), -electrons);
-        break;
-      }
+      case "bond": {}
     }
 
killedBy: declaredDeltas takes electrons out of a bond source and lands them on the sink atom
statusReason: expected [] to deeply equal [ { atomIds: [ 'c1', 'cl1' ], …(1) } ]

[Killed] ConditionalExpression
src/deltas.ts:177:7
         atomDeltaFor(atomDeltas, arrow.source.atomId).nonbondingElectrons -= electrons;
         break;
       }
-      case "bond": {
-        const ends = bondEnds.get(arrow.source.bondId);
-        if (ends === undefined) {
-          throw new Error(
-            `Arrow ${arrow.id} sources bond ${arrow.source.bondId}, which is not in state ${state.id}`,
-          );
-        }
-        bumpBond(bondDeltas, atomPairKey(ends[0], ends[1]), -electrons);
-        break;
-      }
+      case "bond":
     }
 
killedBy: declaredDeltas takes electrons out of a bond source and lands them on the sink atom
statusReason: expected [] to deeply equal [ { atomIds: [ 'c1', 'cl1' ], …(1) } ]

[Killed] EqualityOperator
src/deltas.ts:179:13
       }
       case "bond": {
         const ends = bondEnds.get(arrow.source.bondId);
-        if (ends === undefined) {
+        if (ends !== undefined) {
           throw new Error(
             `Arrow ${arrow.id} sources bond ${arrow.source.bondId}, which is not in state ${state.id}`,
killedBy: declaredDeltas takes electrons out of a bond source and lands them on the sink atom
statusReason: Arrow a2 sources bond b1, which is not in state st-0

[Killed] BlockStatement
src/deltas.ts:179:33
       }
       case "bond": {
         const ends = bondEnds.get(arrow.source.bondId);
-        if (ends === undefined) {
-          throw new Error(
-            `Arrow ${arrow.id} sources bond ${arrow.source.bondId}, which is not in state ${state.id}`,
-          );
-        }
+        if (ends === undefined) {}
         bumpBond(bondDeltas, atomPairKey(ends[0], ends[1]), -electrons);
         break;
killedBy: declaredDeltas throws when an arrow sources a bond that is not in the state
statusReason: expected [Function] to throw error matching /b-absent/ but got 'Cannot read properties of undefined (…'

[Killed] StringLiteral
src/deltas.ts:181:13
         const ends = bondEnds.get(arrow.source.bondId);
         if (ends === undefined) {
           throw new Error(
-            `Arrow ${arrow.id} sources bond ${arrow.source.bondId}, which is not in state ${state.id}`,
+            ``,
           );
         }
killedBy: declaredDeltas throws when an arrow sources a bond that is not in the state
statusReason: expected [Function] to throw error matching /b-absent/ but got ''

[Killed] UnaryOperator
src/deltas.ts:184:61
             `Arrow ${arrow.id} sources bond ${arrow.source.bondId}, which is not in state ${state.id}`,
           );
         }
-        bumpBond(bondDeltas, atomPairKey(ends[0], ends[1]), -electrons);
+        bumpBond(bondDeltas, atomPairKey(ends[0], ends[1]), +electrons);
         break;
       }
killedBy: declaredDeltas takes electrons out of a bond source and lands them on the sink atom
statusReason: expected [ { atomIds: [ 'c1', 'cl1' ], …(1) } ] to deeply equal [ { atomIds: [ 'c1', 'cl1' ], …(1) } ]

[Killed] BlockStatement
src/deltas.ts:190:20
     }
 
     switch (arrow.sink.kind) {
-      case "atom": {
-        atomDeltaFor(atomDeltas, arrow.sink.atomId).nonbondingElectrons += electrons;
-        break;
-      }
+      case "atom": {}
       case "betweenAtoms": {
         const [a, b] = arrow.sink.atomIds;
killedBy: declaredDeltas takes electrons out of a bond source and lands them on the sink atom
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ConditionalExpression
src/deltas.ts:190:7
     }
 
     switch (arrow.sink.kind) {
-      case "atom": {
-        atomDeltaFor(atomDeltas, arrow.sink.atomId).nonbondingElectrons += electrons;
-        break;
-      }
+      case "atom":
       case "betweenAtoms": {
         const [a, b] = arrow.sink.atomIds;
killedBy: declaredDeltas takes electrons out of a bond source and lands them on the sink atom
statusReason: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] AssignmentOperator
src/deltas.ts:191:9
 
     switch (arrow.sink.kind) {
       case "atom": {
-        atomDeltaFor(atomDeltas, arrow.sink.atomId).nonbondingElectrons += electrons;
+        atomDeltaFor(atomDeltas, arrow.sink.atomId).nonbondingElectrons -= electrons;
         break;
       }
killedBy: declaredDeltas takes electrons out of a bond source and lands them on the sink atom
statusReason: expected [ { atomId: 'cl1', …(3) } ] to deeply equal [ { atomId: 'cl1', …(3) } ]

[Killed] BlockStatement
src/deltas.ts:194:28
         atomDeltaFor(atomDeltas, arrow.sink.atomId).nonbondingElectrons += electrons;
         break;
       }
-      case "betweenAtoms": {
-        const [a, b] = arrow.sink.atomIds;
-        bumpBond(bondDeltas, atomPairKey(a, b), electrons);
-        break;
-      }
+      case "betweenAtoms": {}
     }
   }
killedBy: declaredDeltas puts electrons into the bond a betweenAtoms sink names
statusReason: expected [] to deeply equal [ { atomIds: [ 'c1', 'o1' ], …(1) } ]

[Killed] ConditionalExpression
src/deltas.ts:194:7
         atomDeltaFor(atomDeltas, arrow.sink.atomId).nonbondingElectrons += electrons;
         break;
       }
-      case "betweenAtoms": {
-        const [a, b] = arrow.sink.atomIds;
-        bumpBond(bondDeltas, atomPairKey(a, b), electrons);
-        break;
-      }
+      case "betweenAtoms":
     }
   }
killedBy: declaredDeltas puts electrons into the bond a betweenAtoms sink names
statusReason: expected [] to deeply equal [ { atomIds: [ 'c1', 'o1' ], …(1) } ]

[Killed] ArrayDeclaration
src/deltas.ts:202:43
     }
   }
 
-  return assemble(atomDeltas, bondDeltas, [], []);
+  return assemble(atomDeltas, bondDeltas, ["Stryker was here"], []);
 }
 
killedBy: declaredDeltas declares no atoms added or removed
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/deltas.ts:221:46
   const atomsRemoved: AtomId[] = [];
   const atomsAdded: AtomId[] = [];
 
-  for (const [atomId, beforeAtom] of before) {
-    const afterAtom = after.get(atomId);
-    if (afterAtom === undefined) {
-      atomsRemoved.push(atomId);
-      continue;
-    }
-    const delta = atomDeltaFor(atomDeltas, atomId);
-    delta.nonbondingElectrons = nonbondingElectrons(afterAtom) - nonbondingElectrons(beforeAtom);
-    delta.implicitHydrogens = afterAtom.implicitHydrogens - beforeAtom.implicitHydrogens;
-    delta.formalCharge = afterAtom.formalCharge - beforeAtom.formalCharge;
-  }
+  for (const [atomId, beforeAtom] of before) {}
 
   for (const atomId of after.keys()) {
killedBy: observedDeltas reports the nonbonding change on each atom
statusReason: expected undefined to be -2 // Object.is equality

[Killed] BlockStatement
src/deltas.ts:223:34
 
   for (const [atomId, beforeAtom] of before) {
     const afterAtom = after.get(atomId);
-    if (afterAtom === undefined) {
-      atomsRemoved.push(atomId);
-      continue;
-    }
+    if (afterAtom === undefined) {}
     const delta = atomDeltaFor(atomDeltas, atomId);
     delta.nonbondingElectrons = nonbondingElectrons(afterAtom) - nonbondingElectrons(beforeAtom);
killedBy: observedDeltas lists an atom present only in `from` as removed, not as changed
statusReason: Cannot read properties of undefined (reading 'lonePairs')

[Killed] ConditionalExpression
src/deltas.ts:223:9
 
   for (const [atomId, beforeAtom] of before) {
     const afterAtom = after.get(atomId);
-    if (afterAtom === undefined) {
+    if (false) {
       atomsRemoved.push(atomId);
       continue;
killedBy: observedDeltas lists an atom present only in `from` as removed, not as changed
statusReason: Cannot read properties of undefined (reading 'lonePairs')

[Killed] ArithmeticOperator
src/deltas.ts:228:33
       continue;
     }
     const delta = atomDeltaFor(atomDeltas, atomId);
-    delta.nonbondingElectrons = nonbondingElectrons(afterAtom) - nonbondingElectrons(beforeAtom);
+    delta.nonbondingElectrons = nonbondingElectrons(afterAtom) + nonbondingElectrons(beforeAtom);
     delta.implicitHydrogens = afterAtom.implicitHydrogens - beforeAtom.implicitHydrogens;
     delta.formalCharge = afterAtom.formalCharge - beforeAtom.formalCharge;
killedBy: observedDeltas reports the nonbonding change on each atom
statusReason: expected 10 to be -2 // Object.is equality

[Killed] ArithmeticOperator
src/deltas.ts:229:31
     }
     const delta = atomDeltaFor(atomDeltas, atomId);
     delta.nonbondingElectrons = nonbondingElectrons(afterAtom) - nonbondingElectrons(beforeAtom);
-    delta.implicitHydrogens = afterAtom.implicitHydrogens - beforeAtom.implicitHydrogens;
+    delta.implicitHydrogens = afterAtom.implicitHydrogens + beforeAtom.implicitHydrogens;
     delta.formalCharge = afterAtom.formalCharge - beforeAtom.formalCharge;
   }
killedBy: observedDeltas reports an implicit hydrogen change, which no arrow can account for
statusReason: expected 1 to be -1 // Object.is equality

[Killed] ArithmeticOperator
src/deltas.ts:230:26
     const delta = atomDeltaFor(atomDeltas, atomId);
     delta.nonbondingElectrons = nonbondingElectrons(afterAtom) - nonbondingElectrons(beforeAtom);
     delta.implicitHydrogens = afterAtom.implicitHydrogens - beforeAtom.implicitHydrogens;
-    delta.formalCharge = afterAtom.formalCharge - beforeAtom.formalCharge;
+    delta.formalCharge = afterAtom.formalCharge + beforeAtom.formalCharge;
   }
 
killedBy: observedDeltas reports the formal charge change, which it carries but never asserts
statusReason: expected -1 to be 1 // Object.is equality

[Killed] BlockStatement
src/deltas.ts:233:38
     delta.formalCharge = afterAtom.formalCharge - beforeAtom.formalCharge;
   }
 
-  for (const atomId of after.keys()) {
-    if (!before.has(atomId)) {
-      atomsAdded.push(atomId);
-    }
-  }
+  for (const atomId of after.keys()) {}
 
   const bondsBefore = collectBondElectrons(from);
killedBy: observedDeltas lists an atom present only in `to` as added
statusReason: expected [] to deeply equal [ 'n1' ]

[Killed] ConditionalExpression
src/deltas.ts:234:9
   }
 
   for (const atomId of after.keys()) {
-    if (!before.has(atomId)) {
+    if (false) {
       atomsAdded.push(atomId);
     }
killedBy: observedDeltas lists an atom present only in `to` as added
statusReason: expected [] to deeply equal [ 'n1' ]

[Killed] BlockStatement
src/deltas.ts:234:30
   }
 
   for (const atomId of after.keys()) {
-    if (!before.has(atomId)) {
-      atomsAdded.push(atomId);
-    }
+    if (!before.has(atomId)) {}
   }
 
killedBy: observedDeltas lists an atom present only in `to` as added
statusReason: expected [] to deeply equal [ 'n1' ]
