[Killed] BlockStatement
src/deltas.ts:243:27
   const bondsAfter = collectBondElectrons(to);
   const bondDeltas = new Map<string, number>();
   const keys = new Set<string>([...bondsBefore.keys(), ...bondsAfter.keys()]);
-  for (const key of keys) {
-    bondDeltas.set(key, (bondsAfter.get(key) ?? 0) - (bondsBefore.get(key) ?? 0));
-  }
+  for (const key of keys) {}
 
   atomsRemoved.sort();
killedBy: observedDeltas reports a bond broken as minus two electrons and a bond formed as plus two
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] LogicalOperator
src/deltas.ts:244:55
   const bondDeltas = new Map<string, number>();
   const keys = new Set<string>([...bondsBefore.keys(), ...bondsAfter.keys()]);
   for (const key of keys) {
-    bondDeltas.set(key, (bondsAfter.get(key) ?? 0) - (bondsBefore.get(key) ?? 0));
+    bondDeltas.set(key, (bondsAfter.get(key) ?? 0) - (bondsBefore.get(key) && 0));
   }
 
killedBy: assemble keeps an atom that changed in exactly one way drops a bond whose electron count did not change
statusReason: expected [ { atomIds: [ 'c1', 'cl1' ], …(1) } ] to deeply equal []

[Killed] ArithmeticOperator
src/deltas.ts:244:25
   const bondDeltas = new Map<string, number>();
   const keys = new Set<string>([...bondsBefore.keys(), ...bondsAfter.keys()]);
   for (const key of keys) {
-    bondDeltas.set(key, (bondsAfter.get(key) ?? 0) - (bondsBefore.get(key) ?? 0));
+    bondDeltas.set(key, (bondsAfter.get(key) ?? 0) + (bondsBefore.get(key) ?? 0));
   }
 
killedBy: observedDeltas reports a bond broken as minus two electrons and a bond formed as plus two
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] MethodExpression
src/deltas.ts:247:3
     bondDeltas.set(key, (bondsAfter.get(key) ?? 0) - (bondsBefore.get(key) ?? 0));
   }
 
-  atomsRemoved.sort();
+  atomsRemoved;
   atomsAdded.sort();
 
killedBy: observedDeltas sorts added and removed atom ids
statusReason: expected [ 'z1', 'a1' ] to deeply equal [ 'a1', 'z1' ]

[Killed] MethodExpression
src/deltas.ts:248:3
   }
 
   atomsRemoved.sort();
-  atomsAdded.sort();
+  atomsAdded;
 
   return assemble(atomDeltas, bondDeltas, atomsRemoved, atomsAdded);
killedBy: observedDeltas sorts added and removed atom ids
statusReason: expected [ 'z2', 'a2' ] to deeply equal [ 'a2', 'z2' ]

[Killed] ArrowFunction
src/deltas.ts:287:24
   const mismatches: DeltaMismatch[] = [];
 
   const declaredAtoms = new Map<AtomId, AtomElectronDelta>(
-    declared.atoms.map((delta) => [delta.atomId, delta]),
+    declared.atoms.map(() => undefined),
   );
   const observedAtoms = new Map<AtomId, AtomElectronDelta>(
killedBy: deltaMismatches is empty when the arrows fully account for the structural change
statusReason: Iterator value undefined is not an entry object

[Killed] ArrowFunction
src/deltas.ts:290:24
     declared.atoms.map((delta) => [delta.atomId, delta]),
   );
   const observedAtoms = new Map<AtomId, AtomElectronDelta>(
-    observed.atoms.map((delta) => [delta.atomId, delta]),
+    observed.atoms.map(() => undefined),
   );
 
killedBy: deltaMismatches is empty when the arrows fully account for the structural change
statusReason: Iterator value undefined is not an entry object

[Killed] BlockStatement
src/deltas.ts:293:93
     observed.atoms.map((delta) => [delta.atomId, delta]),
   );
 
-  for (const atomId of new Set<AtomId>([...declaredAtoms.keys(), ...observedAtoms.keys()])) {
-    const declaredAtom = declaredAtoms.get(atomId);
-    const observedAtom = observedAtoms.get(atomId);
-    const declaredNonbonding = declaredAtom?.nonbondingElectrons ?? 0;
-    const observedNonbonding = observedAtom?.nonbondingElectrons ?? 0;
-    if (declaredNonbonding !== observedNonbonding) {
-      mismatches.push({
-        target: { kind: "atom", atomId },
-        quantity: "nonbondingElectrons",
-        declared: declaredNonbonding,
-        observed: observedNonbonding,
-      });
-    }
-    const observedHydrogens = observedAtom?.implicitHydrogens ?? 0;
-    if (observedHydrogens !== 0) {
-      mismatches.push({
-        target: { kind: "atom", atomId },
-        quantity: "implicitHydrogens",
-        declared: 0,
-        observed: observedHydrogens,
-      });
-    }
-  }
+  for (const atomId of new Set<AtomId>([...declaredAtoms.keys(), ...observedAtoms.keys()])) {}
 
   const declaredBonds = new Map<string, number>(
killedBy: deltaMismatches reports a nonbonding change the arrows did not claim
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/deltas.ts:296:32
   for (const atomId of new Set<AtomId>([...declaredAtoms.keys(), ...observedAtoms.keys()])) {
     const declaredAtom = declaredAtoms.get(atomId);
     const observedAtom = observedAtoms.get(atomId);
-    const declaredNonbonding = declaredAtom?.nonbondingElectrons ?? 0;
+    const declaredNonbonding = declaredAtom?.nonbondingElectrons && 0;
     const observedNonbonding = observedAtom?.nonbondingElectrons ?? 0;
     if (declaredNonbonding !== observedNonbonding) {
killedBy: deltaMismatches is empty when the arrows fully account for the structural change
statusReason: expected [ { target: { …(2) }, …(3) }, …(1) ] to deeply equal []

[Killed] OptionalChaining
src/deltas.ts:296:32
   for (const atomId of new Set<AtomId>([...declaredAtoms.keys(), ...observedAtoms.keys()])) {
     const declaredAtom = declaredAtoms.get(atomId);
     const observedAtom = observedAtoms.get(atomId);
-    const declaredNonbonding = declaredAtom?.nonbondingElectrons ?? 0;
+    const declaredNonbonding = declaredAtom.nonbondingElectrons ?? 0;
     const observedNonbonding = observedAtom?.nonbondingElectrons ?? 0;
     if (declaredNonbonding !== observedNonbonding) {
killedBy: deltaMismatches reports a bond that changed with no arrow to explain it
statusReason: Cannot read properties of undefined (reading 'nonbondingElectrons')

[Killed] LogicalOperator
src/deltas.ts:297:32
     const declaredAtom = declaredAtoms.get(atomId);
     const observedAtom = observedAtoms.get(atomId);
     const declaredNonbonding = declaredAtom?.nonbondingElectrons ?? 0;
-    const observedNonbonding = observedAtom?.nonbondingElectrons ?? 0;
+    const observedNonbonding = observedAtom?.nonbondingElectrons && 0;
     if (declaredNonbonding !== observedNonbonding) {
       mismatches.push({
killedBy: deltaMismatches is empty when the arrows fully account for the structural change
statusReason: expected [ { target: { …(2) }, …(3) }, …(1) ] to deeply equal []

[Killed] OptionalChaining
src/deltas.ts:297:32
     const declaredAtom = declaredAtoms.get(atomId);
     const observedAtom = observedAtoms.get(atomId);
     const declaredNonbonding = declaredAtom?.nonbondingElectrons ?? 0;
-    const observedNonbonding = observedAtom?.nonbondingElectrons ?? 0;
+    const observedNonbonding = observedAtom.nonbondingElectrons ?? 0;
     if (declaredNonbonding !== observedNonbonding) {
       mismatches.push({
killedBy: deltaMismatches reports a claim the states do not show
statusReason: Cannot read properties of undefined (reading 'nonbondingElectrons')

[Killed] BlockStatement
src/deltas.ts:298:52
     const observedAtom = observedAtoms.get(atomId);
     const declaredNonbonding = declaredAtom?.nonbondingElectrons ?? 0;
     const observedNonbonding = observedAtom?.nonbondingElectrons ?? 0;
-    if (declaredNonbonding !== observedNonbonding) {
-      mismatches.push({
-        target: { kind: "atom", atomId },
-        quantity: "nonbondingElectrons",
-        declared: declaredNonbonding,
-        observed: observedNonbonding,
-      });
-    }
+    if (declaredNonbonding !== observedNonbonding) {}
     const observedHydrogens = observedAtom?.implicitHydrogens ?? 0;
     if (observedHydrogens !== 0) {
killedBy: deltaMismatches reports a nonbonding change the arrows did not claim
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/deltas.ts:298:9
     const observedAtom = observedAtoms.get(atomId);
     const declaredNonbonding = declaredAtom?.nonbondingElectrons ?? 0;
     const observedNonbonding = observedAtom?.nonbondingElectrons ?? 0;
-    if (declaredNonbonding !== observedNonbonding) {
+    if (false) {
       mismatches.push({
         target: { kind: "atom", atomId },
killedBy: deltaMismatches reports a nonbonding change the arrows did not claim
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
src/deltas.ts:299:23
     const declaredNonbonding = declaredAtom?.nonbondingElectrons ?? 0;
     const observedNonbonding = observedAtom?.nonbondingElectrons ?? 0;
     if (declaredNonbonding !== observedNonbonding) {
-      mismatches.push({
-        target: { kind: "atom", atomId },
-        quantity: "nonbondingElectrons",
-        declared: declaredNonbonding,
-        observed: observedNonbonding,
-      });
+      mismatches.push({});
     }
     const observedHydrogens = observedAtom?.implicitHydrogens ?? 0;
killedBy: deltaMismatches reports a bond that changed with no arrow to explain it
statusReason: Cannot read properties of undefined (reading 'kind')

[Killed] ObjectLiteral
src/deltas.ts:300:17
     const observedNonbonding = observedAtom?.nonbondingElectrons ?? 0;
     if (declaredNonbonding !== observedNonbonding) {
       mismatches.push({
-        target: { kind: "atom", atomId },
+        target: {},
         quantity: "nonbondingElectrons",
         declared: declaredNonbonding,
killedBy: a mismatch says exactly what it is about points at the atom by id when nonbonding electrons disagree
statusReason: expected undefined to deeply equal { kind: 'atom', atomId: 'o1' }

[Killed] LogicalOperator
src/deltas.ts:306:31
         observed: observedNonbonding,
       });
     }
-    const observedHydrogens = observedAtom?.implicitHydrogens ?? 0;
+    const observedHydrogens = observedAtom?.implicitHydrogens && 0;
     if (observedHydrogens !== 0) {
       mismatches.push({
killedBy: deltaMismatches reports a claim the states do not show
statusReason: expected undefined to be +0 // Object.is equality

[Killed] OptionalChaining
src/deltas.ts:306:31
         observed: observedNonbonding,
       });
     }
-    const observedHydrogens = observedAtom?.implicitHydrogens ?? 0;
+    const observedHydrogens = observedAtom.implicitHydrogens ?? 0;
     if (observedHydrogens !== 0) {
       mismatches.push({
killedBy: deltaMismatches reports a claim the states do not show
statusReason: Cannot read properties of undefined (reading 'implicitHydrogens')

[Killed] EqualityOperator
src/deltas.ts:307:9
       });
     }
     const observedHydrogens = observedAtom?.implicitHydrogens ?? 0;
-    if (observedHydrogens !== 0) {
+    if (observedHydrogens === 0) {
       mismatches.push({
         target: { kind: "atom", atomId },
killedBy: deltaMismatches is empty when the arrows fully account for the structural change
statusReason: expected [ { target: { …(2) }, …(3) }, …(1) ] to deeply equal []

[Killed] ConditionalExpression
src/deltas.ts:307:9
       });
     }
     const observedHydrogens = observedAtom?.implicitHydrogens ?? 0;
-    if (observedHydrogens !== 0) {
+    if (false) {
       mismatches.push({
         target: { kind: "atom", atomId },
killedBy: deltaMismatches always reports an implicit hydrogen change, because declared is always zero
statusReason: expected undefined to be +0 // Object.is equality

[Killed] StringLiteral
src/deltas.ts:310:19
     if (observedHydrogens !== 0) {
       mismatches.push({
         target: { kind: "atom", atomId },
-        quantity: "implicitHydrogens",
+        quantity: "",
         declared: 0,
         observed: observedHydrogens,
killedBy: deltaMismatches always reports an implicit hydrogen change, because declared is always zero
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ArrowFunction
src/deltas.ts:318:24
   }
 
   const declaredBonds = new Map<string, number>(
-    declared.bonds.map((delta) => [atomPairKey(delta.atomIds[0], delta.atomIds[1]), delta.electrons]),
+    declared.bonds.map(() => undefined),
   );
   const observedBonds = new Map<string, number>(
killedBy: deltaMismatches is empty when the arrows fully account for the structural change
statusReason: Iterator value undefined is not an entry object

[Killed] ArrowFunction
src/deltas.ts:321:24
     declared.bonds.map((delta) => [atomPairKey(delta.atomIds[0], delta.atomIds[1]), delta.electrons]),
   );
   const observedBonds = new Map<string, number>(
-    observed.bonds.map((delta) => [atomPairKey(delta.atomIds[0], delta.atomIds[1]), delta.electrons]),
+    observed.bonds.map(() => undefined),
   );
 
killedBy: deltaMismatches is empty when the arrows fully account for the structural change
statusReason: Iterator value undefined is not an entry object

[Killed] ArrayDeclaration
src/deltas.ts:321:35
     declared.bonds.map((delta) => [atomPairKey(delta.atomIds[0], delta.atomIds[1]), delta.electrons]),
   );
   const observedBonds = new Map<string, number>(
-    observed.bonds.map((delta) => [atomPairKey(delta.atomIds[0], delta.atomIds[1]), delta.electrons]),
+    observed.bonds.map((delta) => []),
   );
 
killedBy: deltaMismatches is empty when the arrows fully account for the structural change
statusReason: expected [ { target: { …(2) }, …(3) }, …(1) ] to deeply equal []

[Killed] BlockStatement
src/deltas.ts:324:90
     observed.bonds.map((delta) => [atomPairKey(delta.atomIds[0], delta.atomIds[1]), delta.electrons]),
   );
 
-  for (const key of new Set<string>([...declaredBonds.keys(), ...observedBonds.keys()])) {
-    const declaredElectrons = declaredBonds.get(key) ?? 0;
-    const observedElectrons = observedBonds.get(key) ?? 0;
-    if (declaredElectrons !== observedElectrons) {
-      mismatches.push({
-        target: { kind: "atomPair", atomIds: parseAtomPairKey(key) },
-        quantity: "bondingElectrons",
-        declared: declaredElectrons,
-        observed: observedElectrons,
-      });
-    }
-  }
+  for (const key of new Set<string>([...declaredBonds.keys(), ...observedBonds.keys()])) {}
 
   return Object.freeze(mismatches);
killedBy: deltaMismatches reports a bond that changed with no arrow to explain it
statusReason: expected undefined to be +0 // Object.is equality

[Killed] LogicalOperator
src/deltas.ts:325:31
   );
 
   for (const key of new Set<string>([...declaredBonds.keys(), ...observedBonds.keys()])) {
-    const declaredElectrons = declaredBonds.get(key) ?? 0;
+    const declaredElectrons = declaredBonds.get(key) && 0;
     const observedElectrons = observedBonds.get(key) ?? 0;
     if (declaredElectrons !== observedElectrons) {
killedBy: deltaMismatches is empty when the arrows fully account for the structural change
statusReason: expected [ { target: { …(2) }, …(3) }, …(1) ] to deeply equal []

[Killed] LogicalOperator
src/deltas.ts:326:31
 
   for (const key of new Set<string>([...declaredBonds.keys(), ...observedBonds.keys()])) {
     const declaredElectrons = declaredBonds.get(key) ?? 0;
-    const observedElectrons = observedBonds.get(key) ?? 0;
+    const observedElectrons = observedBonds.get(key) && 0;
     if (declaredElectrons !== observedElectrons) {
       mismatches.push({
killedBy: deltaMismatches is empty when the arrows fully account for the structural change
statusReason: expected [ { target: { …(2) }, …(3) }, …(1) ] to deeply equal []

[Killed] EqualityOperator
src/deltas.ts:327:9
   for (const key of new Set<string>([...declaredBonds.keys(), ...observedBonds.keys()])) {
     const declaredElectrons = declaredBonds.get(key) ?? 0;
     const observedElectrons = observedBonds.get(key) ?? 0;
-    if (declaredElectrons !== observedElectrons) {
+    if (declaredElectrons === observedElectrons) {
       mismatches.push({
         target: { kind: "atomPair", atomIds: parseAtomPairKey(key) },
killedBy: deltaMismatches is empty when the arrows fully account for the structural change
statusReason: expected [ { target: { …(2) }, …(3) }, …(1) ] to deeply equal []

[Killed] ConditionalExpression
src/deltas.ts:327:9
   for (const key of new Set<string>([...declaredBonds.keys(), ...observedBonds.keys()])) {
     const declaredElectrons = declaredBonds.get(key) ?? 0;
     const observedElectrons = observedBonds.get(key) ?? 0;
-    if (declaredElectrons !== observedElectrons) {
+    if (true) {
       mismatches.push({
         target: { kind: "atomPair", atomIds: parseAtomPairKey(key) },
killedBy: deltaMismatches is empty when the arrows fully account for the structural change
statusReason: expected [ { target: { …(2) }, …(3) }, …(1) ] to deeply equal []

[Killed] ObjectLiteral
src/deltas.ts:329:17
     const observedElectrons = observedBonds.get(key) ?? 0;
     if (declaredElectrons !== observedElectrons) {
       mismatches.push({
-        target: { kind: "atomPair", atomIds: parseAtomPairKey(key) },
+        target: {},
         quantity: "bondingElectrons",
         declared: declaredElectrons,
killedBy: deltaMismatches reports a bond that changed with no arrow to explain it
statusReason: expected undefined to be +0 // Object.is equality

[Killed] StringLiteral
src/deltas.ts:330:19
     if (declaredElectrons !== observedElectrons) {
       mismatches.push({
         target: { kind: "atomPair", atomIds: parseAtomPairKey(key) },
-        quantity: "bondingElectrons",
+        quantity: "",
         declared: declaredElectrons,
         observed: observedElectrons,
killedBy: deltaMismatches reports a bond that changed with no arrow to explain it
statusReason: expected undefined to be +0 // Object.is equality
