[Killed] BlockStatement
src/edit.ts:50:94
  */
 export type ClearableAtomField = "isotope" | "stereo" | "geometry";
 
-function patchAtom(atom: Atom, patch: AtomPatch, clear: readonly ClearableAtomField[]): Atom {
-  const clears = new Set<ClearableAtomField>(clear);
-
-  const isotope = clears.has("isotope") ? undefined : (patch.isotope ?? atom.isotope);
-  const stereo = clears.has("stereo") ? undefined : (patch.stereo ?? atom.stereo);
-  const geometry = clears.has("geometry") ? undefined : (patch.geometry ?? atom.geometry);
-
-  return Object.freeze({
-    id: atom.id,
-    element: atom.element,
-    formalCharge: patch.formalCharge ?? atom.formalCharge,
-    lonePairs: patch.lonePairs ?? atom.lonePairs,
-    unpairedElectrons: patch.unpairedElectrons ?? atom.unpairedElectrons,
-    implicitHydrogens: patch.implicitHydrogens ?? atom.implicitHydrogens,
-    ...(isotope === undefined ? {} : { isotope }),
-    ...(stereo === undefined ? {} : { stereo }),
-    ...(geometry === undefined ? {} : { geometry }),
-  });
-}
+function patchAtom(atom: Atom, patch: AtomPatch, clear: readonly ClearableAtomField[]): Atom {}
 
 function rebuildSpecies(
killedBy: withAtomPatch changes only the fields the patch names
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
src/edit.ts:53:56
 function patchAtom(atom: Atom, patch: AtomPatch, clear: readonly ClearableAtomField[]): Atom {
   const clears = new Set<ClearableAtomField>(clear);
 
-  const isotope = clears.has("isotope") ? undefined : (patch.isotope ?? atom.isotope);
+  const isotope = clears.has("isotope") ? undefined : (patch.isotope && atom.isotope);
   const stereo = clears.has("stereo") ? undefined : (patch.stereo ?? atom.stereo);
   const geometry = clears.has("geometry") ? undefined : (patch.geometry ?? atom.geometry);
killedBy: withAtomPatch keeps an unpatched optional field rather than dropping it
statusReason: expected undefined to be 13 // Object.is equality

[Killed] LogicalOperator
src/edit.ts:54:54
   const clears = new Set<ClearableAtomField>(clear);
 
   const isotope = clears.has("isotope") ? undefined : (patch.isotope ?? atom.isotope);
-  const stereo = clears.has("stereo") ? undefined : (patch.stereo ?? atom.stereo);
+  const stereo = clears.has("stereo") ? undefined : (patch.stereo && atom.stereo);
   const geometry = clears.has("geometry") ? undefined : (patch.geometry ?? atom.geometry);
 
killedBy: withAtomPatch keeps an unpatched optional field rather than dropping it
statusReason: expected undefined to deeply equal { kind: 'tetrahedral', …(2) }

[Killed] LogicalOperator
src/edit.ts:55:58
 
   const isotope = clears.has("isotope") ? undefined : (patch.isotope ?? atom.isotope);
   const stereo = clears.has("stereo") ? undefined : (patch.stereo ?? atom.stereo);
-  const geometry = clears.has("geometry") ? undefined : (patch.geometry ?? atom.geometry);
+  const geometry = clears.has("geometry") ? undefined : (patch.geometry && atom.geometry);
 
   return Object.freeze({
killedBy: withAtomPatch keeps an unpatched optional field rather than dropping it
statusReason: expected undefined to deeply equal { x: +0, y: +0, z: +0 }

[Killed] LogicalOperator
src/edit.ts:60:19
   return Object.freeze({
     id: atom.id,
     element: atom.element,
-    formalCharge: patch.formalCharge ?? atom.formalCharge,
+    formalCharge: patch.formalCharge && atom.formalCharge,
     lonePairs: patch.lonePairs ?? atom.lonePairs,
     unpairedElectrons: patch.unpairedElectrons ?? atom.unpairedElectrons,
killedBy: withAtomPatch changes only the fields the patch names
statusReason: expected +0 to be -1 // Object.is equality

[Killed] LogicalOperator
src/edit.ts:61:16
     id: atom.id,
     element: atom.element,
     formalCharge: patch.formalCharge ?? atom.formalCharge,
-    lonePairs: patch.lonePairs ?? atom.lonePairs,
+    lonePairs: patch.lonePairs && atom.lonePairs,
     unpairedElectrons: patch.unpairedElectrons ?? atom.unpairedElectrons,
     implicitHydrogens: patch.implicitHydrogens ?? atom.implicitHydrogens,
killedBy: withAtomPatch changes only the fields the patch names
statusReason: expected 3 to be 4 // Object.is equality

[Killed] LogicalOperator
src/edit.ts:62:24
     element: atom.element,
     formalCharge: patch.formalCharge ?? atom.formalCharge,
     lonePairs: patch.lonePairs ?? atom.lonePairs,
-    unpairedElectrons: patch.unpairedElectrons ?? atom.unpairedElectrons,
+    unpairedElectrons: patch.unpairedElectrons && atom.unpairedElectrons,
     implicitHydrogens: patch.implicitHydrogens ?? atom.implicitHydrogens,
     ...(isotope === undefined ? {} : { isotope }),
killedBy: a patch that raises a count from zero still applies turns a closed shell atom into a radical
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/edit.ts:63:24
     formalCharge: patch.formalCharge ?? atom.formalCharge,
     lonePairs: patch.lonePairs ?? atom.lonePairs,
     unpairedElectrons: patch.unpairedElectrons ?? atom.unpairedElectrons,
-    implicitHydrogens: patch.implicitHydrogens ?? atom.implicitHydrogens,
+    implicitHydrogens: patch.implicitHydrogens && atom.implicitHydrogens,
     ...(isotope === undefined ? {} : { isotope }),
     ...(stereo === undefined ? {} : { stereo }),
killedBy: withAtomPatch changes only the fields the patch names
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/edit.ts:64:9
     lonePairs: patch.lonePairs ?? atom.lonePairs,
     unpairedElectrons: patch.unpairedElectrons ?? atom.unpairedElectrons,
     implicitHydrogens: patch.implicitHydrogens ?? atom.implicitHydrogens,
-    ...(isotope === undefined ? {} : { isotope }),
+    ...(false ? {} : { isotope }),
     ...(stereo === undefined ? {} : { stereo }),
     ...(geometry === undefined ? {} : { geometry }),
killedBy: withAtomPatch clears every field named, and only those
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/edit.ts:64:9
     lonePairs: patch.lonePairs ?? atom.lonePairs,
     unpairedElectrons: patch.unpairedElectrons ?? atom.unpairedElectrons,
     implicitHydrogens: patch.implicitHydrogens ?? atom.implicitHydrogens,
-    ...(isotope === undefined ? {} : { isotope }),
+    ...(isotope !== undefined ? {} : { isotope }),
     ...(stereo === undefined ? {} : { stereo }),
     ...(geometry === undefined ? {} : { geometry }),
killedBy: withAtomPatch keeps an unpatched optional field rather than dropping it
statusReason: expected undefined to be 13 // Object.is equality

[Killed] ConditionalExpression
src/edit.ts:65:9
     unpairedElectrons: patch.unpairedElectrons ?? atom.unpairedElectrons,
     implicitHydrogens: patch.implicitHydrogens ?? atom.implicitHydrogens,
     ...(isotope === undefined ? {} : { isotope }),
-    ...(stereo === undefined ? {} : { stereo }),
+    ...(false ? {} : { stereo }),
     ...(geometry === undefined ? {} : { geometry }),
   });
killedBy: withAtomPatch clears a field named in the clear list
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/edit.ts:65:9
     unpairedElectrons: patch.unpairedElectrons ?? atom.unpairedElectrons,
     implicitHydrogens: patch.implicitHydrogens ?? atom.implicitHydrogens,
     ...(isotope === undefined ? {} : { isotope }),
-    ...(stereo === undefined ? {} : { stereo }),
+    ...(true ? {} : { stereo }),
     ...(geometry === undefined ? {} : { geometry }),
   });
killedBy: withAtomPatch keeps an unpatched optional field rather than dropping it
statusReason: expected undefined to deeply equal { kind: 'tetrahedral', …(2) }

[Killed] EqualityOperator
src/edit.ts:66:9
     implicitHydrogens: patch.implicitHydrogens ?? atom.implicitHydrogens,
     ...(isotope === undefined ? {} : { isotope }),
     ...(stereo === undefined ? {} : { stereo }),
-    ...(geometry === undefined ? {} : { geometry }),
+    ...(geometry !== undefined ? {} : { geometry }),
   });
 }
killedBy: withAtomPatch keeps an unpatched optional field rather than dropping it
statusReason: expected undefined to deeply equal { x: +0, y: +0, z: +0 }

[Killed] ConditionalExpression
src/edit.ts:66:9
     implicitHydrogens: patch.implicitHydrogens ?? atom.implicitHydrogens,
     ...(isotope === undefined ? {} : { isotope }),
     ...(stereo === undefined ? {} : { stereo }),
-    ...(geometry === undefined ? {} : { geometry }),
+    ...(false ? {} : { geometry }),
   });
 }
killedBy: withAtomPatch clears every field named, and only those
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/edit.ts:74:12
   species: Species,
   atoms: readonly Atom[],
   bonds: readonly Bond[],
-): Species {
-  return Object.freeze({
-    id: species.id,
-    atoms: Object.freeze([...atoms]),
-    bonds: Object.freeze([...bonds]),
-    ...(species.label === undefined ? {} : { label: species.label }),
-    ...(species.declaredTorsions === undefined
-      ? {}
-      : { declaredTorsions: species.declaredTorsions }),
-  });
-}
+): Species {}
 
 export function withAtomPatch(
killedBy: withAtomPatch changes only the fields the patch names
statusReason: Cannot read properties of undefined (reading 'atoms')

[Killed] EqualityOperator
src/edit.ts:79:9
     id: species.id,
     atoms: Object.freeze([...atoms]),
     bonds: Object.freeze([...bonds]),
-    ...(species.label === undefined ? {} : { label: species.label }),
+    ...(species.label !== undefined ? {} : { label: species.label }),
     ...(species.declaredTorsions === undefined
       ? {}
killedBy: withAtomPatch keeps the species label and declared torsions
statusReason: expected undefined to be 'methane' // Object.is equality

[Killed] ConditionalExpression
src/edit.ts:79:9
     id: species.id,
     atoms: Object.freeze([...atoms]),
     bonds: Object.freeze([...bonds]),
-    ...(species.label === undefined ? {} : { label: species.label }),
+    ...(false ? {} : { label: species.label }),
     ...(species.declaredTorsions === undefined
       ? {}
killedBy: a rebuild carries the optional fields it did not touch leaves a species with no label and no torsions without either field
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/edit.ts:80:9
     atoms: Object.freeze([...atoms]),
     bonds: Object.freeze([...bonds]),
     ...(species.label === undefined ? {} : { label: species.label }),
-    ...(species.declaredTorsions === undefined
+    ...(true
       ? {}
       : { declaredTorsions: species.declaredTorsions }),
killedBy: a rebuild carries the optional fields it did not touch keeps a declared torsion through an atom patch
statusReason: Target cannot be null or undefined.

[Killed] EqualityOperator
src/edit.ts:80:9
     atoms: Object.freeze([...atoms]),
     bonds: Object.freeze([...bonds]),
     ...(species.label === undefined ? {} : { label: species.label }),
-    ...(species.declaredTorsions === undefined
+    ...(species.declaredTorsions !== undefined
       ? {}
       : { declaredTorsions: species.declaredTorsions }),
killedBy: a rebuild carries the optional fields it did not touch keeps a declared torsion through an atom patch
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/edit.ts:91:12
   atomId: AtomId,
   patch: AtomPatch,
   clear: readonly ClearableAtomField[] = [],
-): Species {
-  const target = requireAtom(species, atomId);
-  const patched = patchAtom(target, patch, clear);
-  const atoms = species.atoms.map((atom) => (atom.id === atomId ? patched : atom));
-  return rebuildSpecies(species, atoms, species.bonds);
-}
+): Species {}
 
 export function withAddedAtom(species: Species, atom: Atom): Species {
killedBy: withAtomPatch changes only the fields the patch names
statusReason: Cannot read properties of undefined (reading 'atoms')

[Killed] EqualityOperator
src/edit.ts:94:46
 ): Species {
   const target = requireAtom(species, atomId);
   const patched = patchAtom(target, patch, clear);
-  const atoms = species.atoms.map((atom) => (atom.id === atomId ? patched : atom));
+  const atoms = species.atoms.map((atom) => (atom.id !== atomId ? patched : atom));
   return rebuildSpecies(species, atoms, species.bonds);
 }
killedBy: withAtomPatch leaves the other atoms alone
statusReason: expected undefined to be 3 // Object.is equality

[Killed] ConditionalExpression
src/edit.ts:94:46
 ): Species {
   const target = requireAtom(species, atomId);
   const patched = patchAtom(target, patch, clear);
-  const atoms = species.atoms.map((atom) => (atom.id === atomId ? patched : atom));
+  const atoms = species.atoms.map((atom) => (true ? patched : atom));
   return rebuildSpecies(species, atoms, species.bonds);
 }
killedBy: withAtomPatch leaves the other atoms alone
statusReason: expected undefined to be 3 // Object.is equality

[Killed] BlockStatement
src/edit.ts:98:70
   return rebuildSpecies(species, atoms, species.bonds);
 }
 
-export function withAddedAtom(species: Species, atom: Atom): Species {
-  if (species.atoms.some((existing) => existing.id === atom.id)) {
-    throw new Error(`Species ${species.id} already has an atom ${atom.id}`);
-  }
-  return rebuildSpecies(species, [...species.atoms, atom], species.bonds);
-}
+export function withAddedAtom(species: Species, atom: Atom): Species {}
 
 /** Removes the atom and every bond touching it. */
killedBy: withAddedAtom and withoutAtom appends the atom
statusReason: Cannot read properties of undefined (reading 'atoms')

[Killed] ArrowFunction
src/edit.ts:99:26
 }
 
 export function withAddedAtom(species: Species, atom: Atom): Species {
-  if (species.atoms.some((existing) => existing.id === atom.id)) {
+  if (species.atoms.some(() => undefined)) {
     throw new Error(`Species ${species.id} already has an atom ${atom.id}`);
   }
killedBy: withAddedAtom and withoutAtom refuses an id the species already carries
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/edit.ts:99:40
 }
 
 export function withAddedAtom(species: Species, atom: Atom): Species {
-  if (species.atoms.some((existing) => existing.id === atom.id)) {
+  if (species.atoms.some((existing) => false)) {
     throw new Error(`Species ${species.id} already has an atom ${atom.id}`);
   }
killedBy: withAddedAtom and withoutAtom refuses an id the species already carries
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
src/edit.ts:106:72
 }
 
 /** Removes the atom and every bond touching it. */
-export function withoutAtom(species: Species, atomId: AtomId): Species {
-  const atoms = species.atoms.filter((atom) => atom.id !== atomId);
-  const bonds = species.bonds.filter((bond) => bond.a !== atomId && bond.b !== atomId);
-  return rebuildSpecies(species, atoms, bonds);
-}
+export function withoutAtom(species: Species, atomId: AtomId): Species {}
 
 export function withAddedBond(species: Species, bond: Bond): Species {
killedBy: withAddedAtom and withoutAtom removes the atom and every bond touching it
statusReason: Cannot read properties of undefined (reading 'atoms')

[Killed] ConditionalExpression
src/edit.ts:107:48
 
 /** Removes the atom and every bond touching it. */
 export function withoutAtom(species: Species, atomId: AtomId): Species {
-  const atoms = species.atoms.filter((atom) => atom.id !== atomId);
+  const atoms = species.atoms.filter((atom) => false);
   const bonds = species.bonds.filter((bond) => bond.a !== atomId && bond.b !== atomId);
   return rebuildSpecies(species, atoms, bonds);
killedBy: withAddedAtom and withoutAtom removes the atom and every bond touching it
statusReason: expected [] to deeply equal [ 'c1' ]

[Killed] MethodExpression
src/edit.ts:107:17
 
 /** Removes the atom and every bond touching it. */
 export function withoutAtom(species: Species, atomId: AtomId): Species {
-  const atoms = species.atoms.filter((atom) => atom.id !== atomId);
+  const atoms = species.atoms;
   const bonds = species.bonds.filter((bond) => bond.a !== atomId && bond.b !== atomId);
   return rebuildSpecies(species, atoms, bonds);
killedBy: withAddedAtom and withoutAtom removes the atom and every bond touching it
statusReason: expected [ 'c1', 'cl1' ] to deeply equal [ 'c1' ]

[Killed] ConditionalExpression
src/edit.ts:108:48
 /** Removes the atom and every bond touching it. */
 export function withoutAtom(species: Species, atomId: AtomId): Species {
   const atoms = species.atoms.filter((atom) => atom.id !== atomId);
-  const bonds = species.bonds.filter((bond) => bond.a !== atomId && bond.b !== atomId);
+  const bonds = species.bonds.filter((bond) => false);
   return rebuildSpecies(species, atoms, bonds);
 }
killedBy: withAddedAtom and withoutAtom keeps bonds that do not touch the departing atom
statusReason: expected [] to deeply equal [ 'b1' ]

[Killed] LogicalOperator
src/edit.ts:108:48
 /** Removes the atom and every bond touching it. */
 export function withoutAtom(species: Species, atomId: AtomId): Species {
   const atoms = species.atoms.filter((atom) => atom.id !== atomId);
-  const bonds = species.bonds.filter((bond) => bond.a !== atomId && bond.b !== atomId);
+  const bonds = species.bonds.filter((bond) => bond.a !== atomId || bond.b !== atomId);
   return rebuildSpecies(species, atoms, bonds);
 }
killedBy: withAddedAtom and withoutAtom removes the atom and every bond touching it
statusReason: expected [ { id: 'b1', a: 'c1', …(2) } ] to deeply equal []

[Killed] BlockStatement
src/edit.ts:112:70
   return rebuildSpecies(species, atoms, bonds);
 }
 
-export function withAddedBond(species: Species, bond: Bond): Species {
-  if (species.bonds.some((existing) => existing.id === bond.id)) {
-    throw new Error(`Species ${species.id} already has a bond ${bond.id}`);
-  }
-  return rebuildSpecies(species, species.atoms, [...species.bonds, bond]);
-}
+export function withAddedBond(species: Species, bond: Bond): Species {}
 
 export function withoutBond(species: Species, bondId: BondId): Species {
killedBy: withAddedBond and withoutBond appends the bond
statusReason: Cannot read properties of undefined (reading 'bonds')

[Killed] MethodExpression
src/edit.ts:113:7
 }
 
 export function withAddedBond(species: Species, bond: Bond): Species {
-  if (species.bonds.some((existing) => existing.id === bond.id)) {
+  if (species.bonds.every(existing => existing.id === bond.id)) {
     throw new Error(`Species ${species.id} already has a bond ${bond.id}`);
   }
killedBy: withAddedBond and withoutBond appends the bond
statusReason: Species sp already has a bond b1

[Killed] ConditionalExpression
src/edit.ts:113:7
 }
 
 export function withAddedBond(species: Species, bond: Bond): Species {
-  if (species.bonds.some((existing) => existing.id === bond.id)) {
+  if (true) {
     throw new Error(`Species ${species.id} already has a bond ${bond.id}`);
   }
killedBy: withAddedBond and withoutBond appends the bond
statusReason: Species sp already has a bond b1

[Killed] ArrayDeclaration
src/edit.ts:116:49
   if (species.bonds.some((existing) => existing.id === bond.id)) {
     throw new Error(`Species ${species.id} already has a bond ${bond.id}`);
   }
-  return rebuildSpecies(species, species.atoms, [...species.bonds, bond]);
+  return rebuildSpecies(species, species.atoms, []);
 }
 
killedBy: withAddedBond and withoutBond appends the bond
statusReason: expected [] to deeply equal [ 'b1' ]

[Killed] BlockStatement
src/edit.ts:119:72
   return rebuildSpecies(species, species.atoms, [...species.bonds, bond]);
 }
 
-export function withoutBond(species: Species, bondId: BondId): Species {
-  const bonds = species.bonds.filter((bond) => bond.id !== bondId);
-  return rebuildSpecies(species, species.atoms, bonds);
-}
+export function withoutBond(species: Species, bondId: BondId): Species {}
 
 export function withBondOrder(species: Species, bondId: BondId, order: BondOrder): Species {
killedBy: withAddedBond and withoutBond removes the named bond and leaves the atoms alone
statusReason: Cannot read properties of undefined (reading 'bonds')

[Killed] ArrowFunction
src/edit.ts:120:38
 }
 
 export function withoutBond(species: Species, bondId: BondId): Species {
-  const bonds = species.bonds.filter((bond) => bond.id !== bondId);
+  const bonds = species.bonds.filter(() => undefined);
   return rebuildSpecies(species, species.atoms, bonds);
 }
killedBy: withAddedBond and withoutBond is a no op for a bond that is not there
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/edit.ts:120:48
 }
 
 export function withoutBond(species: Species, bondId: BondId): Species {
-  const bonds = species.bonds.filter((bond) => bond.id !== bondId);
+  const bonds = species.bonds.filter((bond) => true);
   return rebuildSpecies(species, species.atoms, bonds);
 }
killedBy: withAddedBond and withoutBond removes the named bond and leaves the atoms alone
statusReason: expected [ { id: 'b1', a: 'c1', …(2) } ] to deeply equal []

[Killed] BlockStatement
src/edit.ts:124:92
   return rebuildSpecies(species, species.atoms, bonds);
 }
 
-export function withBondOrder(species: Species, bondId: BondId, order: BondOrder): Species {
-  const target = requireBond(species, bondId);
-  const updated: Bond = Object.freeze({
-    id: target.id,
-    a: target.a,
-    b: target.b,
-    order,
-    ...(target.stereo === undefined ? {} : { stereo: target.stereo }),
-  });
-  const bonds = species.bonds.map((bond) => (bond.id === bondId ? updated : bond));
-  return rebuildSpecies(species, species.atoms, bonds);
-}
+export function withBondOrder(species: Species, bondId: BondId, order: BondOrder): Species {}
 
 export function withBondStereo(
killedBy: a rebuild carries the optional fields it did not touch leaves a bond with no stereo without the field after an order change
statusReason: Cannot read properties of undefined (reading 'bonds')

[Killed] ConditionalExpression
src/edit.ts:131:9
     a: target.a,
     b: target.b,
     order,
-    ...(target.stereo === undefined ? {} : { stereo: target.stereo }),
+    ...(false ? {} : { stereo: target.stereo }),
   });
   const bonds = species.bonds.map((bond) => (bond.id === bondId ? updated : bond));
killedBy: a rebuild carries the optional fields it did not touch leaves a bond with no stereo without the field after an order change
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/edit.ts:131:9
     a: target.a,
     b: target.b,
     order,
-    ...(target.stereo === undefined ? {} : { stereo: target.stereo }),
+    ...(true ? {} : { stereo: target.stereo }),
   });
   const bonds = species.bonds.map((bond) => (bond.id === bondId ? updated : bond));
killedBy: withBondOrder keeps bond stereo through an order change
statusReason: expected undefined to deeply equal { kind: 'doubleBond', …(2) }

[Killed] ConditionalExpression
src/edit.ts:133:46
     order,
     ...(target.stereo === undefined ? {} : { stereo: target.stereo }),
   });
-  const bonds = species.bonds.map((bond) => (bond.id === bondId ? updated : bond));
+  const bonds = species.bonds.map((bond) => (false ? updated : bond));
   return rebuildSpecies(species, species.atoms, bonds);
 }
killedBy: withBondOrder changes the order and keeps the ends
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
src/edit.ts:133:46
     order,
     ...(target.stereo === undefined ? {} : { stereo: target.stereo }),
   });
-  const bonds = species.bonds.map((bond) => (bond.id === bondId ? updated : bond));
+  const bonds = species.bonds.map((bond) => (bond.id !== bondId ? updated : bond));
   return rebuildSpecies(species, species.atoms, bonds);
 }
killedBy: withBondOrder changes the order and keeps the ends
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/edit.ts:141:12
   species: Species,
   bondId: BondId,
   stereo: BondStereo | undefined,
-): Species {
-  const target = requireBond(species, bondId);
-  const updated: Bond = Object.freeze({
-    id: target.id,
-    a: target.a,
-    b: target.b,
-    order: target.order,
-    ...(stereo === undefined ? {} : { stereo }),
-  });
-  const bonds = species.bonds.map((bond) => (bond.id === bondId ? updated : bond));
-  return rebuildSpecies(species, species.atoms, bonds);
-}
+): Species {}
 
 function rebuildState(
killedBy: withBondStereo sets stereo on the named bond and keeps the order
statusReason: Cannot read properties of undefined (reading 'bonds')

[Killed] ConditionalExpression
src/edit.ts:148:9
     a: target.a,
     b: target.b,
     order: target.order,
-    ...(stereo === undefined ? {} : { stereo }),
+    ...(true ? {} : { stereo }),
   });
   const bonds = species.bonds.map((bond) => (bond.id === bondId ? updated : bond));
killedBy: withBondStereo sets stereo on the named bond and keeps the order
statusReason: expected undefined to deeply equal { kind: 'doubleBond', …(2) }

[Killed] ConditionalExpression
src/edit.ts:148:9
     a: target.a,
     b: target.b,
     order: target.order,
-    ...(stereo === undefined ? {} : { stereo }),
+    ...(false ? {} : { stereo }),
   });
   const bonds = species.bonds.map((bond) => (bond.id === bondId ? updated : bond));
killedBy: withBondStereo clears stereo when given undefined, rather than storing undefined
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/edit.ts:150:46
     order: target.order,
     ...(stereo === undefined ? {} : { stereo }),
   });
-  const bonds = species.bonds.map((bond) => (bond.id === bondId ? updated : bond));
+  const bonds = species.bonds.map((bond) => (true ? updated : bond));
   return rebuildSpecies(species, species.atoms, bonds);
 }
killedBy: an edit that names a target touches only that target sets stereo on the named bond only
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/edit.ts:158:19
   state: MechanismState,
   members: readonly StateMember[],
   spectators: readonly SpectatorDeclaration[],
-): MechanismState {
-  return Object.freeze({
-    id: state.id,
-    members: Object.freeze([...members]),
-    spectators: Object.freeze([...spectators]),
-  });
-}
+): MechanismState {}
 
 /** A new state with the same id and one member added. */
killedBy: state edits adds a member and keeps its role
statusReason: Cannot read properties of undefined (reading 'members')

[Killed] BlockStatement
src/edit.ts:167:88
 }
 
 /** A new state with the same id and one member added. */
-export function withMember(state: MechanismState, member: StateMember): MechanismState {
-  if (state.members.some((existing) => existing.species.id === member.species.id)) {
-    throw new Error(`State ${state.id} already has a species ${member.species.id}`);
-  }
-  return rebuildState(state, [...state.members, member], state.spectators);
-}
+export function withMember(state: MechanismState, member: StateMember): MechanismState {}
 
 export function withoutMember(state: MechanismState, speciesId: SpeciesId): MechanismState {
killedBy: state edits adds a member and keeps its role
statusReason: Cannot read properties of undefined (reading 'members')

[Killed] MethodExpression
src/edit.ts:168:7
 
 /** A new state with the same id and one member added. */
 export function withMember(state: MechanismState, member: StateMember): MechanismState {
-  if (state.members.some((existing) => existing.species.id === member.species.id)) {
+  if (state.members.every(existing => existing.species.id === member.species.id)) {
     throw new Error(`State ${state.id} already has a species ${member.species.id}`);
   }
killedBy: an edit that names a target touches only that target refuses a duplicate member even when another member has a different id
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/edit.ts:168:40
 
 /** A new state with the same id and one member added. */
 export function withMember(state: MechanismState, member: StateMember): MechanismState {
-  if (state.members.some((existing) => existing.species.id === member.species.id)) {
+  if (state.members.some((existing) => existing.species.id !== member.species.id)) {
     throw new Error(`State ${state.id} already has a species ${member.species.id}`);
   }
killedBy: state edits adds a member and keeps its role
statusReason: State st already has a species sp-hydroxide

[Killed] StringLiteral
src/edit.ts:169:21
 /** A new state with the same id and one member added. */
 export function withMember(state: MechanismState, member: StateMember): MechanismState {
   if (state.members.some((existing) => existing.species.id === member.species.id)) {
-    throw new Error(`State ${state.id} already has a species ${member.species.id}`);
+    throw new Error(``);
   }
   return rebuildState(state, [...state.members, member], state.spectators);
killedBy: state edits refuses a species id the state already carries
statusReason: expected [Function] to throw error matching /sp-chloromethane/ but got ''

[Killed] BlockStatement
src/edit.ts:174:92
   return rebuildState(state, [...state.members, member], state.spectators);
 }
 
-export function withoutMember(state: MechanismState, speciesId: SpeciesId): MechanismState {
-  const members = state.members.filter((member) => member.species.id !== speciesId);
-  const spectators = state.spectators.filter(
-    (declaration) => declaration.speciesId !== speciesId,
-  );
-  return rebuildState(state, members, spectators);
-}
+export function withoutMember(state: MechanismState, speciesId: SpeciesId): MechanismState {}
 
 /** Replace one species in place, keeping its role. */
killedBy: state edits removes a member and any spectator declaration naming it
statusReason: Cannot read properties of undefined (reading 'members')
