[Killed] MethodExpression
src/edit.ts:175:19
 }
 
 export function withoutMember(state: MechanismState, speciesId: SpeciesId): MechanismState {
-  const members = state.members.filter((member) => member.species.id !== speciesId);
+  const members = state.members;
   const spectators = state.spectators.filter(
     (declaration) => declaration.speciesId !== speciesId,
killedBy: state edits removes a member and any spectator declaration naming it
statusReason: expected [ 'sp-chloromethane', 'sp-hydroxide' ] to deeply equal [ 'sp-chloromethane' ]

[Killed] EqualityOperator
src/edit.ts:175:52
 }
 
 export function withoutMember(state: MechanismState, speciesId: SpeciesId): MechanismState {
-  const members = state.members.filter((member) => member.species.id !== speciesId);
+  const members = state.members.filter((member) => member.species.id === speciesId);
   const spectators = state.spectators.filter(
     (declaration) => declaration.speciesId !== speciesId,
killedBy: state edits removes a member and any spectator declaration naming it
statusReason: expected [ 'sp-hydroxide' ] to deeply equal [ 'sp-chloromethane' ]

[Killed] MethodExpression
src/edit.ts:176:22
 
 export function withoutMember(state: MechanismState, speciesId: SpeciesId): MechanismState {
   const members = state.members.filter((member) => member.species.id !== speciesId);
-  const spectators = state.spectators.filter(
-    (declaration) => declaration.speciesId !== speciesId,
-  );
+  const spectators = state.spectators;
   return rebuildState(state, members, spectators);
 }
killedBy: state edits removes a member and any spectator declaration naming it
statusReason: expected [ { speciesId: 'sp-hydroxide', …(3) } ] to deeply equal []

[Killed] EqualityOperator
src/edit.ts:177:22
 export function withoutMember(state: MechanismState, speciesId: SpeciesId): MechanismState {
   const members = state.members.filter((member) => member.species.id !== speciesId);
   const spectators = state.spectators.filter(
-    (declaration) => declaration.speciesId !== speciesId,
+    (declaration) => declaration.speciesId === speciesId,
   );
   return rebuildState(state, members, spectators);
killedBy: state edits removes a member and any spectator declaration naming it
statusReason: expected [ { speciesId: 'sp-hydroxide', …(3) } ] to deeply equal []

[Killed] ConditionalExpression
src/edit.ts:177:22
 export function withoutMember(state: MechanismState, speciesId: SpeciesId): MechanismState {
   const members = state.members.filter((member) => member.species.id !== speciesId);
   const spectators = state.spectators.filter(
-    (declaration) => declaration.speciesId !== speciesId,
+    (declaration) => true,
   );
   return rebuildState(state, members, spectators);
killedBy: state edits removes a member and any spectator declaration naming it
statusReason: expected [ { speciesId: 'sp-hydroxide', …(3) } ] to deeply equal []

[Killed] BlockStatement
src/edit.ts:183:94
 }
 
 /** Replace one species in place, keeping its role. */
-export function withReplacedSpecies(state: MechanismState, species: Species): MechanismState {
-  if (!state.members.some((member) => member.species.id === species.id)) {
-    throw new Error(`State ${state.id} has no species ${species.id} to replace`);
-  }
-  const members = state.members.map((member) =>
-    member.species.id === species.id ? { species, role: member.role } : member,
-  );
-  return rebuildState(state, members, state.spectators);
-}
+export function withReplacedSpecies(state: MechanismState, species: Species): MechanismState {}
 
 /**
killedBy: state edits replaces a species in place and keeps its role
statusReason: Cannot read properties of undefined (reading 'members')

[Killed] EqualityOperator
src/edit.ts:184:39
 
 /** Replace one species in place, keeping its role. */
 export function withReplacedSpecies(state: MechanismState, species: Species): MechanismState {
-  if (!state.members.some((member) => member.species.id === species.id)) {
+  if (!state.members.some((member) => member.species.id !== species.id)) {
     throw new Error(`State ${state.id} has no species ${species.id} to replace`);
   }
killedBy: state edits replaces a species in place and keeps its role
statusReason: State st has no species sp-chloromethane to replace

[Killed] ArrowFunction
src/edit.ts:184:27
 
 /** Replace one species in place, keeping its role. */
 export function withReplacedSpecies(state: MechanismState, species: Species): MechanismState {
-  if (!state.members.some((member) => member.species.id === species.id)) {
+  if (!state.members.some(() => undefined)) {
     throw new Error(`State ${state.id} has no species ${species.id} to replace`);
   }
killedBy: state edits replaces a species in place and keeps its role
statusReason: State st has no species sp-chloromethane to replace

[Killed] ArrowFunction
src/edit.ts:187:37
   if (!state.members.some((member) => member.species.id === species.id)) {
     throw new Error(`State ${state.id} has no species ${species.id} to replace`);
   }
-  const members = state.members.map((member) =>
-    member.species.id === species.id ? { species, role: member.role } : member,
+  const members = state.members.map(() => undefined,
   );
   return rebuildState(state, members, state.spectators);
killedBy: state edits replaces a species in place and keeps its role
statusReason: expected undefined to be 'substrate' // Object.is equality

[Killed] EqualityOperator
src/edit.ts:188:5
     throw new Error(`State ${state.id} has no species ${species.id} to replace`);
   }
   const members = state.members.map((member) =>
-    member.species.id === species.id ? { species, role: member.role } : member,
+    member.species.id !== species.id ? { species, role: member.role } : member,
   );
   return rebuildState(state, members, state.spectators);
killedBy: state edits replaces a species in place and keeps its role
statusReason: expected [ { id: 'b1', a: 'c1', …(2) } ] to deeply equal []

[Killed] ConditionalExpression
src/edit.ts:188:5
     throw new Error(`State ${state.id} has no species ${species.id} to replace`);
   }
   const members = state.members.map((member) =>
-    member.species.id === species.id ? { species, role: member.role } : member,
+    false ? { species, role: member.role } : member,
   );
   return rebuildState(state, members, state.spectators);
killedBy: state edits replaces a species in place and keeps its role
statusReason: expected [ { id: 'b1', a: 'c1', …(2) } ] to deeply equal []

[Killed] BlockStatement
src/edit.ts:204:19
 export function declareSpectator(
   state: MechanismState,
   declaration: SpectatorDeclaration,
-): MechanismState {
-  if (!state.members.some((member) => member.species.id === declaration.speciesId)) {
-    throw new Error(
-      `Cannot declare species ${declaration.speciesId} a spectator: it is not in state ${state.id}`,
-    );
-  }
-  if (state.spectators.some((existing) => existing.speciesId === declaration.speciesId)) {
-    throw new Error(`Species ${declaration.speciesId} is already a spectator in state ${state.id}`);
-  }
-  return rebuildState(state, state.members, [...state.spectators, Object.freeze(declaration)]);
-}
+): MechanismState {}
 
 /** Withdraw a spectator declaration. Also an explicit act, and also recorded. */
killedBy: spectator declarations records the declaration
statusReason: Cannot read properties of undefined (reading 'spectators')

[Killed] ConditionalExpression
src/edit.ts:205:39
   state: MechanismState,
   declaration: SpectatorDeclaration,
 ): MechanismState {
-  if (!state.members.some((member) => member.species.id === declaration.speciesId)) {
+  if (!state.members.some((member) => true)) {
     throw new Error(
       `Cannot declare species ${declaration.speciesId} a spectator: it is not in state ${state.id}`,
killedBy: spectator declarations refuses to declare a species that is not in the state
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/edit.ts:205:39
   state: MechanismState,
   declaration: SpectatorDeclaration,
 ): MechanismState {
-  if (!state.members.some((member) => member.species.id === declaration.speciesId)) {
+  if (!state.members.some((member) => false)) {
     throw new Error(
       `Cannot declare species ${declaration.speciesId} a spectator: it is not in state ${state.id}`,
killedBy: spectator declarations records the declaration
statusReason: Cannot declare species sp-chloromethane a spectator: it is not in state st

[Killed] ConditionalExpression
src/edit.ts:210:7
       `Cannot declare species ${declaration.speciesId} a spectator: it is not in state ${state.id}`,
     );
   }
-  if (state.spectators.some((existing) => existing.speciesId === declaration.speciesId)) {
+  if (true) {
     throw new Error(`Species ${declaration.speciesId} is already a spectator in state ${state.id}`);
   }
killedBy: spectator declarations records the declaration
statusReason: Species sp-chloromethane is already a spectator in state st

[Killed] EqualityOperator
src/edit.ts:210:43
       `Cannot declare species ${declaration.speciesId} a spectator: it is not in state ${state.id}`,
     );
   }
-  if (state.spectators.some((existing) => existing.speciesId === declaration.speciesId)) {
+  if (state.spectators.some((existing) => existing.speciesId !== declaration.speciesId)) {
     throw new Error(`Species ${declaration.speciesId} is already a spectator in state ${state.id}`);
   }
killedBy: spectator declarations refuses a second declaration for the same species
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
src/edit.ts:211:21
     );
   }
   if (state.spectators.some((existing) => existing.speciesId === declaration.speciesId)) {
-    throw new Error(`Species ${declaration.speciesId} is already a spectator in state ${state.id}`);
+    throw new Error(``);
   }
   return rebuildState(state, state.members, [...state.spectators, Object.freeze(declaration)]);
killedBy: spectator declarations refuses a second declaration for the same species
statusReason: expected [Function] to throw error matching /already/ but got ''

[Killed] BlockStatement
src/edit.ts:220:19
 export function withdrawSpectator(
   state: MechanismState,
   speciesId: SpeciesId,
-): MechanismState {
-  const spectators = state.spectators.filter(
-    (declaration) => declaration.speciesId !== speciesId,
-  );
-  return rebuildState(state, state.members, spectators);
-}
+): MechanismState {}
 
 /**
killedBy: spectator declarations withdraws a declaration and leaves the member in place
statusReason: Cannot read properties of undefined (reading 'spectators')

[Killed] MethodExpression
src/edit.ts:221:22
   state: MechanismState,
   speciesId: SpeciesId,
 ): MechanismState {
-  const spectators = state.spectators.filter(
-    (declaration) => declaration.speciesId !== speciesId,
-  );
+  const spectators = state.spectators;
   return rebuildState(state, state.members, spectators);
 }
killedBy: spectator declarations withdraws a declaration and leaves the member in place
statusReason: expected [ { …(4) } ] to deeply equal []

[Killed] ConditionalExpression
src/edit.ts:222:22
   speciesId: SpeciesId,
 ): MechanismState {
   const spectators = state.spectators.filter(
-    (declaration) => declaration.speciesId !== speciesId,
+    (declaration) => false,
   );
   return rebuildState(state, state.members, spectators);
killedBy: spectator declarations withdraws only the named species
statusReason: expected [] to deeply equal [ 'sp-chloromethane' ]

[Killed] BlockStatement
src/edit.ts:235:83
  * safe because every species in this package is frozen and every edit returns a
  * new one.
  */
-export function copyStateAs(state: MechanismState, newId: string): MechanismState {
-  return Object.freeze({
-    id: newId,
-    members: state.members,
-    spectators: state.spectators,
-  });
-}
+export function copyStateAs(state: MechanismState, newId: string): MechanismState {}
 
killedBy: copyStateAs changes the id and nothing else
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/edit.ts:236:24
  * new one.
  */
 export function copyStateAs(state: MechanismState, newId: string): MechanismState {
-  return Object.freeze({
-    id: newId,
-    members: state.members,
-    spectators: state.spectators,
-  });
+  return Object.freeze({});
 }
 
killedBy: copyStateAs changes the id and nothing else
statusReason: expected undefined to be 'st-1' // Object.is equality
