[Killed] ObjectLiteral
src/elements.ts:73:6
 }
 
 export const ELEMENTS: Readonly<Record<Element, ElementProperties>> = Object.freeze({
-  H: {
-    symbol: "H",
-    atomicNumber: 1,
-    period: 1,
-    valenceElectrons: 1,
-    standardAtomicWeight: 1.008,
-    mainGroup: true,
-    maxValenceElectrons: 2,
-    commonNeutralValence: [1],
-  },
+  H: {},
   B: {
     symbol: "B",
killedBy: valenceElectronCount counts an implicit hydrogen's electron
statusReason: expected NaN to be 8 // Object.is equality

[Killed] BooleanLiteral
src/elements.ts:79:16
     period: 1,
     valenceElectrons: 1,
     standardAtomicWeight: 1.008,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 2,
     commonNeutralValence: [1],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Cu', 'H', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] BooleanLiteral
src/elements.ts:89:16
     period: 2,
     valenceElectrons: 3,
     standardAtomicWeight: 10.81,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 8,
     commonNeutralValence: [3],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'B', 'Cu', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] StringLiteral
src/elements.ts:94:13
     commonNeutralValence: [3],
   },
   C: {
-    symbol: "C",
+    symbol: "",
     atomicNumber: 6,
     period: 2,
killedBy: the element table gives every element self consistent properties
statusReason: expected '' to be 'C' // Object.is equality

[Killed] BooleanLiteral
src/elements.ts:99:16
     period: 2,
     valenceElectrons: 4,
     standardAtomicWeight: 12.011,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 8,
     commonNeutralValence: [4],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'C', 'Cu', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] BooleanLiteral
src/elements.ts:109:16
     period: 2,
     valenceElectrons: 5,
     standardAtomicWeight: 14.007,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 8,
     commonNeutralValence: [3],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Cu', 'N', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] ArrayDeclaration
src/elements.ts:111:27
     standardAtomicWeight: 14.007,
     mainGroup: true,
     maxValenceElectrons: 8,
-    commonNeutralValence: [3],
+    commonNeutralValence: [],
   },
   O: {
killedBy: the element table gives every element self consistent properties
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/elements.ts:119:16
     period: 2,
     valenceElectrons: 6,
     standardAtomicWeight: 15.999,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 8,
     commonNeutralValence: [2],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Cu', 'O', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] ArrayDeclaration
src/elements.ts:121:27
     standardAtomicWeight: 15.999,
     mainGroup: true,
     maxValenceElectrons: 8,
-    commonNeutralValence: [2],
+    commonNeutralValence: [],
   },
   F: {
killedBy: the element table gives every element self consistent properties
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/elements.ts:129:16
     period: 2,
     valenceElectrons: 7,
     standardAtomicWeight: 18.998,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 8,
     commonNeutralValence: [1],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Cu', 'F', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] BooleanLiteral
src/elements.ts:139:16
     period: 3,
     valenceElectrons: 4,
     standardAtomicWeight: 28.085,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 12,
     commonNeutralValence: [4],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Cu', 'Si', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] BooleanLiteral
src/elements.ts:149:16
     period: 3,
     valenceElectrons: 5,
     standardAtomicWeight: 30.974,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 12,
     commonNeutralValence: [3, 5],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Cu', 'P', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] ObjectLiteral
src/elements.ts:153:6
     maxValenceElectrons: 12,
     commonNeutralValence: [3, 5],
   },
-  S: {
-    symbol: "S",
-    atomicNumber: 16,
-    period: 3,
-    valenceElectrons: 6,
-    standardAtomicWeight: 32.06,
-    mainGroup: true,
-    maxValenceElectrons: 12,
-    commonNeutralValence: [2, 4, 6],
-  },
+  S: {},
   Cl: {
     symbol: "Cl",
killedBy: the element table gives every element self consistent properties
statusReason: expected undefined to be 'S' // Object.is equality

[Killed] StringLiteral
src/elements.ts:154:13
     commonNeutralValence: [3, 5],
   },
   S: {
-    symbol: "S",
+    symbol: "",
     atomicNumber: 16,
     period: 3,
killedBy: the element table gives every element self consistent properties
statusReason: expected '' to be 'S' // Object.is equality

[Killed] BooleanLiteral
src/elements.ts:159:16
     period: 3,
     valenceElectrons: 6,
     standardAtomicWeight: 32.06,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 12,
     commonNeutralValence: [2, 4, 6],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Cu', 'S', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] ArrayDeclaration
src/elements.ts:161:27
     standardAtomicWeight: 32.06,
     mainGroup: true,
     maxValenceElectrons: 12,
-    commonNeutralValence: [2, 4, 6],
+    commonNeutralValence: [],
   },
   Cl: {
killedBy: the element table gives every element self consistent properties
statusReason: expected 0 to be greater than 0

[Killed] ObjectLiteral
src/elements.ts:163:7
     maxValenceElectrons: 12,
     commonNeutralValence: [2, 4, 6],
   },
-  Cl: {
-    symbol: "Cl",
-    atomicNumber: 17,
-    period: 3,
-    valenceElectrons: 7,
-    standardAtomicWeight: 35.45,
-    mainGroup: true,
-    maxValenceElectrons: 12,
-    commonNeutralValence: [1],
-  },
+  Cl: {},
   Br: {
     symbol: "Br",
killedBy: the element table gives every element self consistent properties
statusReason: expected undefined to be 'Cl' // Object.is equality

[Killed] BooleanLiteral
src/elements.ts:169:16
     period: 3,
     valenceElectrons: 7,
     standardAtomicWeight: 35.45,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 12,
     commonNeutralValence: [1],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Cl', 'Cu', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] ArrayDeclaration
src/elements.ts:171:27
     standardAtomicWeight: 35.45,
     mainGroup: true,
     maxValenceElectrons: 12,
-    commonNeutralValence: [1],
+    commonNeutralValence: [],
   },
   Br: {
killedBy: the element table gives every element self consistent properties
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/elements.ts:179:16
     period: 4,
     valenceElectrons: 7,
     standardAtomicWeight: 79.904,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 12,
     commonNeutralValence: [1],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Br', 'Cu', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] BooleanLiteral
src/elements.ts:189:16
     period: 5,
     valenceElectrons: 7,
     standardAtomicWeight: 126.904,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 12,
     commonNeutralValence: [1],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Cu', 'I', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] ObjectLiteral
src/elements.ts:193:7
     maxValenceElectrons: 12,
     commonNeutralValence: [1],
   },
-  Li: {
-    symbol: "Li",
-    atomicNumber: 3,
-    period: 2,
-    valenceElectrons: 1,
-    standardAtomicWeight: 6.94,
-    mainGroup: true,
-    maxValenceElectrons: 2,
-    commonNeutralValence: [1],
-  },
+  Li: {},
   Na: {
     symbol: "Na",
killedBy: the element table gives every element self consistent properties
statusReason: expected undefined to be 'Li' // Object.is equality

[Killed] BooleanLiteral
src/elements.ts:199:16
     period: 2,
     valenceElectrons: 1,
     standardAtomicWeight: 6.94,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 2,
     commonNeutralValence: [1],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Cu', 'Li', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] StringLiteral
src/elements.ts:204:13
     commonNeutralValence: [1],
   },
   Na: {
-    symbol: "Na",
+    symbol: "",
     atomicNumber: 11,
     period: 3,
killedBy: the element table gives every element self consistent properties
statusReason: expected '' to be 'Na' // Object.is equality

[Killed] BooleanLiteral
src/elements.ts:209:16
     period: 3,
     valenceElectrons: 1,
     standardAtomicWeight: 22.99,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 2,
     commonNeutralValence: [1],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Cu', 'Na', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] ObjectLiteral
src/elements.ts:213:6
     maxValenceElectrons: 2,
     commonNeutralValence: [1],
   },
-  K: {
-    symbol: "K",
-    atomicNumber: 19,
-    period: 4,
-    valenceElectrons: 1,
-    standardAtomicWeight: 39.098,
-    mainGroup: true,
-    maxValenceElectrons: 2,
-    commonNeutralValence: [1],
-  },
+  K: {},
   Mg: {
     symbol: "Mg",
killedBy: the element table gives every element self consistent properties
statusReason: expected undefined to be 'K' // Object.is equality

[Killed] StringLiteral
src/elements.ts:214:13
     commonNeutralValence: [1],
   },
   K: {
-    symbol: "K",
+    symbol: "",
     atomicNumber: 19,
     period: 4,
killedBy: the element table gives every element self consistent properties
statusReason: expected '' to be 'K' // Object.is equality

[Killed] BooleanLiteral
src/elements.ts:219:16
     period: 4,
     valenceElectrons: 1,
     standardAtomicWeight: 39.098,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 2,
     commonNeutralValence: [1],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Cu', 'K', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] ArrayDeclaration
src/elements.ts:221:27
     standardAtomicWeight: 39.098,
     mainGroup: true,
     maxValenceElectrons: 2,
-    commonNeutralValence: [1],
+    commonNeutralValence: [],
   },
   Mg: {
killedBy: the element table gives every element self consistent properties
statusReason: expected 0 to be greater than 0

[Killed] BooleanLiteral
src/elements.ts:229:16
     period: 3,
     valenceElectrons: 2,
     standardAtomicWeight: 24.305,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 8,
     commonNeutralValence: [2],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Cu', 'Mg', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] ObjectLiteral
src/elements.ts:233:7
     maxValenceElectrons: 8,
     commonNeutralValence: [2],
   },
-  Al: {
-    symbol: "Al",
-    atomicNumber: 13,
-    period: 3,
-    valenceElectrons: 3,
-    standardAtomicWeight: 26.982,
-    mainGroup: true,
-    maxValenceElectrons: 12,
-    commonNeutralValence: [3],
-  },
+  Al: {},
   Zn: {
     symbol: "Zn",
killedBy: the element table gives every element self consistent properties
statusReason: expected undefined to be 'Al' // Object.is equality

[Killed] BooleanLiteral
src/elements.ts:239:16
     period: 3,
     valenceElectrons: 3,
     standardAtomicWeight: 26.982,
-    mainGroup: true,
+    mainGroup: false,
     maxValenceElectrons: 12,
     commonNeutralValence: [3],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Al', 'Cu', 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] ArrayDeclaration
src/elements.ts:241:27
     standardAtomicWeight: 26.982,
     mainGroup: true,
     maxValenceElectrons: 12,
-    commonNeutralValence: [3],
+    commonNeutralValence: [],
   },
   Zn: {
killedBy: the element table gives every element self consistent properties
statusReason: expected 0 to be greater than 0

[Killed] ObjectLiteral
src/elements.ts:243:7
     maxValenceElectrons: 12,
     commonNeutralValence: [3],
   },
-  Zn: {
-    symbol: "Zn",
-    atomicNumber: 30,
-    period: 4,
-    valenceElectrons: 12,
-    standardAtomicWeight: 65.38,
-    mainGroup: false,
-    maxValenceElectrons: 18,
-    commonNeutralValence: [2],
-  },
+  Zn: {},
   Cu: {
     symbol: "Cu",
killedBy: the element table gives every element self consistent properties
statusReason: expected undefined to be 'Zn' // Object.is equality

[Killed] BooleanLiteral
src/elements.ts:249:16
     period: 4,
     valenceElectrons: 12,
     standardAtomicWeight: 65.38,
-    mainGroup: false,
+    mainGroup: true,
     maxValenceElectrons: 18,
     commonNeutralValence: [2],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Cu' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] ObjectLiteral
src/elements.ts:253:7
     maxValenceElectrons: 18,
     commonNeutralValence: [2],
   },
-  Cu: {
-    symbol: "Cu",
-    atomicNumber: 29,
-    period: 4,
-    valenceElectrons: 11,
-    standardAtomicWeight: 63.546,
-    mainGroup: false,
-    maxValenceElectrons: 18,
-    commonNeutralValence: [1, 2],
-  },
+  Cu: {},
 });
 
killedBy: the element table gives every element self consistent properties
statusReason: expected undefined to be 'Cu' // Object.is equality

[Killed] StringLiteral
src/elements.ts:254:13
     commonNeutralValence: [2],
   },
   Cu: {
-    symbol: "Cu",
+    symbol: "",
     atomicNumber: 29,
     period: 4,
killedBy: the element table gives every element self consistent properties
statusReason: expected '' to be 'Cu' // Object.is equality

[Killed] BooleanLiteral
src/elements.ts:259:16
     period: 4,
     valenceElectrons: 11,
     standardAtomicWeight: 63.546,
-    mainGroup: false,
+    mainGroup: true,
     maxValenceElectrons: 18,
     commonNeutralValence: [1, 2],
killedBy: the element table marks exactly the transition metals as outside the octet model
statusReason: expected [ 'Zn' ] to deeply equal [ 'Cu', 'Zn' ]

[Killed] ArrayDeclaration
src/elements.ts:261:27
     standardAtomicWeight: 63.546,
     mainGroup: false,
     maxValenceElectrons: 18,
-    commonNeutralValence: [1, 2],
+    commonNeutralValence: [],
   },
 });
killedBy: the element table gives every element self consistent properties
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/elements.ts:267:51
 
 const ELEMENT_SYMBOLS = Object.freeze(Object.keys(ELEMENTS) as Element[]);
 
-export function allElements(): readonly Element[] {
-  return ELEMENT_SYMBOLS;
-}
+export function allElements(): readonly Element[] {}
 
 export function isElement(symbol: string): symbol is Element {
killedBy: the element table is frozen and non empty
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/elements.ts:271:62
   return ELEMENT_SYMBOLS;
 }
 
-export function isElement(symbol: string): symbol is Element {
-  return Object.prototype.hasOwnProperty.call(ELEMENTS, symbol);
-}
+export function isElement(symbol: string): symbol is Element {}
 
 /**
killedBy: isElement accepts every symbol in the table
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/elements.ts:280:72
  * every caller in this package has already established the symbol is valid and
  * an optional return here would spread `?.` through all of them.
  */
-export function elementProperties(element: Element): ElementProperties {
-  const properties = ELEMENTS[element];
-  if (properties === undefined) {
-    throw new Error(`Unknown element: ${element}`);
-  }
-  return properties;
-}
+export function elementProperties(element: Element): ElementProperties {}
 
killedBy: derivedFormalCharge is zero on a neutral carbon with four bonds
statusReason: Cannot read properties of undefined (reading 'valenceElectrons')

[Killed] ConditionalExpression
src/elements.ts:282:7
  */
 export function elementProperties(element: Element): ElementProperties {
   const properties = ELEMENTS[element];
-  if (properties === undefined) {
+  if (false) {
     throw new Error(`Unknown element: ${element}`);
   }
killedBy: elementProperties throws rather than returning undefined for an unknown element
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
src/elements.ts:282:7
  */
 export function elementProperties(element: Element): ElementProperties {
   const properties = ELEMENTS[element];
-  if (properties === undefined) {
+  if (properties !== undefined) {
     throw new Error(`Unknown element: ${element}`);
   }
killedBy: derivedFormalCharge is zero on a neutral carbon with four bonds
statusReason: Unknown element: C
