[Killed] StringLiteral
src/ids.ts:54:34
  * Needed for pyramidal centres that are stereogenic because of a lone pair
  * rather than a fourth substituent, such as a sulfoxide sulfur.
  */
-export const LONE_PAIR: AtomId = "@lonePair";
+export const LONE_PAIR: AtomId = "";
 
 /**
killedBy: reserved identifiers uses a prefix no real id would carry, and both sentinels use it
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/ids.ts:65:51
  */
 export type StereoNeighbor = AtomId;
 
-export function isSentinelId(id: string): boolean {
-  return id.startsWith(RESERVED_ID_PREFIX);
-}
+export function isSentinelId(id: string): boolean {}
 
 export function isImplicitHydrogenSlot(id: StereoNeighbor): boolean {
killedBy: isSentinelId is true for both sentinels
statusReason: expected undefined to be true // Object.is equality

[Killed] MethodExpression
src/ids.ts:66:10
 export type StereoNeighbor = AtomId;
 
 export function isSentinelId(id: string): boolean {
-  return id.startsWith(RESERVED_ID_PREFIX);
+  return id.endsWith(RESERVED_ID_PREFIX);
 }
 
killedBy: isSentinelId is true for both sentinels
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/ids.ts:69:69
   return id.startsWith(RESERVED_ID_PREFIX);
 }
 
-export function isImplicitHydrogenSlot(id: StereoNeighbor): boolean {
-  return id === IMPLICIT_HYDROGEN;
-}
+export function isImplicitHydrogenSlot(id: StereoNeighbor): boolean {}
 
 export function isLonePairSlot(id: StereoNeighbor): boolean {
killedBy: slot predicates match their own sentinel and nothing else
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/ids.ts:70:10
 }
 
 export function isImplicitHydrogenSlot(id: StereoNeighbor): boolean {
-  return id === IMPLICIT_HYDROGEN;
+  return true;
 }
 
killedBy: slot predicates match their own sentinel and nothing else
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/ids.ts:70:10
 }
 
 export function isImplicitHydrogenSlot(id: StereoNeighbor): boolean {
-  return id === IMPLICIT_HYDROGEN;
+  return false;
 }
 
killedBy: slot predicates match their own sentinel and nothing else
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/ids.ts:73:61
   return id === IMPLICIT_HYDROGEN;
 }
 
-export function isLonePairSlot(id: StereoNeighbor): boolean {
-  return id === LONE_PAIR;
-}
+export function isLonePairSlot(id: StereoNeighbor): boolean {}
 
 /**
killedBy: slot predicates match their own sentinel and nothing else
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/ids.ts:74:10
 }
 
 export function isLonePairSlot(id: StereoNeighbor): boolean {
-  return id === LONE_PAIR;
+  return true;
 }
 
killedBy: slot predicates match their own sentinel and nothing else
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/ids.ts:74:10
 }
 
 export function isLonePairSlot(id: StereoNeighbor): boolean {
-  return id === LONE_PAIR;
+  return id !== LONE_PAIR;
 }
 
killedBy: slot predicates match their own sentinel and nothing else
statusReason: expected false to be true // Object.is equality
