[Killed] BlockStatement
src/resolution.ts:98:75
 }
 
 /** Whether this resolution counts as chemically sound, regardless of the mark. */
-export function isChemicallyValid(resolution: AttemptResolution): boolean {
-  return resolution.kind !== "invalid";
-}
+export function isChemicallyValid(resolution: AttemptResolution): boolean {}
 
 /** Whether this resolution reaches the requested product. */
killedBy: isChemicallyValid is true for the three sound outcomes and false only for invalid
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/resolution.ts:99:10
 
 /** Whether this resolution counts as chemically sound, regardless of the mark. */
 export function isChemicallyValid(resolution: AttemptResolution): boolean {
-  return resolution.kind !== "invalid";
+  return resolution.kind === "invalid";
 }
 
killedBy: isChemicallyValid is true for the three sound outcomes and false only for invalid
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/resolution.ts:99:10
 
 /** Whether this resolution counts as chemically sound, regardless of the mark. */
 export function isChemicallyValid(resolution: AttemptResolution): boolean {
-  return resolution.kind !== "invalid";
+  return true;
 }
 
killedBy: isChemicallyValid is true for the three sound outcomes and false only for invalid
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/resolution.ts:103:81
 }
 
 /** Whether this resolution reaches the requested product. */
-export function reachesRequestedProduct(resolution: AttemptResolution): boolean {
-  return resolution.kind === "correct" || resolution.kind === "correct_alternative_route";
-}
+export function reachesRequestedProduct(resolution: AttemptResolution): boolean {}
 
 /** Every named cause on a resolution, primary first, then advisories. */
killedBy: reachesRequestedProduct is true for both correct outcomes
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/resolution.ts:104:10
 
 /** Whether this resolution reaches the requested product. */
 export function reachesRequestedProduct(resolution: AttemptResolution): boolean {
-  return resolution.kind === "correct" || resolution.kind === "correct_alternative_route";
+  return true;
 }
 
killedBy: reachesRequestedProduct is false for a sound but different transformation
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/resolution.ts:104:10
 
 /** Whether this resolution reaches the requested product. */
 export function reachesRequestedProduct(resolution: AttemptResolution): boolean {
-  return resolution.kind === "correct" || resolution.kind === "correct_alternative_route";
+  return resolution.kind !== "correct" || resolution.kind === "correct_alternative_route";
 }
 
killedBy: reachesRequestedProduct is true for both correct outcomes
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/resolution.ts:108:88
 }
 
 /** Every named cause on a resolution, primary first, then advisories. */
-export function resolutionCauses(resolution: AttemptResolution): readonly NamedCause[] {
-  return [resolution.cause, ...resolution.advisories];
-}
+export function resolutionCauses(resolution: AttemptResolution): readonly NamedCause[] {}
 
 /**
killedBy: resolutionCauses puts the primary cause first, then the advisories in order
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] BlockStatement
src/resolution.ts:119:82
  * catches a resolution built with a blocking cause on a correct answer, which
  * would tell a student they were right and then explain why they were wrong.
  */
-export function primaryCauseIsConsistent(resolution: AttemptResolution): boolean {
-  return causeAppliesTo(resolution.cause.id, resolution.kind);
-}
+export function primaryCauseIsConsistent(resolution: AttemptResolution): boolean {}
 
 /**
killedBy: primaryCauseIsConsistent accepts each outcome's own success cause
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/resolution.ts:129:90
  * A blocking cause means the chemistry is impossible, and impossible chemistry
  * is not advice.
  */
-export function blockingAdvisories(resolution: AttemptResolution): readonly NamedCause[] {
-  return resolution.advisories.filter(
-    (cause) => causeDefinition(cause.id).severity === "blocking",
-  );
-}
+export function blockingAdvisories(resolution: AttemptResolution): readonly NamedCause[] {}
 
 /** How many distinct cause ids appear across a set of resolutions. */
killedBy: blockingAdvisories is empty when every advisory is advisory
statusReason: expected undefined to deeply equal []

[Killed] MethodExpression
src/resolution.ts:130:10
  * is not advice.
  */
 export function blockingAdvisories(resolution: AttemptResolution): readonly NamedCause[] {
-  return resolution.advisories.filter(
-    (cause) => causeDefinition(cause.id).severity === "blocking",
-  );
+  return resolution.advisories;
 }
 
killedBy: blockingAdvisories is empty when every advisory is advisory
statusReason: expected [ { …(2) } ] to deeply equal []

[Killed] ArrowFunction
src/resolution.ts:131:5
  */
 export function blockingAdvisories(resolution: AttemptResolution): readonly NamedCause[] {
   return resolution.advisories.filter(
-    (cause) => causeDefinition(cause.id).severity === "blocking",
+    () => undefined,
   );
 }
killedBy: blockingAdvisories names an advisory that is really a blocking cause
statusReason: expected [] to deeply equal [ 'valence_exceeded' ]

[Killed] ConditionalExpression
src/resolution.ts:131:16
  */
 export function blockingAdvisories(resolution: AttemptResolution): readonly NamedCause[] {
   return resolution.advisories.filter(
-    (cause) => causeDefinition(cause.id).severity === "blocking",
+    (cause) => true,
   );
 }
killedBy: blockingAdvisories is empty when every advisory is advisory
statusReason: expected [ { …(2) } ] to deeply equal []

[Killed] BlockStatement
src/resolution.ts:136:87
 }
 
 /** How many distinct cause ids appear across a set of resolutions. */
-export function distinctCauseCount(resolutions: readonly AttemptResolution[]): number {
-  const ids = new Set<string>();
-  for (const resolution of resolutions) {
-    for (const cause of resolutionCauses(resolution)) {
-      ids.add(cause.id);
-    }
-  }
-  return ids.size;
-}
+export function distinctCauseCount(resolutions: readonly AttemptResolution[]): number {}
 
 /** Count of resolutions by outcome. The shape a feedback report is built from. */
killedBy: distinctCauseCount is zero over an empty list
statusReason: expected undefined to be +0 // Object.is equality

[Killed] BlockStatement
src/resolution.ts:138:41
 /** How many distinct cause ids appear across a set of resolutions. */
 export function distinctCauseCount(resolutions: readonly AttemptResolution[]): number {
   const ids = new Set<string>();
-  for (const resolution of resolutions) {
-    for (const cause of resolutionCauses(resolution)) {
-      ids.add(cause.id);
-    }
-  }
+  for (const resolution of resolutions) {}
   return ids.size;
 }
killedBy: distinctCauseCount counts a cause once however many resolutions carry it
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/resolution.ts:139:55
 export function distinctCauseCount(resolutions: readonly AttemptResolution[]): number {
   const ids = new Set<string>();
   for (const resolution of resolutions) {
-    for (const cause of resolutionCauses(resolution)) {
-      ids.add(cause.id);
-    }
+    for (const cause of resolutionCauses(resolution)) {}
   }
   return ids.size;
killedBy: distinctCauseCount counts a cause once however many resolutions carry it
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/resolution.ts:149:45
 /** Count of resolutions by outcome. The shape a feedback report is built from. */
 export function countByKind(
   resolutions: readonly AttemptResolution[],
-): Readonly<Record<ResolutionKind, number>> {
-  const counts: Record<ResolutionKind, number> = {
-    correct: 0,
-    correct_alternative_route: 0,
-    valid_not_requested: 0,
-    invalid: 0,
-  };
-  for (const resolution of resolutions) {
-    counts[resolution.kind] += 1;
-  }
-  return counts;
-}
+): Readonly<Record<ResolutionKind, number>> {}
 
killedBy: countByKind reports zero for every kind over an empty list rather than omitting keys
statusReason: expected undefined to deeply equal { correct: +0, …(3) }

[Killed] BlockStatement
src/resolution.ts:156:41
     valid_not_requested: 0,
     invalid: 0,
   };
-  for (const resolution of resolutions) {
-    counts[resolution.kind] += 1;
-  }
+  for (const resolution of resolutions) {}
   return counts;
 }
killedBy: countByKind counts one of each
statusReason: expected { correct: +0, …(3) } to deeply equal { correct: 1, …(3) }

[Killed] AssignmentOperator
src/resolution.ts:157:5
     invalid: 0,
   };
   for (const resolution of resolutions) {
-    counts[resolution.kind] += 1;
+    counts[resolution.kind] -= 1;
   }
   return counts;
killedBy: countByKind counts one of each
statusReason: expected { correct: -1, …(3) } to deeply equal { correct: 1, …(3) }
