[Killed] BlockStatement
src/species.ts:51:61
   readonly declaredTorsions?: readonly DeclaredTorsion[];
 }
 
-export function createSpecies(input: SpeciesInput): Species {
-  return Object.freeze({
-    id: input.id,
-    atoms: Object.freeze([...input.atoms]),
-    bonds: Object.freeze([...(input.bonds ?? [])]),
-    ...(input.label === undefined ? {} : { label: input.label }),
-    ...(input.declaredTorsions === undefined
-      ? {}
-      : { declaredTorsions: Object.freeze([...input.declaredTorsions]) }),
-  });
-}
+export function createSpecies(input: SpeciesInput): Species {}
 
 export function findAtom(species: Species, atomId: AtomId): Atom | undefined {
killedBy: createSpecies defaults bonds to an empty list, because a lone ion has none
statusReason: Cannot read properties of undefined (reading 'bonds')

[Killed] LogicalOperator
src/species.ts:55:31
   return Object.freeze({
     id: input.id,
     atoms: Object.freeze([...input.atoms]),
-    bonds: Object.freeze([...(input.bonds ?? [])]),
+    bonds: Object.freeze([...(input.bonds && [])]),
     ...(input.label === undefined ? {} : { label: input.label }),
     ...(input.declaredTorsions === undefined
killedBy: the wording of a finding, which is what a student is shown names a single electron source and a bond source by their own words
statusReason: expected 'no species here has a bond with that …' to be 'it runs from bond b1 to between br1 a…' // Object.is equality

[Killed] ConditionalExpression
src/species.ts:56:9
     id: input.id,
     atoms: Object.freeze([...input.atoms]),
     bonds: Object.freeze([...(input.bonds ?? [])]),
-    ...(input.label === undefined ? {} : { label: input.label }),
+    ...(true ? {} : { label: input.label }),
     ...(input.declaredTorsions === undefined
       ? {}
killedBy: a rebuild carries the optional fields it did not touch keeps a label through an atom patch
statusReason: expected undefined to be 'butane, anti' // Object.is equality

[Killed] EqualityOperator
src/species.ts:56:9
     id: input.id,
     atoms: Object.freeze([...input.atoms]),
     bonds: Object.freeze([...(input.bonds ?? [])]),
-    ...(input.label === undefined ? {} : { label: input.label }),
+    ...(input.label !== undefined ? {} : { label: input.label }),
     ...(input.declaredTorsions === undefined
       ? {}
killedBy: createSpecies omits label and declaredTorsions rather than storing undefined
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/species.ts:57:9
     atoms: Object.freeze([...input.atoms]),
     bonds: Object.freeze([...(input.bonds ?? [])]),
     ...(input.label === undefined ? {} : { label: input.label }),
-    ...(input.declaredTorsions === undefined
+    ...(false
       ? {}
       : { declaredTorsions: Object.freeze([...input.declaredTorsions]) }),
killedBy: sourceAtomIds and sinkAtomIds gives the one atom a lone pair or unpaired electron sits on
statusReason: input.declaredTorsions is not iterable

[Killed] EqualityOperator
src/species.ts:57:9
     atoms: Object.freeze([...input.atoms]),
     bonds: Object.freeze([...(input.bonds ?? [])]),
     ...(input.label === undefined ? {} : { label: input.label }),
-    ...(input.declaredTorsions === undefined
+    ...(input.declaredTorsions !== undefined
       ? {}
       : { declaredTorsions: Object.freeze([...input.declaredTorsions]) }),
killedBy: declaredDeltas takes electrons off a lone pair source
statusReason: input.declaredTorsions is not iterable

[Killed] BlockStatement
src/species.ts:63:78
   });
 }
 
-export function findAtom(species: Species, atomId: AtomId): Atom | undefined {
-  return species.atoms.find((atom) => atom.id === atomId);
-}
+export function findAtom(species: Species, atomId: AtomId): Atom | undefined {}
 
 /** Same as `findAtom`, but throws. For call sites that have already checked. */
killedBy: withAtomPatch changes only the fields the patch names
statusReason: Species sp-chloromethane has no atom cl1

[Killed] ConditionalExpression
src/species.ts:64:39
 }
 
 export function findAtom(species: Species, atomId: AtomId): Atom | undefined {
-  return species.atoms.find((atom) => atom.id === atomId);
+  return species.atoms.find((atom) => true);
 }
 
killedBy: a correctly drawn step produces no findings accepts the two arrow SN2
statusReason: expected [ { arrowId: 'a1', …(4) }, …(1) ] to deeply equal []

[Killed] ArrowFunction
src/species.ts:64:29
 }
 
 export function findAtom(species: Species, atomId: AtomId): Atom | undefined {
-  return species.atoms.find((atom) => atom.id === atomId);
+  return species.atoms.find(() => undefined);
 }
 
killedBy: a rebuild carries the optional fields it did not touch keeps a declared torsion through an atom patch
statusReason: Species sp-torsioned has no atom c1

[Killed] BlockStatement
src/species.ts:68:69
 }
 
 /** Same as `findAtom`, but throws. For call sites that have already checked. */
-export function requireAtom(species: Species, atomId: AtomId): Atom {
-  const atom = findAtom(species, atomId);
-  if (atom === undefined) {
-    throw new Error(`Species ${species.id} has no atom ${atomId}`);
-  }
-  return atom;
-}
+export function requireAtom(species: Species, atomId: AtomId): Atom {}
 
 export function findBond(species: Species, bondId: BondId): Bond | undefined {
killedBy: finding atoms and bonds throws from requireAtom, naming both the species and the atom
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] EqualityOperator
src/species.ts:70:7
 /** Same as `findAtom`, but throws. For call sites that have already checked. */
 export function requireAtom(species: Species, atomId: AtomId): Atom {
   const atom = findAtom(species, atomId);
-  if (atom === undefined) {
+  if (atom !== undefined) {
     throw new Error(`Species ${species.id} has no atom ${atomId}`);
   }
killedBy: finding atoms and bonds throws from requireAtom, naming both the species and the atom
statusReason: Species sp-ethanol has no atom c2

[Killed] BlockStatement
src/species.ts:70:27
 /** Same as `findAtom`, but throws. For call sites that have already checked. */
 export function requireAtom(species: Species, atomId: AtomId): Atom {
   const atom = findAtom(species, atomId);
-  if (atom === undefined) {
-    throw new Error(`Species ${species.id} has no atom ${atomId}`);
-  }
+  if (atom === undefined) {}
   return atom;
 }
killedBy: withAtomPatch throws for an atom the species does not have
statusReason: expected [Function] to throw error matching /n1/ but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/species.ts:76:78
   return atom;
 }
 
-export function findBond(species: Species, bondId: BondId): Bond | undefined {
-  return species.bonds.find((bond) => bond.id === bondId);
-}
+export function findBond(species: Species, bondId: BondId): Bond | undefined {}
 
 export function requireBond(species: Species, bondId: BondId): Bond {
killedBy: the wording of a finding, which is what a student is shown names a single electron source and a bond source by their own words
statusReason: expected 'no species here has a bond with that …' to be 'it runs from bond b1 to between br1 a…' // Object.is equality

[Killed] ConditionalExpression
src/species.ts:77:39
 }
 
 export function findBond(species: Species, bondId: BondId): Bond | undefined {
-  return species.bonds.find((bond) => bond.id === bondId);
+  return species.bonds.find((bond) => true);
 }
 
killedBy: the wording of a finding, which is what a student is shown says an unresolvable bond source has no pair to move
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/species.ts:77:39
 }
 
 export function findBond(species: Species, bondId: BondId): Bond | undefined {
-  return species.bonds.find((bond) => bond.id === bondId);
+  return species.bonds.find((bond) => false);
 }
 
killedBy: the wording of a finding, which is what a student is shown names a single electron source and a bond source by their own words
statusReason: expected 'no species here has a bond with that …' to be 'it runs from bond b1 to between br1 a…' // Object.is equality

[Killed] BlockStatement
src/species.ts:80:69
   return species.bonds.find((bond) => bond.id === bondId);
 }
 
-export function requireBond(species: Species, bondId: BondId): Bond {
-  const bond = findBond(species, bondId);
-  if (bond === undefined) {
-    throw new Error(`Species ${species.id} has no bond ${bondId}`);
-  }
-  return bond;
-}
+export function requireBond(species: Species, bondId: BondId): Bond {}
 
 /** The bond joining two atoms, if there is one. */
killedBy: finding atoms and bonds throws from requireBond, naming both the species and the bond
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] BlockStatement
src/species.ts:82:27
 
 export function requireBond(species: Species, bondId: BondId): Bond {
   const bond = findBond(species, bondId);
-  if (bond === undefined) {
-    throw new Error(`Species ${species.id} has no bond ${bondId}`);
-  }
+  if (bond === undefined) {}
   return bond;
 }
killedBy: finding atoms and bonds throws from requireBond, naming both the species and the bond
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/species.ts:82:7
 
 export function requireBond(species: Species, bondId: BondId): Bond {
   const bond = findBond(species, bondId);
-  if (bond === undefined) {
+  if (false) {
     throw new Error(`Species ${species.id} has no bond ${bondId}`);
   }
killedBy: withBondOrder throws for a bond the species does not have
statusReason: expected [Function] to throw error matching /b9/ but got 'Cannot read properties of undefined (…'

[Killed] BlockStatement
src/species.ts:89:91
 }
 
 /** The bond joining two atoms, if there is one. */
-export function findBondBetween(species: Species, a: AtomId, b: AtomId): Bond | undefined {
-  return species.bonds.find(
-    (bond) => (bond.a === a && bond.b === b) || (bond.a === b && bond.b === a),
-  );
-}
+export function findBondBetween(species: Species, a: AtomId, b: AtomId): Bond | undefined {}
 
 export function bondsAt(species: Species, atomId: AtomId): readonly Bond[] {
killedBy: findBondBetween finds the bond whichever way round the two atoms are named
statusReason: expected undefined to be 'b2' // Object.is equality

[Killed] ConditionalExpression
src/species.ts:91:16
 /** The bond joining two atoms, if there is one. */
 export function findBondBetween(species: Species, a: AtomId, b: AtomId): Bond | undefined {
   return species.bonds.find(
-    (bond) => (bond.a === a && bond.b === b) || (bond.a === b && bond.b === a),
+    (bond) => (false) || (bond.a === b && bond.b === a),
   );
 }
killedBy: boundaries the rules turn on notes a bond between the sites when only one end of a BOND SOURCE reaches the sink
statusReason: expected 'they share none, so bond b1 reaches a…' to contain 'joined by an existing bond'

[Killed] ArrowFunction
src/species.ts:91:5
 /** The bond joining two atoms, if there is one. */
 export function findBondBetween(species: Species, a: AtomId, b: AtomId): Bond | undefined {
   return species.bonds.find(
-    (bond) => (bond.a === a && bond.b === b) || (bond.a === b && bond.b === a),
+    () => undefined,
   );
 }
killedBy: boundaries the rules turn on notes a bond between the sites when only one end of a BOND SOURCE reaches the sink
statusReason: expected 'they share none, so bond b1 reaches a…' to contain 'joined by an existing bond'

[Killed] BlockStatement
src/species.ts:95:76
   );
 }
 
-export function bondsAt(species: Species, atomId: AtomId): readonly Bond[] {
-  return species.bonds.filter((bond) => bondTouches(bond, atomId));
-}
+export function bondsAt(species: Species, atomId: AtomId): readonly Bond[] {}
 
 /** Neighbour atom ids. Implicit hydrogens are not in here; they have no id. */
killedBy: bondOrderSumAt counts implicit hydrogens as order one bonds
statusReason: (0 , bondsAt) is not a function or its return value is not iterable

[Killed] MethodExpression
src/species.ts:96:10
 }
 
 export function bondsAt(species: Species, atomId: AtomId): readonly Bond[] {
-  return species.bonds.filter((bond) => bondTouches(bond, atomId));
+  return species.bonds;
 }
 
killedBy: bondsAt and neighborIds returns every bond touching an atom
statusReason: expected [ 'b1', 'b2' ] to deeply equal [ 'b1' ]

[Killed] ArrowFunction
src/species.ts:96:31
 }
 
 export function bondsAt(species: Species, atomId: AtomId): readonly Bond[] {
-  return species.bonds.filter((bond) => bondTouches(bond, atomId));
+  return species.bonds.filter(() => undefined);
 }
 
killedBy: bondOrderSumAt counts a double bond as two
statusReason: expected +0 to be 4 // Object.is equality

[Killed] BlockStatement
src/species.ts:100:82
 }
 
 /** Neighbour atom ids. Implicit hydrogens are not in here; they have no id. */
-export function neighborIds(species: Species, atomId: AtomId): readonly AtomId[] {
-  return bondsAt(species, atomId).map((bond) => otherEnd(bond, atomId));
-}
+export function neighborIds(species: Species, atomId: AtomId): readonly AtomId[] {}
 
 /**
killedBy: bondsAt and neighborIds names the far end of every bond, never the atom itself
statusReason: expected undefined to deeply equal [ 'c1', 'o1' ]

[Killed] ArrowFunction
src/species.ts:101:39
 
 /** Neighbour atom ids. Implicit hydrogens are not in here; they have no id. */
 export function neighborIds(species: Species, atomId: AtomId): readonly AtomId[] {
-  return bondsAt(species, atomId).map((bond) => otherEnd(bond, atomId));
+  return bondsAt(species, atomId).map(() => undefined);
 }
 
killedBy: bondsAt and neighborIds names the far end of every bond, never the atom itself
statusReason: expected [ undefined, undefined ] to deeply equal [ 'c1', 'o1' ]

[Killed] BlockStatement
src/species.ts:111:70
  * a way that reads as a chemistry error rather than a data error, so it is worth
  * being able to report it by name.
  */
-export function danglingBondIds(species: Species): readonly BondId[] {
-  const known = new Set<AtomId>(species.atoms.map((atom) => atom.id));
-  return species.bonds
-    .filter((bond) => !known.has(bond.a) || !known.has(bond.b))
-    .map((bond) => bond.id);
-}
+export function danglingBondIds(species: Species): readonly BondId[] {}
 
 /**
killedBy: danglingBondIds is empty for a well formed species
statusReason: expected undefined to deeply equal []

[Killed] ArrowFunction
src/species.ts:112:51
  * being able to report it by name.
  */
 export function danglingBondIds(species: Species): readonly BondId[] {
-  const known = new Set<AtomId>(species.atoms.map((atom) => atom.id));
+  const known = new Set<AtomId>(species.atoms.map(() => undefined));
   return species.bonds
     .filter((bond) => !known.has(bond.a) || !known.has(bond.b))
killedBy: danglingBondIds is empty for a well formed species
statusReason: expected [ 'b1', 'b2' ] to deeply equal []

[Killed] MethodExpression
src/species.ts:113:10
  */
 export function danglingBondIds(species: Species): readonly BondId[] {
   const known = new Set<AtomId>(species.atoms.map((atom) => atom.id));
-  return species.bonds
-    .filter((bond) => !known.has(bond.a) || !known.has(bond.b))
+  return species.bonds
     .map((bond) => bond.id);
 }
killedBy: danglingBondIds is empty for a well formed species
statusReason: expected [ 'b1', 'b2' ] to deeply equal []

[Killed] BooleanLiteral
src/species.ts:114:23
 export function danglingBondIds(species: Species): readonly BondId[] {
   const known = new Set<AtomId>(species.atoms.map((atom) => atom.id));
   return species.bonds
-    .filter((bond) => !known.has(bond.a) || !known.has(bond.b))
+    .filter((bond) => known.has(bond.a) || !known.has(bond.b))
     .map((bond) => bond.id);
 }
killedBy: danglingBondIds is empty for a well formed species
statusReason: expected [ 'b1', 'b2' ] to deeply equal []

[Killed] ConditionalExpression
src/species.ts:114:23
 export function danglingBondIds(species: Species): readonly BondId[] {
   const known = new Set<AtomId>(species.atoms.map((atom) => atom.id));
   return species.bonds
-    .filter((bond) => !known.has(bond.a) || !known.has(bond.b))
+    .filter((bond) => true)
     .map((bond) => bond.id);
 }
killedBy: danglingBondIds is empty for a well formed species
statusReason: expected [ 'b1', 'b2' ] to deeply equal []

[Killed] ArrowFunction
src/species.ts:115:10
   const known = new Set<AtomId>(species.atoms.map((atom) => atom.id));
   return species.bonds
     .filter((bond) => !known.has(bond.a) || !known.has(bond.b))
-    .map((bond) => bond.id);
+    .map(() => undefined);
 }
 
killedBy: danglingBondIds names a bond whose first end is missing
statusReason: expected [ undefined ] to deeply equal [ 'b1' ]

[Killed] EqualityOperator
src/species.ts:127:7
  * given separate roles or declared spectators separately.
  */
 export function connectedComponentCount(species: Species): number {
-  if (species.atoms.length === 0) return 0;
+  if (species.atoms.length !== 0) return 0;
 
   const adjacency = new Map<AtomId, AtomId[]>();
killedBy: createSpecies does not enforce connectivity at construction
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/species.ts:127:7
  * given separate roles or declared spectators separately.
  */
 export function connectedComponentCount(species: Species): number {
-  if (species.atoms.length === 0) return 0;
+  if (true) return 0;
 
   const adjacency = new Map<AtomId, AtomId[]>();
killedBy: createSpecies does not enforce connectivity at construction
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/species.ts:130:37
   if (species.atoms.length === 0) return 0;
 
   const adjacency = new Map<AtomId, AtomId[]>();
-  for (const atom of species.atoms) {
-    adjacency.set(atom.id, []);
-  }
+  for (const atom of species.atoms) {}
   for (const bond of species.bonds) {
     adjacency.get(bond.a)?.push(bond.b);
killedBy: connectedComponentCount is one for a connected molecule
statusReason: expected 3 to be 1 // Object.is equality

[Killed] BlockStatement
src/species.ts:133:37
   for (const atom of species.atoms) {
     adjacency.set(atom.id, []);
   }
-  for (const bond of species.bonds) {
-    adjacency.get(bond.a)?.push(bond.b);
-    adjacency.get(bond.b)?.push(bond.a);
-  }
+  for (const bond of species.bonds) {}
 
   const seen = new Set<AtomId>();
killedBy: connectedComponentCount is one for a connected molecule
statusReason: expected 3 to be 1 // Object.is equality

[Killed] OptionalChaining
src/species.ts:134:5
     adjacency.set(atom.id, []);
   }
   for (const bond of species.bonds) {
-    adjacency.get(bond.a)?.push(bond.b);
+    adjacency.get(bond.a).push(bond.b);
     adjacency.get(bond.b)?.push(bond.a);
   }
killedBy: connectedComponentCount survives a dangling bond at either end ignores a bond whose first named atom is missing
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] OptionalChaining
src/species.ts:135:5
   }
   for (const bond of species.bonds) {
     adjacency.get(bond.a)?.push(bond.b);
-    adjacency.get(bond.b)?.push(bond.a);
+    adjacency.get(bond.b).push(bond.a);
   }
 
killedBy: connectedComponentCount ignores a bond naming an atom the species does not have
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/species.ts:141:37
   const seen = new Set<AtomId>();
   let components = 0;
 
-  for (const atom of species.atoms) {
-    if (seen.has(atom.id)) continue;
-    components += 1;
-    const stack: AtomId[] = [atom.id];
-    while (stack.length > 0) {
-      const current = stack.pop();
-      if (current === undefined || seen.has(current)) continue;
-      seen.add(current);
-      for (const next of adjacency.get(current) ?? []) {
-        if (!seen.has(next)) stack.push(next);
-      }
-    }
-  }
+  for (const atom of species.atoms) {}
 
   return components;
killedBy: createSpecies does not enforce connectivity at construction
statusReason: expected +0 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/species.ts:142:9
   let components = 0;
 
   for (const atom of species.atoms) {
-    if (seen.has(atom.id)) continue;
+    if (false) continue;
     components += 1;
     const stack: AtomId[] = [atom.id];
killedBy: connectedComponentCount is one for a connected molecule
statusReason: expected 3 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/species.ts:142:9
   let components = 0;
 
   for (const atom of species.atoms) {
-    if (seen.has(atom.id)) continue;
+    if (true) continue;
     components += 1;
     const stack: AtomId[] = [atom.id];
killedBy: createSpecies does not enforce connectivity at construction
statusReason: expected +0 to be 2 // Object.is equality

[Killed] AssignmentOperator
src/species.ts:143:5
 
   for (const atom of species.atoms) {
     if (seen.has(atom.id)) continue;
-    components += 1;
+    components -= 1;
     const stack: AtomId[] = [atom.id];
     while (stack.length > 0) {
killedBy: createSpecies does not enforce connectivity at construction
statusReason: expected -2 to be 2 // Object.is equality

[Killed] EqualityOperator
src/species.ts:145:12
     if (seen.has(atom.id)) continue;
     components += 1;
     const stack: AtomId[] = [atom.id];
-    while (stack.length > 0) {
+    while (stack.length <= 0) {
       const current = stack.pop();
       if (current === undefined || seen.has(current)) continue;
killedBy: connectedComponentCount is one for a connected molecule
statusReason: expected 3 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/species.ts:145:12
     if (seen.has(atom.id)) continue;
     components += 1;
     const stack: AtomId[] = [atom.id];
-    while (stack.length > 0) {
+    while (false) {
       const current = stack.pop();
       if (current === undefined || seen.has(current)) continue;
killedBy: connectedComponentCount is one for a connected molecule
statusReason: expected 3 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/species.ts:147:11
     const stack: AtomId[] = [atom.id];
     while (stack.length > 0) {
       const current = stack.pop();
-      if (current === undefined || seen.has(current)) continue;
+      if (true) continue;
       seen.add(current);
       for (const next of adjacency.get(current) ?? []) {
killedBy: connectedComponentCount is one for a connected molecule
statusReason: expected 3 to be 1 // Object.is equality

[Killed] EqualityOperator
src/species.ts:147:11
     const stack: AtomId[] = [atom.id];
     while (stack.length > 0) {
       const current = stack.pop();
-      if (current === undefined || seen.has(current)) continue;
+      if (current !== undefined || seen.has(current)) continue;
       seen.add(current);
       for (const next of adjacency.get(current) ?? []) {
killedBy: connectedComponentCount is one for a connected molecule
statusReason: expected 3 to be 1 // Object.is equality

[Killed] LogicalOperator
src/species.ts:149:26
       const current = stack.pop();
       if (current === undefined || seen.has(current)) continue;
       seen.add(current);
-      for (const next of adjacency.get(current) ?? []) {
+      for (const next of adjacency.get(current) && []) {
         if (!seen.has(next)) stack.push(next);
       }
killedBy: connectedComponentCount is one for a connected molecule
statusReason: expected 3 to be 1 // Object.is equality

[Killed] BlockStatement
src/species.ts:149:56
       const current = stack.pop();
       if (current === undefined || seen.has(current)) continue;
       seen.add(current);
-      for (const next of adjacency.get(current) ?? []) {
-        if (!seen.has(next)) stack.push(next);
-      }
+      for (const next of adjacency.get(current) ?? []) {}
     }
   }
killedBy: connectedComponentCount is one for a connected molecule
statusReason: expected 3 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/species.ts:150:13
       if (current === undefined || seen.has(current)) continue;
       seen.add(current);
       for (const next of adjacency.get(current) ?? []) {
-        if (!seen.has(next)) stack.push(next);
+        if (seen.has(next)) stack.push(next);
       }
     }
killedBy: connectedComponentCount is one for a connected molecule
statusReason: expected 3 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/species.ts:150:13
       if (current === undefined || seen.has(current)) continue;
       seen.add(current);
       for (const next of adjacency.get(current) ?? []) {
-        if (!seen.has(next)) stack.push(next);
+        if (false) stack.push(next);
       }
     }
killedBy: connectedComponentCount is one for a connected molecule
statusReason: expected 3 to be 1 // Object.is equality
