[Killed] ObjectLiteral
src/routes.ts:96:88
   | "hydrolysis"
   | "no_net_change";
 
-const MECHANISM_ROUTE_LABELS: Readonly<Record<MechanismRoute, string>> = Object.freeze({
-  sn1: "SN1",
-  sn2: "SN2",
-  e1: "E1",
-  e2: "E2",
-  e1cb: "E1cb",
-  nucleophilic_acyl_substitution: "nucleophilic acyl substitution",
-  nucleophilic_addition_carbonyl: "nucleophilic addition to a carbonyl",
-  electrophilic_addition_alkene: "electrophilic addition to an alkene",
-  electrophilic_aromatic_substitution: "electrophilic aromatic substitution",
-  nucleophilic_aromatic_substitution: "nucleophilic aromatic substitution",
-  radical_halogenation: "radical halogenation",
-  radical_addition: "radical addition",
-  acid_base_proton_transfer: "acid base proton transfer",
-  resonance: "resonance delocalisation",
-  carbocation_rearrangement: "carbocation rearrangement",
-  oxidation: "oxidation",
-  reduction: "reduction",
-  pericyclic: "pericyclic reaction",
-});
+const MECHANISM_ROUTE_LABELS: Readonly<Record<MechanismRoute, string>> = Object.freeze({});
 
 /** The human readable name of a route, for feedback text. */
killedBy: the route registry is frozen and non empty
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/routes.ts:98:8
 
 const MECHANISM_ROUTE_LABELS: Readonly<Record<MechanismRoute, string>> = Object.freeze({
   sn1: "SN1",
-  sn2: "SN2",
+  sn2: "",
   e1: "E1",
   e2: "E2",
killedBy: routeLabel gives every route a non empty human readable label
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/routes.ts:109:30
   nucleophilic_aromatic_substitution: "nucleophilic aromatic substitution",
   radical_halogenation: "radical halogenation",
   radical_addition: "radical addition",
-  acid_base_proton_transfer: "acid base proton transfer",
+  acid_base_proton_transfer: "",
   resonance: "resonance delocalisation",
   carbocation_rearrangement: "carbocation rearrangement",
killedBy: routeLabel gives every route a non empty human readable label
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/routes.ts:110:14
   radical_halogenation: "radical halogenation",
   radical_addition: "radical addition",
   acid_base_proton_transfer: "acid base proton transfer",
-  resonance: "resonance delocalisation",
+  resonance: "",
   carbocation_rearrangement: "carbocation rearrangement",
   oxidation: "oxidation",
killedBy: routeLabel gives every route a non empty human readable label
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/routes.ts:111:30
   radical_addition: "radical addition",
   acid_base_proton_transfer: "acid base proton transfer",
   resonance: "resonance delocalisation",
-  carbocation_rearrangement: "carbocation rearrangement",
+  carbocation_rearrangement: "",
   oxidation: "oxidation",
   reduction: "reduction",
killedBy: routeLabel gives every route a non empty human readable label
statusReason: expected 0 to be greater than 0

[Killed] StringLiteral
src/routes.ts:112:14
   acid_base_proton_transfer: "acid base proton transfer",
   resonance: "resonance delocalisation",
   carbocation_rearrangement: "carbocation rearrangement",
-  oxidation: "oxidation",
+  oxidation: "",
   reduction: "reduction",
   pericyclic: "pericyclic reaction",
killedBy: routeLabel gives every route a non empty human readable label
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/routes.ts:118:59
 });
 
 /** The human readable name of a route, for feedback text. */
-export function routeLabel(route: MechanismRoute): string {
-  return MECHANISM_ROUTE_LABELS[route];
-}
+export function routeLabel(route: MechanismRoute): string {}
 
 export function allMechanismRoutes(): readonly MechanismRoute[] {
killedBy: routeLabel gives every route a non empty human readable label
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] BlockStatement
src/routes.ts:122:65
   return MECHANISM_ROUTE_LABELS[route];
 }
 
-export function allMechanismRoutes(): readonly MechanismRoute[] {
-  return Object.freeze(Object.keys(MECHANISM_ROUTE_LABELS) as MechanismRoute[]);
-}
+export function allMechanismRoutes(): readonly MechanismRoute[] {}
 
killedBy: the route registry is frozen and non empty
statusReason: Cannot read properties of undefined (reading 'length')
