[Killed] BlockStatement
src/state.ts:102:73
   readonly spectators?: readonly SpectatorDeclaration[];
 }
 
-export function createState(input: MechanismStateInput): MechanismState {
-  return Object.freeze({
-    id: input.id,
-    members: Object.freeze([...input.members]),
-    spectators: Object.freeze([...(input.spectators ?? [])]),
-  });
-}
+export function createState(input: MechanismStateInput): MechanismState {}
 
 export function isSpectator(state: MechanismState, speciesId: SpeciesId): boolean {
killedBy: an edit that names a target touches only that target replaces the named species only, in a state with more than one member
statusReason: Cannot read properties of undefined (reading 'members')

[Killed] ObjectLiteral
src/state.ts:103:24
 }
 
 export function createState(input: MechanismStateInput): MechanismState {
-  return Object.freeze({
-    id: input.id,
-    members: Object.freeze([...input.members]),
-    spectators: Object.freeze([...(input.spectators ?? [])]),
-  });
+  return Object.freeze({});
 }
 
killedBy: createState defaults spectators to an empty list
statusReason: expected undefined to deeply equal []

[Killed] LogicalOperator
src/state.ts:106:36
   return Object.freeze({
     id: input.id,
     members: Object.freeze([...input.members]),
-    spectators: Object.freeze([...(input.spectators ?? [])]),
+    spectators: Object.freeze([...(input.spectators && [])]),
   });
 }
killedBy: an edit that names a target touches only that target replaces the named species only, in a state with more than one member
statusReason: (intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] BlockStatement
src/state.ts:110:83
   });
 }
 
-export function isSpectator(state: MechanismState, speciesId: SpeciesId): boolean {
-  return state.spectators.some((declaration) => declaration.speciesId === speciesId);
-}
+export function isSpectator(state: MechanismState, speciesId: SpeciesId): boolean {}
 
 export function spectatorDeclarationFor(
killedBy: conservedTotals excludes spectators by default, which is what declaring one means
statusReason: expected [ 'sp-chloromethane', 'sp-sodium' ] to deeply equal [ 'sp-chloromethane' ]

[Killed] ConditionalExpression
src/state.ts:111:49
 }
 
 export function isSpectator(state: MechanismState, speciesId: SpeciesId): boolean {
-  return state.spectators.some((declaration) => declaration.speciesId === speciesId);
+  return state.spectators.some((declaration) => false);
 }
 
killedBy: conservedTotals excludes spectators by default, which is what declaring one means
statusReason: expected [ 'sp-chloromethane', 'sp-sodium' ] to deeply equal [ 'sp-chloromethane' ]

[Killed] MethodExpression
src/state.ts:111:10
 }
 
 export function isSpectator(state: MechanismState, speciesId: SpeciesId): boolean {
-  return state.spectators.some((declaration) => declaration.speciesId === speciesId);
+  return state.spectators.every(declaration => declaration.speciesId === speciesId);
 }
 
killedBy: conservedTotals sums charge and electrons across the whole multiset
statusReason: expected +0 to be -1 // Object.is equality

[Killed] BlockStatement
src/state.ts:117:37
 export function spectatorDeclarationFor(
   state: MechanismState,
   speciesId: SpeciesId,
-): SpectatorDeclaration | undefined {
-  return state.spectators.find((declaration) => declaration.speciesId === speciesId);
-}
+): SpectatorDeclaration | undefined {}
 
 /** Members that conservation is asserted over. Spectators are excluded. */
killedBy: the system boundary hands back the declaration itself, with the reason and the author
statusReason: expected undefined to be 'unreacting_counterion' // Object.is equality

[Killed] ConditionalExpression
src/state.ts:118:49
   state: MechanismState,
   speciesId: SpeciesId,
 ): SpectatorDeclaration | undefined {
-  return state.spectators.find((declaration) => declaration.speciesId === speciesId);
+  return state.spectators.find((declaration) => true);
 }
 
killedBy: the system boundary hands back the declaration itself, with the reason and the author
statusReason: expected { speciesId: 'sp-sodium', …(3) } to be undefined

[Killed] ArrowFunction
src/state.ts:118:32
   state: MechanismState,
   speciesId: SpeciesId,
 ): SpectatorDeclaration | undefined {
-  return state.spectators.find((declaration) => declaration.speciesId === speciesId);
+  return state.spectators.find(() => undefined);
 }
 
killedBy: the system boundary hands back the declaration itself, with the reason and the author
statusReason: expected undefined to be 'unreacting_counterion' // Object.is equality

[Killed] BlockStatement
src/state.ts:122:85
 }
 
 /** Members that conservation is asserted over. Spectators are excluded. */
-export function participatingMembers(state: MechanismState): readonly StateMember[] {
-  return state.members.filter((member) => !isSpectator(state, member.species.id));
-}
+export function participatingMembers(state: MechanismState): readonly StateMember[] {}
 
 export function spectatorMembers(state: MechanismState): readonly StateMember[] {
killedBy: conservedTotals excludes spectators by default, which is what declaring one means
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] MethodExpression
src/state.ts:123:10
 
 /** Members that conservation is asserted over. Spectators are excluded. */
 export function participatingMembers(state: MechanismState): readonly StateMember[] {
-  return state.members.filter((member) => !isSpectator(state, member.species.id));
+  return state.members;
 }
 
killedBy: conservedTotals excludes spectators by default, which is what declaring one means
statusReason: expected [ 'sp-chloromethane', 'sp-sodium' ] to deeply equal [ 'sp-chloromethane' ]

[Killed] BooleanLiteral
src/state.ts:123:43
 
 /** Members that conservation is asserted over. Spectators are excluded. */
 export function participatingMembers(state: MechanismState): readonly StateMember[] {
-  return state.members.filter((member) => !isSpectator(state, member.species.id));
+  return state.members.filter((member) => isSpectator(state, member.species.id));
 }
 
killedBy: conservedTotals excludes spectators by default, which is what declaring one means
statusReason: expected [ 'sp-sodium' ] to deeply equal [ 'sp-chloromethane' ]

[Killed] BlockStatement
src/state.ts:126:81
   return state.members.filter((member) => !isSpectator(state, member.species.id));
 }
 
-export function spectatorMembers(state: MechanismState): readonly StateMember[] {
-  return state.members.filter((member) => isSpectator(state, member.species.id));
-}
+export function spectatorMembers(state: MechanismState): readonly StateMember[] {}
 
 /**
killedBy: the system boundary excludes spectators from the participating members and includes them nowhere else
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/state.ts:127:31
 }
 
 export function spectatorMembers(state: MechanismState): readonly StateMember[] {
-  return state.members.filter((member) => isSpectator(state, member.species.id));
+  return state.members.filter(() => undefined);
 }
 
killedBy: the system boundary excludes spectators from the participating members and includes them nowhere else
statusReason: expected [] to deeply equal [ 'sp-sodium' ]

[Killed] MethodExpression
src/state.ts:127:10
 }
 
 export function spectatorMembers(state: MechanismState): readonly StateMember[] {
-  return state.members.filter((member) => isSpectator(state, member.species.id));
+  return state.members;
 }
 
killedBy: the system boundary excludes spectators from the participating members and includes them nowhere else
statusReason: expected [ 'sp-chloromethane', …(2) ] to deeply equal [ 'sp-sodium' ]

[Killed] BlockStatement
src/state.ts:139:36
  */
 export function orphanSpectatorDeclarations(
   state: MechanismState,
-): readonly SpectatorDeclaration[] {
-  const present = new Set<SpeciesId>(state.members.map((member) => member.species.id));
-  return state.spectators.filter((declaration) => !present.has(declaration.speciesId));
-}
+): readonly SpectatorDeclaration[] {}
 
 export function findSpecies(state: MechanismState, speciesId: SpeciesId): Species | undefined {
killedBy: the system boundary names a declaration that points at a species not in the state
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] ArrowFunction
src/state.ts:140:56
 export function orphanSpectatorDeclarations(
   state: MechanismState,
 ): readonly SpectatorDeclaration[] {
-  const present = new Set<SpeciesId>(state.members.map((member) => member.species.id));
+  const present = new Set<SpeciesId>(state.members.map(() => undefined));
   return state.spectators.filter((declaration) => !present.has(declaration.speciesId));
 }
killedBy: the system boundary names a declaration that points at a species not in the state
statusReason: expected [ { speciesId: 'sp-sodium', …(3) } ] to deeply equal []

[Killed] BooleanLiteral
src/state.ts:141:51
   state: MechanismState,
 ): readonly SpectatorDeclaration[] {
   const present = new Set<SpeciesId>(state.members.map((member) => member.species.id));
-  return state.spectators.filter((declaration) => !present.has(declaration.speciesId));
+  return state.spectators.filter((declaration) => present.has(declaration.speciesId));
 }
 
killedBy: the system boundary names a declaration that points at a species not in the state
statusReason: expected [] to deeply equal [ 'sp-absent' ]

[Killed] ArrowFunction
src/state.ts:141:34
   state: MechanismState,
 ): readonly SpectatorDeclaration[] {
   const present = new Set<SpeciesId>(state.members.map((member) => member.species.id));
-  return state.spectators.filter((declaration) => !present.has(declaration.speciesId));
+  return state.spectators.filter(() => undefined);
 }
 
killedBy: the system boundary names a declaration that points at a species not in the state
statusReason: expected [] to deeply equal [ 'sp-absent' ]

[Killed] BlockStatement
src/state.ts:144:95
   return state.spectators.filter((declaration) => !present.has(declaration.speciesId));
 }
 
-export function findSpecies(state: MechanismState, speciesId: SpeciesId): Species | undefined {
-  return state.members.find((member) => member.species.id === speciesId)?.species;
-}
+export function findSpecies(state: MechanismState, speciesId: SpeciesId): Species | undefined {}
 
 export function findMember(state: MechanismState, speciesId: SpeciesId): StateMember | undefined {
killedBy: lookups across the multiset finds a species and its membership by id
statusReason: expected undefined to be 'sp-hydroxide' // Object.is equality

[Killed] EqualityOperator
src/state.ts:145:41
 }
 
 export function findSpecies(state: MechanismState, speciesId: SpeciesId): Species | undefined {
-  return state.members.find((member) => member.species.id === speciesId)?.species;
+  return state.members.find((member) => member.species.id !== speciesId)?.species;
 }
 
killedBy: lookups across the multiset finds a species and its membership by id
statusReason: expected 'sp-chloromethane' to be 'sp-hydroxide' // Object.is equality

[Killed] ConditionalExpression
src/state.ts:145:41
 }
 
 export function findSpecies(state: MechanismState, speciesId: SpeciesId): Species | undefined {
-  return state.members.find((member) => member.species.id === speciesId)?.species;
+  return state.members.find((member) => true)?.species;
 }
 
killedBy: lookups across the multiset finds a species and its membership by id
statusReason: expected 'sp-chloromethane' to be 'sp-hydroxide' // Object.is equality

[Killed] BlockStatement
src/state.ts:148:98
   return state.members.find((member) => member.species.id === speciesId)?.species;
 }
 
-export function findMember(state: MechanismState, speciesId: SpeciesId): StateMember | undefined {
-  return state.members.find((member) => member.species.id === speciesId);
-}
+export function findMember(state: MechanismState, speciesId: SpeciesId): StateMember | undefined {}
 
 export interface AtomLocation {
killedBy: lookups across the multiset finds a species and its membership by id
statusReason: expected undefined to be 'nucleophile' // Object.is equality

[Killed] ArrowFunction
src/state.ts:149:29
 }
 
 export function findMember(state: MechanismState, speciesId: SpeciesId): StateMember | undefined {
-  return state.members.find((member) => member.species.id === speciesId);
+  return state.members.find(() => undefined);
 }
 
killedBy: lookups across the multiset finds a species and its membership by id
statusReason: expected undefined to be 'nucleophile' // Object.is equality

[Killed] ConditionalExpression
src/state.ts:149:41
 }
 
 export function findMember(state: MechanismState, speciesId: SpeciesId): StateMember | undefined {
-  return state.members.find((member) => member.species.id === speciesId);
+  return state.members.find((member) => false);
 }
 
killedBy: lookups across the multiset finds a species and its membership by id
statusReason: expected undefined to be 'nucleophile' // Object.is equality

[Killed] BlockStatement
src/state.ts:164:98
  * what lets an arrow name a source in one molecule and a sink in another without
  * carrying a species id on every endpoint.
  */
-export function findAtomInState(state: MechanismState, atomId: AtomId): AtomLocation | undefined {
-  for (const member of state.members) {
-    const atom = findAtom(member.species, atomId);
-    if (atom !== undefined) {
-      return { species: member.species, atom };
-    }
-  }
-  return undefined;
-}
+export function findAtomInState(state: MechanismState, atomId: AtomId): AtomLocation | undefined {}
 
 /**
killedBy: the wording of a finding, which is what a student is shown names a lone pair source and an atom sink in the message
statusReason: expected undefined to be 'the source site {o1} and the sink sit…' // Object.is equality

[Killed] BlockStatement
src/state.ts:165:39
  * carrying a species id on every endpoint.
  */
 export function findAtomInState(state: MechanismState, atomId: AtomId): AtomLocation | undefined {
-  for (const member of state.members) {
-    const atom = findAtom(member.species, atomId);
-    if (atom !== undefined) {
-      return { species: member.species, atom };
-    }
-  }
+  for (const member of state.members) {}
   return undefined;
 }
killedBy: lookups across the multiset finds an atom in whichever species holds it, and reports both
statusReason: expected undefined to be 'sp-hydroxide' // Object.is equality

[Killed] EqualityOperator
src/state.ts:167:9
 export function findAtomInState(state: MechanismState, atomId: AtomId): AtomLocation | undefined {
   for (const member of state.members) {
     const atom = findAtom(member.species, atomId);
-    if (atom !== undefined) {
+    if (atom === undefined) {
       return { species: member.species, atom };
     }
killedBy: lookups across the multiset finds an atom in whichever species holds it, and reports both
statusReason: expected 'sp-chloromethane' to be 'sp-hydroxide' // Object.is equality

[Killed] BlockStatement
src/state.ts:167:29
 export function findAtomInState(state: MechanismState, atomId: AtomId): AtomLocation | undefined {
   for (const member of state.members) {
     const atom = findAtom(member.species, atomId);
-    if (atom !== undefined) {
-      return { species: member.species, atom };
-    }
+    if (atom !== undefined) {}
   }
   return undefined;
killedBy: lookups across the multiset finds an atom in whichever species holds it, and reports both
statusReason: expected undefined to be 'sp-hydroxide' // Object.is equality

[Killed] BlockStatement
src/state.ts:181:76
  * molecule happens to be first in the list, which is a bug that shows up as
  * chemistry going wrong in one molecule and not the other.
  */
-export function duplicateAtomIds(state: MechanismState): readonly AtomId[] {
-  const seen = new Set<AtomId>();
-  const duplicates = new Set<AtomId>();
-  for (const member of state.members) {
-    for (const atom of member.species.atoms) {
-      if (seen.has(atom.id)) {
-        duplicates.add(atom.id);
-      }
-      seen.add(atom.id);
-    }
-  }
-  return [...duplicates];
-}
+export function duplicateAtomIds(state: MechanismState): readonly AtomId[] {}
 
 /**
killedBy: duplicate ids finds no duplicates in a well formed state
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
src/state.ts:184:39
 export function duplicateAtomIds(state: MechanismState): readonly AtomId[] {
   const seen = new Set<AtomId>();
   const duplicates = new Set<AtomId>();
-  for (const member of state.members) {
-    for (const atom of member.species.atoms) {
-      if (seen.has(atom.id)) {
-        duplicates.add(atom.id);
-      }
-      seen.add(atom.id);
-    }
-  }
+  for (const member of state.members) {}
   return [...duplicates];
 }
killedBy: duplicate ids names an atom id used in two species
statusReason: expected [] to deeply equal [ 'c1' ]

[Killed] BlockStatement
src/state.ts:185:46
   const seen = new Set<AtomId>();
   const duplicates = new Set<AtomId>();
   for (const member of state.members) {
-    for (const atom of member.species.atoms) {
-      if (seen.has(atom.id)) {
-        duplicates.add(atom.id);
-      }
-      seen.add(atom.id);
-    }
+    for (const atom of member.species.atoms) {}
   }
   return [...duplicates];
killedBy: duplicate ids names an atom id used in two species
statusReason: expected [] to deeply equal [ 'c1' ]

[Killed] ConditionalExpression
src/state.ts:186:11
   const duplicates = new Set<AtomId>();
   for (const member of state.members) {
     for (const atom of member.species.atoms) {
-      if (seen.has(atom.id)) {
+      if (false) {
         duplicates.add(atom.id);
       }
killedBy: duplicate ids names an atom id used in two species
statusReason: expected [] to deeply equal [ 'c1' ]

[Killed] BlockStatement
src/state.ts:186:30
   const duplicates = new Set<AtomId>();
   for (const member of state.members) {
     for (const atom of member.species.atoms) {
-      if (seen.has(atom.id)) {
-        duplicates.add(atom.id);
-      }
+      if (seen.has(atom.id)) {}
       seen.add(atom.id);
     }
killedBy: duplicate ids names an atom id used in two species
statusReason: expected [] to deeply equal [ 'c1' ]

[Killed] BlockStatement
src/state.ts:212:82
  *
  * Returned sorted so a failure report is stable between runs.
  */
-export function duplicateSpeciesIds(state: MechanismState): readonly SpeciesId[] {
-  const seen = new Set<SpeciesId>();
-  const duplicates = new Set<SpeciesId>();
-  for (const member of state.members) {
-    if (seen.has(member.species.id)) {
-      duplicates.add(member.species.id);
-    }
-    seen.add(member.species.id);
-  }
-  return [...duplicates].sort();
-}
+export function duplicateSpeciesIds(state: MechanismState): readonly SpeciesId[] {}
 
 /** How many members of this state carry a given species id. Normally 0 or 1. */
killedBy: duplicate ids finds no duplicates in a well formed state
statusReason: expected undefined to deeply equal []

[Killed] BlockStatement
src/state.ts:215:39
 export function duplicateSpeciesIds(state: MechanismState): readonly SpeciesId[] {
   const seen = new Set<SpeciesId>();
   const duplicates = new Set<SpeciesId>();
-  for (const member of state.members) {
-    if (seen.has(member.species.id)) {
-      duplicates.add(member.species.id);
-    }
-    seen.add(member.species.id);
-  }
+  for (const member of state.members) {}
   return [...duplicates].sort();
 }
killedBy: duplicate ids names a species id used by two members
statusReason: expected [] to deeply equal [ 'sp-water' ]

[Killed] BlockStatement
src/state.ts:216:38
   const seen = new Set<SpeciesId>();
   const duplicates = new Set<SpeciesId>();
   for (const member of state.members) {
-    if (seen.has(member.species.id)) {
-      duplicates.add(member.species.id);
-    }
+    if (seen.has(member.species.id)) {}
     seen.add(member.species.id);
   }
killedBy: duplicate ids names a species id used by two members
statusReason: expected [] to deeply equal [ 'sp-water' ]

[Killed] ConditionalExpression
src/state.ts:216:9
   const seen = new Set<SpeciesId>();
   const duplicates = new Set<SpeciesId>();
   for (const member of state.members) {
-    if (seen.has(member.species.id)) {
+    if (false) {
       duplicates.add(member.species.id);
     }
killedBy: duplicate ids names a species id used by two members
statusReason: expected [] to deeply equal [ 'sp-water' ]

[Killed] MethodExpression
src/state.ts:221:10
     }
     seen.add(member.species.id);
   }
-  return [...duplicates].sort();
+  return [...duplicates];
 }
 
killedBy: duplicate ids sorts duplicate species ids, so a failure report is stable between runs
statusReason: expected [ 'sp-zeta', 'sp-alpha' ] to deeply equal [ 'sp-alpha', 'sp-zeta' ]

[Killed] BlockStatement
src/state.ts:225:91
 }
 
 /** How many members of this state carry a given species id. Normally 0 or 1. */
-export function speciesIdOccurrences(state: MechanismState, speciesId: SpeciesId): number {
-  return state.members.filter((member) => member.species.id === speciesId).length;
-}
+export function speciesIdOccurrences(state: MechanismState, speciesId: SpeciesId): number {}
 
 export interface BondLocation {
killedBy: speciesIdOccurrences is one for a species present once
statusReason: expected undefined to be 1 // Object.is equality

[Killed] MethodExpression
src/state.ts:226:10
 
 /** How many members of this state carry a given species id. Normally 0 or 1. */
 export function speciesIdOccurrences(state: MechanismState, speciesId: SpeciesId): number {
-  return state.members.filter((member) => member.species.id === speciesId).length;
+  return state.members.length;
 }
 
killedBy: speciesIdOccurrences is one for a species present once
statusReason: expected 3 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/state.ts:226:43
 
 /** How many members of this state carry a given species id. Normally 0 or 1. */
 export function speciesIdOccurrences(state: MechanismState, speciesId: SpeciesId): number {
-  return state.members.filter((member) => member.species.id === speciesId).length;
+  return state.members.filter((member) => true).length;
 }
 
killedBy: speciesIdOccurrences is one for a species present once
statusReason: expected 3 to be 1 // Object.is equality

[Killed] BlockStatement
src/state.ts:241:98
  * first match. A state carrying the same bond id in two species is a data error
  * the valence check reports; this function does not silently arbitrate it.
  */
-export function findBondInState(state: MechanismState, bondId: BondId): BondLocation | undefined {
-  for (const member of state.members) {
-    const bond = findBond(member.species, bondId);
-    if (bond !== undefined) {
-      return { species: member.species, bond };
-    }
-  }
-  return undefined;
-}
+export function findBondInState(state: MechanismState, bondId: BondId): BondLocation | undefined {}
 
 /**
killedBy: the wording of a finding, which is what a student is shown names a single electron source and a bond source by their own words
statusReason: expected 'no species here has a bond with that …' to be 'it runs from bond b1 to between br1 a…' // Object.is equality

[Killed] BlockStatement
src/state.ts:242:39
  * the valence check reports; this function does not silently arbitrate it.
  */
 export function findBondInState(state: MechanismState, bondId: BondId): BondLocation | undefined {
-  for (const member of state.members) {
-    const bond = findBond(member.species, bondId);
-    if (bond !== undefined) {
-      return { species: member.species, bond };
-    }
-  }
+  for (const member of state.members) {}
   return undefined;
 }
killedBy: lookups across the multiset finds a bond in whichever species holds it
statusReason: expected undefined to be 'sp-chloromethane' // Object.is equality

[Killed] EqualityOperator
src/state.ts:244:9
 export function findBondInState(state: MechanismState, bondId: BondId): BondLocation | undefined {
   for (const member of state.members) {
     const bond = findBond(member.species, bondId);
-    if (bond !== undefined) {
+    if (bond === undefined) {
       return { species: member.species, bond };
     }
killedBy: lookups across the multiset finds a bond in whichever species holds it
statusReason: expected 'sp-hydroxide' to be 'sp-chloromethane' // Object.is equality

[Killed] BlockStatement
src/state.ts:244:29
 export function findBondInState(state: MechanismState, bondId: BondId): BondLocation | undefined {
   for (const member of state.members) {
     const bond = findBond(member.species, bondId);
-    if (bond !== undefined) {
-      return { species: member.species, bond };
-    }
+    if (bond !== undefined) {}
   }
   return undefined;
killedBy: lookups across the multiset finds a bond in whichever species holds it
statusReason: expected undefined to be 'sp-chloromethane' // Object.is equality

[Killed] ObjectLiteral
src/state.ts:245:14
   for (const member of state.members) {
     const bond = findBond(member.species, bondId);
     if (bond !== undefined) {
-      return { species: member.species, bond };
+      return {};
     }
   }
killedBy: the wording of a finding, which is what a student is shown names a single electron source and a bond source by their own words
statusReason: Cannot read properties of undefined (reading 'order')

[Killed] BlockStatement
src/state.ts:258:86
  * right adjacency test for arrow legality: an arrow reaching from one molecule
  * into another has to form a bond, it cannot travel along one that is not there.
  */
-export function atomsAreBonded(state: MechanismState, a: AtomId, b: AtomId): boolean {
-  if (a === b) return false;
-  for (const member of state.members) {
-    if (findBondBetween(member.species, a, b) !== undefined) return true;
-  }
-  return false;
-}
+export function atomsAreBonded(state: MechanismState, a: AtomId, b: AtomId): boolean {}
 
 export function allAtoms(state: MechanismState): readonly Atom[] {
killedBy: boundaries the rules turn on notes a bond between the sites when only one end of a BOND SOURCE reaches the sink
statusReason: expected 'they share none, so bond b1 reaches a…' to contain 'joined by an existing bond'

[Killed] BooleanLiteral
src/state.ts:259:23
  * into another has to form a bond, it cannot travel along one that is not there.
  */
 export function atomsAreBonded(state: MechanismState, a: AtomId, b: AtomId): boolean {
-  if (a === b) return false;
+  if (a === b) return true;
   for (const member of state.members) {
     if (findBondBetween(member.species, a, b) !== undefined) return true;
killedBy: atomsAreBonded is false for an atom and itself, which is not a bond
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/state.ts:259:7
  * into another has to form a bond, it cannot travel along one that is not there.
  */
 export function atomsAreBonded(state: MechanismState, a: AtomId, b: AtomId): boolean {
-  if (a === b) return false;
+  if (true) return false;
   for (const member of state.members) {
     if (findBondBetween(member.species, a, b) !== undefined) return true;
killedBy: boundaries the rules turn on notes a bond between the sites when only one end of a BOND SOURCE reaches the sink
statusReason: expected 'they share none, so bond b1 reaches a…' to contain 'joined by an existing bond'

[Killed] BlockStatement
src/state.ts:260:39
  */
 export function atomsAreBonded(state: MechanismState, a: AtomId, b: AtomId): boolean {
   if (a === b) return false;
-  for (const member of state.members) {
-    if (findBondBetween(member.species, a, b) !== undefined) return true;
-  }
+  for (const member of state.members) {}
   return false;
 }
killedBy: atomsAreBonded is true for two atoms joined inside one species
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/state.ts:261:9
 export function atomsAreBonded(state: MechanismState, a: AtomId, b: AtomId): boolean {
   if (a === b) return false;
   for (const member of state.members) {
-    if (findBondBetween(member.species, a, b) !== undefined) return true;
+    if (false) return true;
   }
   return false;
killedBy: boundaries the rules turn on notes a bond between the sites when only one end of a BOND SOURCE reaches the sink
statusReason: expected 'they share none, so bond b1 reaches a…' to contain 'joined by an existing bond'

[Killed] BooleanLiteral
src/state.ts:261:69
 export function atomsAreBonded(state: MechanismState, a: AtomId, b: AtomId): boolean {
   if (a === b) return false;
   for (const member of state.members) {
-    if (findBondBetween(member.species, a, b) !== undefined) return true;
+    if (findBondBetween(member.species, a, b) !== undefined) return false;
   }
   return false;
killedBy: boundaries the rules turn on notes a bond between the sites when only one end of a BOND SOURCE reaches the sink
statusReason: expected 'they share none, so bond b1 reaches a…' to contain 'joined by an existing bond'

[Killed] BlockStatement
src/state.ts:266:66
   return false;
 }
 
-export function allAtoms(state: MechanismState): readonly Atom[] {
-  return state.members.flatMap((member) => [...member.species.atoms]);
-}
+export function allAtoms(state: MechanismState): readonly Atom[] {}
 
 export function membersWithRole(
killedBy: lookups across the multiset lists every atom in the state, spectators included
statusReason: Cannot read properties of undefined (reading 'map')
