[Killed] ArrowFunction
src/state.ts:267:32
 }
 
 export function allAtoms(state: MechanismState): readonly Atom[] {
-  return state.members.flatMap((member) => [...member.species.atoms]);
+  return state.members.flatMap(() => undefined);
 }
 
killedBy: lookups across the multiset lists every atom in the state, spectators included
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ArrayDeclaration
src/state.ts:267:44
 }
 
 export function allAtoms(state: MechanismState): readonly Atom[] {
-  return state.members.flatMap((member) => [...member.species.atoms]);
+  return state.members.flatMap((member) => []);
 }
 
killedBy: lookups across the multiset lists every atom in the state, spectators included
statusReason: expected [] to deeply equal [ 'c1', 'cl1', 'na1', 'o1' ]

[Killed] BlockStatement
src/state.ts:273:27
 export function membersWithRole(
   state: MechanismState,
   role: SpeciesRole,
-): readonly StateMember[] {
-  return state.members.filter((member) => member.role === role);
-}
+): readonly StateMember[] {}
 
killedBy: lookups across the multiset filters members by role
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] MethodExpression
src/state.ts:274:10
   state: MechanismState,
   role: SpeciesRole,
 ): readonly StateMember[] {
-  return state.members.filter((member) => member.role === role);
+  return state.members;
 }
 
killedBy: lookups across the multiset filters members by role
statusReason: expected [ 'sp-chloromethane', …(2) ] to deeply equal [ 'sp-hydroxide' ]

[Killed] ConditionalExpression
src/state.ts:274:43
   state: MechanismState,
   role: SpeciesRole,
 ): readonly StateMember[] {
-  return state.members.filter((member) => member.role === role);
+  return state.members.filter((member) => false);
 }
 
killedBy: lookups across the multiset filters members by role
statusReason: expected [] to deeply equal [ 'sp-hydroxide' ]
