[Killed] BlockStatement
src/step.ts:82:70
   readonly arrows?: readonly ElectronFlowArrow[];
 }
 
-export function createStep(input: MechanismStepInput): MechanismStep {
-  return Object.freeze({
-    id: input.id,
-    from: input.from,
-    to: input.to,
-    arrows: Object.freeze([...(input.arrows ?? [])]),
-    identity: Object.freeze({
-      elementaryStep: input.identity.elementaryStep,
-      reactionCenters: Object.freeze([...input.identity.reactionCenters]),
-      ...(input.identity.route === undefined ? {} : { route: input.identity.route }),
-    }),
-  });
-}
+export function createStep(input: MechanismStepInput): MechanismStep {}
 
 /**
killedBy: createStep keeps the two states as given, and does not mutate `from`
statusReason: Cannot read properties of undefined (reading 'from')

[Killed] LogicalOperator
src/step.ts:87:32
     id: input.id,
     from: input.from,
     to: input.to,
-    arrows: Object.freeze([...(input.arrows ?? [])]),
+    arrows: Object.freeze([...(input.arrows && [])]),
     identity: Object.freeze({
       elementaryStep: input.identity.elementaryStep,
killedBy: createStep keeps the two states as given, and does not mutate `from`
statusReason: (intermediate value)(intermediate value)(intermediate value) is not iterable

[Killed] ConditionalExpression
src/step.ts:91:11
     identity: Object.freeze({
       elementaryStep: input.identity.elementaryStep,
       reactionCenters: Object.freeze([...input.identity.reactionCenters]),
-      ...(input.identity.route === undefined ? {} : { route: input.identity.route }),
+      ...(false ? {} : { route: input.identity.route }),
     }),
   });
killedBy: createStep omits route rather than storing undefined, because a lone proton transfer has none
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/step.ts:91:11
     identity: Object.freeze({
       elementaryStep: input.identity.elementaryStep,
       reactionCenters: Object.freeze([...input.identity.reactionCenters]),
-      ...(input.identity.route === undefined ? {} : { route: input.identity.route }),
+      ...(true ? {} : { route: input.identity.route }),
     }),
   });
killedBy: createStep carries axis one, the identity, separately from anything a student did
statusReason: expected undefined to be 'sn1' // Object.is equality

[Killed] BlockStatement
src/step.ts:138:79
   readonly annotations?: readonly AuthoredAnnotation[];
 }
 
-export function createPathway(input: MechanismPathwayInput): MechanismPathway {
-  return Object.freeze({
-    id: input.id,
-    route: input.route,
-    steps: Object.freeze([...input.steps]),
-    ...(input.annotations === undefined
-      ? {}
-      : { annotations: Object.freeze([...input.annotations]) }),
-  });
-}
+export function createPathway(input: MechanismPathwayInput): MechanismPathway {}
 
 /** The state a pathway starts from, if it has any steps. */
killedBy: createPathway keeps its id, route, and steps
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ObjectLiteral
src/step.ts:139:24
 }
 
 export function createPathway(input: MechanismPathwayInput): MechanismPathway {
-  return Object.freeze({
-    id: input.id,
-    route: input.route,
-    steps: Object.freeze([...input.steps]),
-    ...(input.annotations === undefined
-      ? {}
-      : { annotations: Object.freeze([...input.annotations]) }),
-  });
+  return Object.freeze({});
 }
 
killedBy: createPathway keeps its id, route, and steps
statusReason: expected undefined to be 'p1' // Object.is equality

[Killed] ArrayDeclaration
src/step.ts:142:26
   return Object.freeze({
     id: input.id,
     route: input.route,
-    steps: Object.freeze([...input.steps]),
+    steps: Object.freeze([]),
     ...(input.annotations === undefined
       ? {}
killedBy: createPathway keeps its id, route, and steps
statusReason: expected [] to have a length of 1 but got +0

[Killed] ConditionalExpression
src/step.ts:143:9
     id: input.id,
     route: input.route,
     steps: Object.freeze([...input.steps]),
-    ...(input.annotations === undefined
+    ...(false
       ? {}
       : { annotations: Object.freeze([...input.annotations]) }),
killedBy: createPathway keeps its id, route, and steps
statusReason: input.annotations is not iterable

[Killed] EqualityOperator
src/step.ts:143:9
     id: input.id,
     route: input.route,
     steps: Object.freeze([...input.steps]),
-    ...(input.annotations === undefined
+    ...(input.annotations !== undefined
       ? {}
       : { annotations: Object.freeze([...input.annotations]) }),
killedBy: createPathway keeps its id, route, and steps
statusReason: input.annotations is not iterable

[Killed] ObjectLiteral
src/step.ts:145:9
     steps: Object.freeze([...input.steps]),
     ...(input.annotations === undefined
       ? {}
-      : { annotations: Object.freeze([...input.annotations]) }),
+      : {}),
   });
 }
killedBy: createPathway carries authored annotations, which the engine must never compute
statusReason: Target cannot be null or undefined.

[Killed] ArrayDeclaration
src/step.ts:145:38
     steps: Object.freeze([...input.steps]),
     ...(input.annotations === undefined
       ? {}
-      : { annotations: Object.freeze([...input.annotations]) }),
+      : { annotations: Object.freeze([]) }),
   });
 }
killedBy: createPathway carries authored annotations, which the engine must never compute
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/step.ts:150:85
 }
 
 /** The state a pathway starts from, if it has any steps. */
-export function initialState(pathway: MechanismPathway): MechanismState | undefined {
-  return pathway.steps[0]?.from;
-}
+export function initialState(pathway: MechanismPathway): MechanismState | undefined {}
 
 /** The state a pathway ends at, if it has any steps. */
killedBy: initialState and finalState are the first step's from and the last step's to
statusReason: expected undefined to be { id: 'st-0', …(2) } // Object.is equality

[Killed] OptionalChaining
src/step.ts:151:10
 
 /** The state a pathway starts from, if it has any steps. */
 export function initialState(pathway: MechanismPathway): MechanismState | undefined {
-  return pathway.steps[0]?.from;
+  return pathway.steps[0].from;
 }
 
killedBy: initialState and finalState are undefined for a pathway with no steps rather than throwing
statusReason: Cannot read properties of undefined (reading 'from')

[Killed] BlockStatement
src/step.ts:155:83
 }
 
 /** The state a pathway ends at, if it has any steps. */
-export function finalState(pathway: MechanismPathway): MechanismState | undefined {
-  return pathway.steps[pathway.steps.length - 1]?.to;
-}
+export function finalState(pathway: MechanismPathway): MechanismState | undefined {}
 
killedBy: initialState and finalState are the first step's from and the last step's to
statusReason: expected undefined to be { id: 'st-1', …(2) } // Object.is equality

[Killed] OptionalChaining
src/step.ts:156:10
 
 /** The state a pathway ends at, if it has any steps. */
 export function finalState(pathway: MechanismPathway): MechanismState | undefined {
-  return pathway.steps[pathway.steps.length - 1]?.to;
+  return pathway.steps[pathway.steps.length - 1].to;
 }
 
killedBy: initialState and finalState are undefined for a pathway with no steps rather than throwing
statusReason: Cannot read properties of undefined (reading 'to')

[Killed] ArithmeticOperator
src/step.ts:156:24
 
 /** The state a pathway ends at, if it has any steps. */
 export function finalState(pathway: MechanismPathway): MechanismState | undefined {
-  return pathway.steps[pathway.steps.length - 1]?.to;
+  return pathway.steps[pathway.steps.length + 1]?.to;
 }
 
killedBy: initialState and finalState are the first step's from and the last step's to
statusReason: expected undefined to be { id: 'st-1', …(2) } // Object.is equality
